names = [
    'අශාන්ත ලැක්දාසා ෆ්රැන්සිස් ද මෙල්',
    'ඩැන්ඩෙනියගේ සෝමචන්ද්ර ද සිල්වා මහතා',
    'ගිනිගාලාල්ගොඩගේ රම්බා අජිත් ද සිල්වා',
    'රෝයි ලූක් ඩයස්',
    'හෙට්ටියාරචිගිගේ මහේස් ගූනතිලක',
    'ලලිත් වසන්ත සිල්වා කලුපෙරුම',
    'රන්ජන් සෙනෙරත් මඩුගල්ල',
    'ලුවී රොහාන් දුලීප් මෙන්ඩිස්',
    'අර්ජුන රණතුන්ග',
    'බන්දුල වර්ණපුර',
    'සිදත් වෙත්තමුනි',
    'ජෝශප් රවින්ද්රන් රත්නායක',
    'අනුර නන්දන රණසිංහ',
    'රොහාන් ස්ටැන්ලි අමරසිරිවර්දන',
    'රොජර් ජෙරාඩ් ක්රිස්ටෝපර් එඩිරිවීර විජේසූරිය',
    'රොනල්ඩ් ගයි ද අල්විස්',
    'එල්ලෙකුටිගෙ රුෆුස් නෙමෙසින් සුසිල් ෆෙර්නන්ඩො',
    'යොහාන් ගූනසේකර',
    'ශ්රීඩාරාන් ජගනාදන්',
    'විනොතෙන් බෙඩෙ ජොන්',
    'රූමේෂ් ජෝශප් රත්නායක',
    'මිත්රා ද සිල්වා වෙට්ටිමූනි',
    'සම්පත්වඩුගෙ අමල් රොහිත සිල්වා',
    'රොෂාන් පුන්යජිත් විජේසිංහ ගුණරත්න',
    'අමෙරසින්හ මුදලිගෙ ජයන්ත ගමිනි අමෙරසින්හ',
    'සනත් මොහන් සිල්වා කලුපෙරුම',
    'පින්නඩුවගෙ අරවින්ද ද සිල්වා',
]

list_wickets = ["කඩුලු", "විකට්"]
list_runs = ["ලකුණු", "ලකුනු"]
highest = ["වැඩිම", "ඉහලම"]
lowest = ["අඩුම", "අඩුවෙන්ම"]

gte = ["වැඩි","වැඩිය","වැඩිපුර","වැඩියෙන්"]
lte = ["අඩුවෙන්","අඩු"]

all = [names, list_wickets, list_runs, highest, gte, lte]