{
    "Ashantha de Mel": "He was a brisk right-arm bowler with the ability to gain genuine outswing, Ashantha de Mel was Sri Lanka's leading pace bowler following their elevation to full Test status. In Sri Lanka's inaugural test against England in 1981-82, de Mel took a highly creditable 4 for 70 and 1 for 33. In the following tour of Pakistan, he toiled willingly, taking 11 wickets. In the one-off Test against India in 1982-83, he became the first Sri Lankan fast bowler to take a five-wicket haul, grabbing 5 for 68 in the second innings. With the bat, de Mel was a handy performer, capable of valuable contributions in the lower order with his aggressive style. A serious knee injury brought his career to a premature end after the 1987 World Cup, but he went on to represent Sri Lanka at bridge, including an appearance at the Commonwealth Games.  He also served on the interim committee of the Sri Lanka cricket board, and was a national selector and manager of the under-19 side.\nJohann P Jayasekera (April 2004)",
    "Somachandra De Silva": "One of Sri Lanka's finest legspinners, Somachandra De Silva was unfortunate that when Sri Lanka was granted full Test status he was at a stage when most players are well into retirement. He had been a fixture in the Sri Lanka team, and well\nrespected throughout cricketing circles around the world, having played minor county cricket for Linconshire and Shropshire. With his flighted legbreaks and well disguised wrong 'uns, de Silva was a consistent wicket-taker throughout the 70s. In Sri Lanka's inaugural Test he captured 3 for 54 and 0 for 38, his first Test wicket being that of David Gower caught at the wicket by Mahes Goonatilleke. de Silva distinguished himself on the following tour to Pakistan, taking seventeen wickets in three Tests, including the first five-wicket haul by a Sri Lankan when he took 5 for 59 at Faisalabad. When Duleep Mendis was injured early on the 1982-83 tour of New Zealand, de Silva was handed the honour of\nleading Sri Lanka in two Tests. With the bat, he was more than useful making two half centuries, both as captain. He maintained his prominence within the game, later coaching Sri Lanka. He was later appointed cricket advisor by the Sri Lankan president Mahinda Rajapaksa in December 2007 to promote the game in the country's war-hit northern areas. In 2009 De Silva was appointed chairman of a seven-member interim committee to run Sri Lanka Cricket by sports minister Gamini Lokuge.\nJohann P Jayasekera (March 2009)",
    "Ajit de Silva": "Ajith de Silva was a highly rated left-arm orthodox spinner within his homeland. It was a great disappointment to his supporters when he failed to make a significant impact at the\nhighest level. De Silva was selected in the inaugural test team that played England at Colombo. He had a steady, though somewhat disappointing debut taking two wickets in each innings, bowling with admirable accuracy but failing to give the ball sufficient flight on what was a favorable wicket for spin bowling. It was expected that along with D.S. de Silva, he would form a spin combination that would hold Sri Lanka in good stead during its formative years in test cricket. However, this was not the case, his returns in three other Tests were below expectations. On the tour to Pakistan he bowled accurately at Karachi and Faisalabad but struggled to dismiss Test-quality batsman. He ended any\nfurther chance of representing Sri Lanka when in 1982-83 he joined the tour to South Africa. Johann P Jayasekera",
    "Roy Dias": "Roy Dias had an inauspicious debut for Sri Lanka at Test level, batting at No. 3; he was dismissed by Bob Willis without scoring. However, in the second innings Dias displayed his batting talents for all to see stroking an elegant 77. Dias was a joy to watch at the crease, blessed with a wonderful sense of\ntiming, combined with a classical style. Already an experienced first-class cricketer when Sri Lanka gained Test status, Dias formed the backbone of the batting along with Duleep Mendis in the period following the Sri Lanka's inception. In the proceeding Test tour to Pakistan, Dias highlighted his class. Scoring 295 runs at 49.16, including 98 at Faisalabad and then following up\nwith  109 at Lahore, holding firm as the top order crumbled around him in a the face of a withering barrage of pace bowling from Imran Khan. In Sri Lanka's maiden Test victory, and series victory, over India at home in 1985-86, Dias' contribution was decisive. Twin fifties in the second Test had helped set up\na win, then with Sri Lanka on the brink of oblivion in the final Test, Dias rescued Sri Lanka with a superlative 106, ensuring a draw was achieved. Following retirement, Dias maintained his profile in the game coaching Sri Lanka for a period.\nJohann P Jayasekera",
    "Mahes Goonatilleke": "An efficient gloveman and proficient batsman in the lower order, Goonatilleke was Sri Lanka's wicketkeeper during their initial foray into the Test arena. An accomplished player, Goonatilleke established his position in the side leading up to the Sri Lanka's Test debut. His performances in Tests were promising, as he was a capable performer behind the wickets comfortable against pace or spin. With the bat he provided great resistance producing some handy performances. Such was his ability he was asked to open the batting in the second Test at Faisalabad. He performed admirably scoring 27 in the first innings and then top-scoring with 57 in the second innings, providing stoic resistance as the batting capitulated around him. Sri Lanka were robbed of a quality player when he disappointingly\nopted to tour South Africa in 1982-83, ending his Test career overnight.\nJohann P Jayasekera",
    "Lalith Kaluperuma": "Lalith Kaluperuma was an accomplished offspinner at domestic level when Sri Lanka was granted Test status. Also capable in the lower order with the bat, he failed to transfer his domestic form to the international arena. Playing in Sri Lanka's inaugural Test against England, one of three spinners, he was used sparingly as the two de Silvas, D.S. and Ajith, shared the brunt of the workload. Making the proceeding tour to Pakistan he was selected for the second Test at Faisalabad, again he was  overshadowed by the de Silva's bowling only six overs in the match. He ended any\nchances of further representative honors choosing to join the tour of to South Africa in 1982-83. He later became a national selector and headed the selection panel in May 2005, taking over from Ashantha de Mel. Johann Jayasekera",
    "Ranjan Madugalle": "An ever-present fixture during Sri Lanka's formative years in the Test arena, Madugalle was a stylish right-hand batsman whose career record perhaps does not reflect his talent. Making his debut in Sri Lanka's maiden Test against England in 1981-82, he made an instant impact, top-scoring with a composed 65 after the top order had surrendered. Madugalle was a solid performer during his career though at Test level the large scores eluded him. His only Test century was made against India in 1985-86 season at the SSC - he was far more comfortable on home wickets - in Sri Lanka his average was a healthy 42.76, while abroad it was a paltry 21.50.  He was only once on the winning side in his  21 Tests, and he led Sri Lanka in two Tests, although the experience was a trying one losing both to Australia and England, and suffering a lean spell with the bat.  He became an ICC match referee in 1993 and in 2001 he was appointed as the first chief referee.  His easy-going exterior and charming personality are a mask for someone who has a reputation as a strict disciplinarian.\nMartin Williamson August 2006\n",
    "Duleep Mendis": "Wisden OverviewA strong, burly, wristy batsman capable of destroying attacks at any level when the mood took him, Mendis played in key part in Sri Lanka's early days as a Test-playing country.   Mendis, who had first played for Sri Lanka in 1972 while at school but was almost 30 when they played their first Test, made a shaky start, but quickly found his feet, despite having the additional burden of captaining the side from their third Test.  He hit 105 in both innings against India at Madras 1982-83, and nearly repeated the feat two years later against England at Lord's, with 111 and 94. Considering the circumstances, he performed admirably leading Sri Lanka to its inaugural Test and series victory against India in 1985-86, scoring 310 runs at 62.00.  Following his hundred against Pakistan the following winter he went into a steady decline, scoring only two fifties in his last 10 Tests.  He was replaced as captain by  Ranjan Madugalle for the tour to England in 1988, where he signed off with 56 in his final Test at Lord's.  He remained in the public eye, with Sri Lanka's World Cup success coming while he was managing the side.",
    "Arjuna Ranatunga": "Arjuna Ranatunga is a stockily-built left-handed batsman who led Sri Lanka to their greatest cricketing triumph, the 1996 World Cup. His innovative captaincy took a Sri Lanka team given little chance prior to the competition for cricket's greatest prize. He made his debut in Sri Lanka's inaugural Test at the age of 18, and made his country's first Test half-century. A dominant figure on cricket fields all over the world for nearly 20 years, he never shied from confrontation, defending his players and rights to the hilt.Despite his relative inability to scamper the quick single which is considered essential in one-day cricket, Ranatunga had an uncanny ability to keep the scoreboard ticking over using deft placement on both sides of the wicket, combined with fluent driving through the offside in particular. He was a deceptive and useful medium-pace bowler, although his bowling was seen rarely in the later part of his career. He lost the captaincy following Sri Lanka's poor showing in the 1999 World Cup, and retired from international cricket a year later, but his contribution to Sri Lankan cricket is immense.  He moved into administration and was appointed chairman of the board in January 2008. He was sacked in December after a controversial tenure in which he took several decisions that went against the grain. \nCricinfo staff",
    "Bandula Warnapura": "Bandula Warnapura had the honour of leading Sri Lanka when they finally became a fully-fledged Test-playing country. An opening batsman with a solid technique,\nWarnapura was also a capable medium-pace bowler. He failed to make an impression with the bat in his four Tests, achieving his highest score of 38 in Sri Lanka's inaugural Test. His bowling was more effective in the one-day format where he had the ability to maintain a steady line and capture the occasional wicket.He had been a consistent member of early Sri Lankan teams, providing a solid presence at the top of the order. Charged with the difficult task of leading Sri Lanka in their formative years Warnapura did a commendable job. However, when he decided to tour South Africa with rebel team in 1982-83, he was handed a life ban from Sri Lankan cricket. Johann P Jayasekera",
    "Sidath Wettimuny": "Sidath Wettimuny was a fixture at the top of the order following Sri Lanka's inauguration into the Test arena. Wettimuny was a solid right-hand batsman with a compact technique. Wettimuny was the younger of two brothers to play for Sri Lanka; in fact in a rare instance he opened the batting with his brother, Mithra, in two Test matches. Wettimuny made two centuries at test level both\nof them having historical significance. At Faisalabad, on Sri Lanka's initial overseas tour, Wettimuny stroked a 157, sharing a partnership of 217 with Roy Dias for the second wicket. It was the maiden century at Test level by a Sri Lankan player. At Lord's in 1984, Wettimuny eclipsed his previous effort scoring a superlative 190 in 642 minutes facing 471 balls. Marvellous strokeplay and a steely determination to succeed punctuated the innings. Wettimuny also became the first Sri Lankan to carry his bat through an innings when he completed the feat against New Zealand at Christchurch in 1982-83 - he scored an unbeaten 63 out of a meager total of 144.Wettimuny suffered from not having a stable partner up the opposite end as Sri Lanka struggled to find an established opening partnership. Towards the end of his Test career he struggled to match his earlier achievements with the bat. His\nrecord shows he was a far more effective player on overseas wickets.After the conclusion of his playing days Wettimuny stayed involved in the game initially as a match referee and later becoming the chairman of selectors for the Sri Lankan cricket team.Johann P Jayasekera",
    "Ravi Ratnayeke": "Ravi Ratnayeke was a player capable of genuine allround performances with both bat and ball in hand. A right-arm medium-pace bowler with the ability to bowl at a lively pace and move the ball in favorable conditions. To compliment his ability with the ball he was also a competent left-hand batsman in the lower order. As his career developed so did his batting, such was his ability he was asked to open the batting at test level and did so with success. Perhaps his greatest attribute was his tenacity and resolve, always willing to compete in a side that was usually less than competitive. Scripted into the side as a 21 year old, Ratnayeke was originally selected as a specialist bowler. On the unresponsive wickets in Pakistan he toiled in relative obscurity earning four expensive wickets and batting as low as No. 10. Wickets and runs were difficult to come by at first, but the selectors persevered and against New Zealand at the SSC he had a breakthrough when he took 5 for 42. The back-to-back series against Pakistan enabled Ratnayeke cement his position in the side with impressive displays with the ball and his ever improving batting provided valuable runs in the lower order. At Sialkot he produced a devastating display wrecking the Pakistan innings with figures of 8 for 83, the figures remaining the benchmark for all Sri Lankan bowlers until recent times. Pushed into the opening position on the tour of India in 1985-86, Ratnayeke responded to the added responsibility. In his debut innings combating the new ball he scored a remarkable 93 adding 159 with Siddath Wettimuny, later capturing 4 wickets in a superb allround display. In the second Test, as Sri Lanka capitulated he\nheld firm top scoring with 54, upstaging his more distinguished colleagues. He completed an outstanding series capturing 5 for 85 in the final test at Cuttack.\nThis determination and competitive nature was highlighted in his series against Australia. In 1988 he toiled manfully as Australia crushed the Sri Lankans, capturing 4 for 98 in 40 tidy overs. With the bat he scored 28 and 34 as the rest of the batting yielded. In the next series in Australia, the penultimate in his career, he batted with purpose and resolve scoring two fifties both when Sri Lanka were at their greatest need.\nJohann P Jayasekera",
    "Anura Ranasinghe": "A schoolboy prodigy Anura Ranasinghe made his international debut in the 1975 World Cup against the might of the West Indies whilst still only 18 years of age. Ranasinghe played in all three matches for the Sri Lankans without producing any performance of note. His Test debut came on Sri Lanka's inaugural Test tour of Pakistan in 1981-82, but he struggled with the bat scoring 6 and 5 batting at No. 7. Despite taking the new ball he was used sparingly although he did take 1 for 23 in the first innings. His second and final Test came against India later in 1982 - he made a duck in the first innings but showed his skill in making a battling 77 second time round, a n innings which not only help Sri Lanka save the game after conceding a first-innings lead of 230, but almost allowed them to snatch a remarkable win as India closed on 135 for 7 chasing.  He was expected to continue to be a key player in the fledgling Sri Lankan team but all that ended when he chose to join the infamous Sri Lankan rebel tour to South Africa in 1982-83, earning him a life ban.  When that was rescinded in 1989 he resumed his club career for another couple of seasons and then moved into coaching.  He died suddenly in 1998 four days before his 42nd birthday. Martin Williamson",
    "Rohan Jayasekera": "Rohan Jayasekera toured England in 1979 with the Sri Lankan team performing the dual role as a forceful batsman and reserve wicketkeeper to Stanley Jayasinghe. However, he did not play in the World Cup as Jayasinghe was preferred. Making his debut in Sri Lanka's inaugural one-day international on home soil against England,  he kept wicket  and scored 17 as Sri Lanka were defeated by six runs in a thrilling encounter. His sole Test came on the tour of Pakistan when he played as a specialist batsman at Lahore. Imran Khan routed Sri Lanka, taking 14 wickets, Jayasekera constituted two of those, bowled for 0 and 2. Not selected again,  Jayasekera became another member of the exclusive one-Test club.\nJohann P Jayasekera ",
    "Roger Wijesuriya": "Sri Lankan left-arm spinner Roger Wijesuriya has a claim to being the most toothless bowler in Test history. He played four Tests between 1982 and 1986, and had a strike rate of a wicket every 586 balls. On average it took Wijesuriya 97 overs to take a wicket. In other words, if he bowled at both ends throughout a five-day Test, the opposition would be only four down at the end of the match ... and they would have scored 1355 runs.  He made more impression earlier in his career when he took 25 wickets in an U19 series against Pakistan.Rob Smyth",
    "Guy de Alwis": "De Alwis had a constant tussle with Amal Silva to maintain the No.1 wicketkeeping berth. Quite tall, De Alwis was considered the superior keeper, though Silva held the upper hand in the batting stakes by quite a stretch. Mahes\nGoonatilleke's defection allowed de Alwis to make his debut on the 1982-83 tour of New Zealand. One of seven debutants in the first Test at Christchurch, de Alwis scored 0 and 3 and took one catch. Amal Silva was preferred in the next match, though De Alwis kept in all three Tests when New Zealand toured Sri Lanka. De Alwis's keeping was exemplary and while he made some handy scores in the lower order he could not convert them. Injury on the 1984 tour of England cost him his place, and Silva had a tremendous Test at Lords and kept his place with some solid knocks thereafter. In his further Tests - when Silva was injured or unwell - de Alwis kept tidily but his batting was below standard. Conversely in the one-day game de Alwis was quite a useful lower-order batsman.\nJohann P Jayasekera",
    "Susil Fernando": "",
    "Yohan Goonasekera": "One of many players given an opportunity on the 1982/83 series of\nNew Zealand it proved to be Goonasekera's only international\nseries. Against a high class New Zealand pace attack featuring\nSir Richard Hadlee, Cairns, Chatfield and Snedden he had a torrid\ntime although his scores did improve each innings. Goonasekera's\nnotable achievement was snaring four catches in the first innings\nof the second Test at Wellington, a record effort by a Sri Lankan\nequaled by Hashan Tillekeratne a decade later. The left handed\nbatsman had an improved series in the one day encounters though\nit was not enough to convince the selectors to persevere with\nhim.(Johann P Jayasekera , Sep 1999)",
    "Sridharan Jeganathan": "The first Sri Lankan Test player to die, allrounder Srid­haran Jeganathan passed away on May 14, aged 44. A left-arm spinner and lower-order right-hand batsman, Jeganathan played in both Tests of the injury-hit tour of New Zealand in 1982-83. His disappointing return of 19 runs (4.75) included four single-figure scores, and he failed to take a wicket. Ignored for a while, he was recalled for the 1987 World Cup in India and Pakistan, dismissing Richie Richardson of West Indies and taking both wickets (Gooch and Robinson) in the eight­wicket defeat by England at Pune. His 2 for 45 there remained his best bowling in five one-day internationals, in which he took five wickets (41.60) and scored 25 runs (8.33). Jeganathan had toured Eng­land with the team which won the inaugural ICC Trophy in 1979, and took 4 for 92 against Nottinghamshire. In all first­class cricket he took 49 wickets (31.61), and scored 437 runs at 13.66. His highest score, of 74, was made against Tasmania at Devonport on that 1982-83 tour: coming in at 89 for 7, he put on 140 for the eight wicket with Ravi Ratnayeke (64 not out). He later became Malaysia's national coach.\nWisden Cricketers' Almanack",
    "Vinothen John": "Vinod John had a brief but successful international career. A robust medium-pace bowler, John made his debut against New Zealand at Christchurch in 1982-83. The second Test highlighted his ability as he made inroads into the middle lower-order taking 5 for 60. In the return series in 1983-84, John consistently troubled the New Zealand batsman to capture 16 wickets in the three Tests. In the Lord's Test against England, his final Test match, he put in a wholehearted performance bowling 39.1 overs conceding a mere 98 runs, taking four wickets in the process. In the one-day format he had less success though he maintained a reasonable\neconomy rate.\nJohann Jayasekera",
    "Rumesh Ratnayake": "The wiry Ratnayake made his debut as teenager and displayed the\nability to generate pace and bounce with his whippy action.\nRatnayake was a consistent performer during the late eighties\nand early nineties troubling batsman with his ability to swing\nthe new ball at a lively pace. However, due to injury he was\nnever able to really fulfill his potential, though he showed\ndetermination to return to test cricket he was never quite the\nsame bowler as in his younger days. Nevertheless he was a fine\ntest bowler and one of the better pace bowlers produced by the\nisland nation. A capable hitter in the lower order Ratnayake\nplayed some handy innings with the bat.Making his debut against New Zealand at Christchurch he made an\nimmediate impression taking the new ball providing the kiwi\nbatsman with some awkward moments. In the 1985/86 series against\nIndia he came of age bowling superbly to capture 20 wickets at\n22. At SSC he bowled with sustained pace and stamina capturing\n6/85 from 41 overs. In Sri Lanka's comprehensive victory in the\nsecond test Ratnayake was a major factor taking 9 wickets in the\nmatch. Along with Ashantha de Mel and Saliya Ahangama the pace\ntrio tormented the Indian batsman leading Sri Lanka to an\ninaugural series victory.Niggling injuries were always a blight on his career, though he\ntoiled manfully in generally unresponsive conditions. On his day\nhe remained a quality pace bowler on the 1990/91 tour of\nAustralia he produced a outstanding display of swing bowling in\nhis only test at Hobart capturing 6/66. At Lords he gave another\na ccomplished display taking 5/69, his pace and swing causing the\nEnglish bats immeasurable trouble. With the bat he then rescued\nthe team with a bright half century. Too often though his\nperformances were let down with lackluster batting as Sri Lanka\ncustomarily wasted opportunities to press home the advantage that\nRatnayake had helped achieve. Injuries limited his effectiveness\nin the series in Pakistan and it proved to be his final test\nseries.(Johann P Jayasekera , Sep 1999)",
    "Mithra Wettimuny": "Mithra Wettimuny's cricket career was brief - of his nine first-class appearances, two were Tests, only one was in Sri Lanka, and they spanned a little over four months in 1982-83. A diminutive top-order right-hand batsman, he scored fifty on his first-class debut in Zimbabwe, but failed to do so in any of his remaining outings. Despite this, he was selected to tour New Zealand, making his two Test appearances on that tour where he managed 28 runs in four innings. They were his last first-class matches. In the first of these games he opened the innings with his younger brother, Sidath - only the third instance of brothers opening together. Their older brother, Sunil, also played for Sri Lanka before they gained Test status/\nMartin Williamson",
    "Amal Silva": "Amal Silva filled two vital roles in his time with the Sri Lankan\nteam and he did both with style, though eventually the burden was\ntoo much for one player to deal with. Silva, a capable left hand\nbatsman and competent wicketkeeper, was asked to fill the opening\nposition combined with his role as wicketkeeper.  With the bat\nSilva was capable enough to defend the new ball and had attacking\nstrokes when the situation warranted. Behind the stumps he was\nmore at ease against the pacemen where he could use his athletic\ngifts.  Making his debut against New Zealand Silva scored 8\nand 0, hardly an inspiring debut with the bat - with the gloves\nhe snared 2 catches. Guy de Alwis was preferred in the three\nTests against New Zealand on the following tour. Silva's battle\nwith de Alwis to maintain the position as number one gloveman was\na constant throughout his early career. Injury to de Alwis on the\n1984 tour of England gave Silva his second cap and he took his\nopportunity with aplomb. Silva opened the batting making an\nassured unbeaten 102 in the second innings to compliment his\nthree catches behind the wicket. Silva had an excellent all-round\ntour with the bat and it was a sign of things to come in the\nfollowing Test series against India. In the first Test at SSC he\ntook 9 catches as Sri Lanka drew the Test. In the second he had a\nsensational all-round match, scoring  111, taking 8 catches and\nmaking 1 stumping, Silva was a major player in Sri Lanka's\ninaugural test match victory. In all Silva captured 22\ndismissals, 21 catches and 1 stumping, still a record for a Sri\nLankan keeper in a series to this day.  Following this\nunprecedented performance Silva's career went into a decline as\nhe struggled to deal with the responsibility of combating the new\nball and then keeping wickets to an international standard. After\nthe series in 1985/86 against Pakistan the selectors preferred\nother options. Silva made a return in the one off test against\nEngland in 1988 but it proved to be short lived.(Johann P Jayasekera , Sep 1999)",
    "Roshan Guneratne": "Roshan Guneratne made his first class debut against the touring Australians playing for the President's Board XI in the lead-up to the one-off Test at Kandy in 1982-83. Guneratne captured the wickets of Kepler Wessels and Greg Chappell finishing with 2 for 66. The selectors were sufficiently impressed to include him in the starting XI for the Test despite the fact that they already had an established legspinner in DS de Silva. It proved to be an unhappy time as the Australians rattled up 514 for 4 before declaring, Guneratne bowling 17 expensive overs, taking 0 for 84. Sri Lanka suffered a crushing victory and it proved to be Guneratne's sole test appearance. He went on to represent NCC, Moors SC and Nomads in Division One domestic cricket before leaving for the USA to join his mother and sister. He died in California at the age of 43, only the third Sri Lankan Test player to die.\n\nJohann P JayasekeraWisden Cricketers' Almanack obituaryGUNERATNE, ROSHAN PUNYAJITH WIJESINGHE, died of a heart attack in California on July 21, 2005, aged 43. Guneratne was a leg-spinner for the Nomads club, who played one Test for Sri Lanka; he had just left Colombo's Nalanda College and was playing only his second first-class match. After dismissing Kepler Wessels and Greg Chappell on his first-class debut, for the Board President's XI in April 1983, he was picked for the only Test of the tour, but failed to take a wicket or score a run in an innings defeat. After just 17 wickets in a 13-match first-class career, he left to join his family in the US. He was only the third Sri Lankan Test cricketer to die, after Sridharan Jeganathan and Anura Ranasinghe, and the current team wore black armbands in his memory on the first day of the Kandy Test against West Indies.",
    "Jayantha Amerasinghe": "In his first-class debut playing for a Sri Lankan board XI against Zimbabwe, Amerasinghe captured captured 10 for 130. Like many Sri Lankan players of the time he was thrust into the Test team shortly afterwards, making his debut at Kandy against the touring New Zealand team in 1983/84. Amerasinghe made a meritorious debut. Arriving at the crease with Sri Lanka 155 for 9, he proceeded to add 60 runs with Vinod John, then a record tenth-wicket stand for Sri Lanka. Amerasinghe top scored with 34. However, his left-arm orthodox spin was used sparingly, and he bowled only 20 overs in the whole Test. Amerasinghe played in the following Test at Colombo, his final appearance, taking a career-best 2 for 73 from 30 tidy overs.\nJohann Jayasekera",
    "Sanath Kaluperuma": "A right hand top-order batsman and handy off-spin bowler\nKaluperuma struggled to adjust in his brief opportunity at\ninternational level. Blooded during a period in which Sri Lanka\nwas searching for players with the ability and determination to\nsucceed at the highest level, Kaluperuma's form for the under 23\nside brought him to the attention of the selectors. Making his\ndebut against New Zealand batting at number three he failed to\nmake an impression with the bat although he did capture 2/17 with\nhis off-spinners. Playing all three Tests in the series, he\nfailed to pass 30 in his six innings and he was dropped. Earning a\nrecall nearly four years after his previous opportunity for the\none off Test against Australia at Perth, Kaluperuma suffered a\ntorrid time and it proved to be his final Test.(Johann Jayasekera , Sep 1999)",
    "Aravinda de Silva": "One of the game's best entertainers, de Silva possessed the strengths of many of the tallest short run-scorers: unruffable technique, strong at cutting and hooking, an unrepentant attacker. His record is unrivalled among countrymen, his place in history secure after a match-winning century in a World Cup final. He stands 5ft 3 1/2in and arguably there has not been a better smaller player. His enthusiasm was amazing: he was a virtual ever-present in the Sri Lanka side and also played first-class and club cricket in England, South Africa and Australia. His international career ended with the 2003 World Cup, where he batted with all the verve and panache of old, and bowled his offspinners cannily. Sri Lanka's cricket authorities ensured that his wealth of cricketing experience would not go waste, appointing him a national selector. His other main interests are cakes and cars (usually fast ones).  Simon Wilde",
    "Saliya Ahangama": "Franklyn Saliya Ahangama had a meteoric rise to the Sri Lankan Test side. After making his first-class debut for the Sri Lankan Colts in 1985-86, he found himself thrust into the Test side to play India a mere two weeks later. He had a\ntriumphant entry into Test cricket capturing the wicket of Mohammad Azharuddin with only his fourth ball finishing with a match analysis of 5 for 109. In the third Test at Kandy he returned a career-best 5 for 52, ending the three-Test series with  18 wickets at 19.33. Sri Lanka's lack of Test cricket and injuries\nprevented him from appearing in more, and despite touring England in 1988 and 1991 he never played another Test. He subsequently moved into broadcasting as a television commentator.",
    "Asoka de Silva": "Following an international cricket career from 1985-1992 where he represented his country in 10 Tests and 28 ODIs as a right-arm leg-spinner, Asoka de Silva quickly emerged as Sri Lanka's best-regarded cricket umpire. After he retired from first-class cricket in 1996/97 De Silva became a fully qualified coach before turning his attention to umpiring. He made his international debut at Galle against Pakistan in 1999/00 and was on the ICC's Elite Umpires Panel for a brief period of time before being relegated in early 2004. He however remains a member of the ICC International Umpires Panel and is often appointed to matches to support the Elite panel during busy periods in the international cricket season. Has umpired in two Cricket World Cups in 2003 and 2007. Sa'adi Thawfeeq  February 2008",
    "Sanjeewa Weerasinghe": "Sanjeewa Weerasinghe was chosen to represent Sri Lanka as a schoolboy, making his debut against Indian in 1985 at the age of 17 years 189 days - the youngest person  to play a Test for Sri Lanka. A legipinner, Weerasinghe was viewed as a potential successor to DS de Silva. In his debut Sri Lanka beat India, and although Weerasinghe was used sparingly,  he bowled tidily without taking a wicket. It proved to be Weerasinghe's only Test despite making a subsequent tour to Pakistan.   Thereafter he rarely sparkled and his career was over before he was 30.\n\nJohann P Jayasekera",
    "Roshan Jurangpathy": "At the time of his debut Jurangpathy was the fourth-youngest player to represent Sri Lanka. A supremely gifted allrounder, the selectors showed little patience or faith discarding him after only two Tests. Admittedly his performances\nwere below par, but considering his age, with some guidance and time he could have developed into an allrounder of international class. Jurangpathy shot to prominence when representing the Under-23 side against Pakistan with some remarkable performances. At 17 years and 342 days he became the youngest Sri Lankan player to score a first-class hundred. He found the transition from\nschoolboy to Test cricketer a difficult one. In four Test innings he scored three ducks and a single, and he was under-bowled on his debut, delivering only four overs. In his second and final appearance he captured 1 for 69 from 21 overs with his offspin. Discarded by the selectors and ignored somewhat harshly thereafter he later turned up playing grade cricket in Western Australia.\nJohann Jayasekera",
    "Asanka Gurusinha": "Wisden overview A technically accomplished No. 3, Asanka Gurusinha was the rock on which the Sri Lankan batting was founded for 11 years. His gutsy lone battles earned the respect of opponents around the world: a Sri Lankan total of 82 in Chandigarh in 1990-91 contained an unbeaten Gurusinha half-century; at Melbourne in 1995-96, he scored 143 to his team-mates' 144; and with Aravinda de Silva's help, he turned the tables on Australia in the 1996 World Cup final with another half-century. He started Test cricket as a teenager as a wicketkeeper-batsman, but retired prematurely a year after the World Cup triumph after refusing to return home for training from a season of club cricket in Melbourne, where he now lives. He was badly missed.   Simon Wilde",
    "Jayananda Warnaweera": "Warnaweera was an effective bowler in his limited Test career. An\noffspinner, Warnaweera bowled the ball at a quick pace but\nquestions over the legality of his action eventually saw him\nsanctioned from the international arena.Under home conditions where he played the majority of his Tests\nhe was a dangerous customer. A promising series against an\nEngland A team saw Warnaweera make his test debut against\nPakistan in 1986. Used sparingly he had the figures of 1/26\nbowling only 8.3 overs and had to wait till November 1990 for his\nsecond chance in the one off Test against India, taking 3/90 from\n46 tidy overs. On the following tour of NZ he went wicketless at\nWellington in what turned out to be his only Test in the series.\nRecalled against New Zealand in 1992/93. At SSC he took 4/25 as\nSri Lanka spun New Zealand out, winning the Test and hence the\nseries 1-0. At the same ground Warnaweera was instrumental in\nhelping Sri Lanka to its first victory over England capturing\n8/188 from 65.1 overs in the match. Against the Indian batsman he\nwas less effective taking 6 wickets in 3 Tests.Following the conclusion of his playing career Warnaweera became\ninvolve in the preparation of the Galle stadium. One of his\nproudest moments being when the ground hosted the second Test\nagainst Sri Lanka and New Zealand, its inaugural international\nfixture.(Johann P Jayasekera , Sep 1999)",
    "Don Anurasiri": "A steady left-arm orthodox spinner, Don Anurasiri had a static international career. After making his international debut at the age of 20, he remained around the fringes of the team for a number of seasons without ever cementing a permanent position.  Whenever called upon he was a wholehearted performer, though at Test level his bowling lacked penetration, highlighted by the fact he never took a five wicket haul in 18 Tests. Capable of extended spells of sustained accurate bowling, willing to flight and turn the ball, Anurasiri was often used to contain the batsman on unresponsive wickets. He enjoyed his most successful series against the touring Australians in 1992-93, taking 10 wickets.   Anurasiri's career at the international level appeared over when he fell out  with the SL board in 1994. However, four years later he made a surprise comeback   against Zimbabwe in the final Test in 1997-98. Spinning the ball away from the bat he provided a solid foil for Muttiah Muralitharan, capturing 3 for 65 and 1 for 41, and in the process helped Sri Lanka to victory.  But he played only three more first-class games, and within six weeks of his final Test appearance his career was over.Johann Jayasekera",
    "Kosala Kuruppuarachchi": "Kosala Kuruppuarachchi proved a difficult proposition for both commentators and batsman alike on his debut. A left-arm medium-pace bowler Kuruppuarachchi had a dream introduction into the Test arena. In the first innings he produced a sterling display capturing 5 for 44 as the Pakistan batting lineup was routed. In the second innings he provided solid support for Ravi Ratnayeke taking a further two wickets. Sri Lanka achieved their first victory over Pakistan in Test cricket and Kuruppuarachchi took a major part in it. Injury forced him to miss the final Test in the series. Sadly his only other Test was during the abandoned Test series against New Zealand.\nJohann P Jayasekera",
    "Roshan Mahanama": "A dashing right-hand batsman and brilliant fielder Roshan Mahanama's is best remembered as a cricketer for his world record second wicket partnership of 576 with Sanath Jayasuriya in a Test match against India at the R Premadasa Stadium in 1997, since surpassed by Kumar Sangakkara and Mahela Jayawardene in 2006. Mahanama's contribution to that partnership was 225, the highest score of his career. He was a key member of Sri Lanka's World Cup winning side of 1996. Following his team's disastrous showing in the 1999 World Cup, Mahanama was dropped from the side to groom young talent. But when players older than him still found a place it hurt Mahanama and as a matter of principle and self-respect he decided to retire. Soon after Mahanama put out his biography 'Retired Hurt' which delves deeply into the ups and downs of his career. His affable character and good breeding saw him follow Ranjan Madugalle as an ICC match referee in May 2004, a role he has fulfilled quite competently.\nSa'adi ThawfeeqFebruar y 2008",
    "Kaushik Amalean": "Kaushik Amalean was selected to play for Sri Lanka as a twenty year old in the final Test of the 1985-86 home series against Pakistan. An impressive display against an England B team had brought his name to the selectors attention. A right-arm fast-medium bowler, he was capable of bowling at a sharp pace gaining inswing with his action. Given the new ball he responded by taking 3 for 59, including the wickets of Moshin Khan and Javed Miandad. Amalean's only other Test match was played on the 1987-88 tour to Australia, when Sri Lanka were crushed at Perth in the one-off Test, though Amalean took a respectable 4 for 97 in Australia's only innings.\nJohann P Jayasekera",
    "Graeme Labrooy": "A medium-fast bowler capable of producing displays of quality swing bowling, Graeme Labrooy modeled his text book action on Richard Hadlee. Labrooy formed what seemed to be a promising new ball partnership with Rumesh Ratnayake but for a variety of reasons his Test career was brief. Capable with the bat, on his day he could produce an attacking array of strokes that often set the opposition team aback with its ferocity. Labrooy made an inauspicious debut against India, batting at No. 11 and taking one expensive wicket as  batsmen dominated the Test. At Lord's against England he added 64 for the last wicket with Ravi Ratnayeke, scoring 42 stylish runs while claiming 4 wickets with the ball. His development was held back by Sri Lanka's sporadic Test schedule. Due to the political tension in his homeland all of his nine Tests spread over a lengthy period, were played overseas. On the Australian tour he\ncaptured his first five wicket haul taking 5 for 133 at the Gabba. On the tour of New Zealand he just seemed to finding his feet at international level taking the new ball with Rumesh Ratnayake. With the ball he captured 13 wickets. In the third Test at Auckland, unfortunately his final Test, he had a superb allround match. With the ball he captured 3 for 48 and 4 for 42 and with the bat he launched an astonishing display battering the Kiwi attack, scoring an unbeaten 70 in 80 balls with  14 boundaries.\nJohann P Jayasekera",
    "Brendon Kuruppu": "Greatness was firmly thrust upon Sri Lankan wicketkeeper-opener Brendon Kuruppu, but only for a day or two, as he became only the third person to score a double-century on his Test debut, against New Zealand - Richard Hadlee and all - in Colombo. Kuruppu did it the hard way too: his 777-minute innings is the slowest double-hundred in first-class history, all very out of character for a man who later made his reputation as a one-day slogger. It was his first first-class century, and his last Test century: Kuruppu only played four Tests, two of them in England, in 1988 and 1991.\nRob Smyth",
    "Champaka Ramanayake": "Ramanayake was a wholehearted performer, a willing worker with a steely determination -  he never shirked the issue. During a period when Sri Lanka lacked a true pace bowling threat Ramanayake, a genuine medium pacer, bore the brunt of the work-load. Ramanayake lacked the raw pace to be a genuine\nwicket-taking threat at Test level. An honest toiler he usually managed to check the batsman without dismissing them.On his Test debut against Australia in Perth he went wicketless. His first wicket came in his second Test against England when he dismissed Phil Newport. On the 1989-90 tour of Australia he was forced to work hard for his four wickets, though better times came on the tour of New Zealand when he provided solid support for Labrooy and Ratnayake taking 11 wickets in the three Test\nseries. The role of support bowler suited Ramanayake to a tee as he was capable of extended spells of accurate bowling. Ramanayake's moment of glory came in the subsequent home series against Australia  when he spearheaded the attack taking 17 wickets in 3 Tests, including a career-best 5 for 82 at Moratuwa. He\nformed a successful new ball partnership in this series with new boy Duleep Liyanage causing the Australian top order difficulties with movement and swing. It was a just reward for the perseverance and willingness to work under arduous conditions. It proved to be a brief glimpse of the heady heights of stardom as\nRamanayake returned to grafting out Test batsman for the remainder of his international career.At the one-day level Ramanayake's style was an effective weapon and he was an excellent performer with his steady line and length. His ability to control the run rate made him a permanent fixture in this form of the game.After playing his final Test in 1993 he maintained a position in the one-day outfit before drifting from the international scene. A fine domestic season prior to the tour of Australia in 1995-96 saw him thrust his name in front of selectors. They could have done worse than selecting Ramanayake, and they did deciding to go with a younger generation, none of which performed with any note.A qualified coach at Level I (English) and Level II (Australian), he headed Sri Lanka's Fast Bowling Academy for seven years, grooming several bowlers who went on to play for the country. He was appointed Bangladesh's fast bowling coach in March 2008. \nJohann P Jayasekera",
    "Ranjith Madurasinghe": "Highly rated in domestic circles, Madurusinghe failed to make an impact at international level in his limited opportunities. With his tall build,  Madurusinghe could gain bounce when delivering his well-flighted offspin. He  went wicketless in his debut against England at Lord's in 1988, but had greater success in his second Test. Against a highly rated Indian batting line-up at Chandigarh, he took 3 for 60, including the wickets of Mohammad Azharuddin and\nSachin Tendulkar. Surprisingly he was not chosen again until the 1992-93 series against Australia, where playing in the opening Test at the SSC -  he was used sparingly and again was wicketless. It proved to be his final international match, the emergence of Muttiah Muralitharan putting paid to any further opportunities. He remained a fine bowler at domestic level and a more than capable lower-order batsman.\nJohann P Jayasekera",
    "Athula Samarasekera": "Athula Samarasekera was an imposing figure; a strapping physique leant him the ability to play some commanding innings. With the bat in hand he was capable of powerful strikes and was a more than handy medium-pace bowler. Samarasekera made an inauspicious start to his career, scoring a duck on his one-day international\ndebut. On his Test debut he matched the performance, being dismissed in the first innings for a duck. In the second innings he played a characteristically breezy innings making 57, punctuated by a number of boundaries. He completed a promising allround match capturing two wickets and taking two catches. Too\noften though Samarasekera was dismissed when he seemed set to dominate the bowling, a substantial score beckoning. When he did score it was well worth watching as he provided maximum entertainment with his aggressive style. Never able to fully establish a permanent position in the team, Samarasekera chose to\nend his international career by deciding to take up professional cricket in Bangladesh.\nJohann P Jayasekera",
    "Dammika Ranatunga": "The eldest of three brothers to represent Sri Lanka at Test level Dhammika Ranatunga had a brief sojourn in the international arena. A stoic opening batsman unsurprisingly blessed with an unflappable temperament Ranatunga opened the batting for Sri Lanka on the tour of Australia in 1990-91. Though it proved to be his only Test series he performed admirably batting with patience and resoluteness making 40 in his debut innings, and following up with 45 at Hobart. His introverted style seemed suited to the longer format of the game and in his limited chances at one-day level he struggled. He subsequently became an influential administrator in the Sri Lankan cricket hierarchy, and was chief executive of the Cricket Board.\nJohann P Jayasekera",
    "Gamini Wickremasinghe": "Gamini Wickremasinghe was a victim of the selectors whims. A solid performer behind the wickets and a determined lower-order batsman, he was never given a chance to establish a permanent position within the national team. Ironically the selectors preferred his Nondescripts team-mate Hashan Tillekeratne as the\nSri Lankan wicketkeeper despite the fact that at club level Wickremasinghe held the position while Tillekeratne played as a specialist batsman. Wickremasinghe made his Test debut against Australia at the Gabba on the 1989-90 tour taking three catches behind the wicket and scoring two runs. Injury forced him to miss\nthe second test at Hobart and Tillekeratne took over the position giving an impressive display. From that point on Wickremasinghe was cast into the background as the selectors preferred Tillekeratne due to his pedigree as a batsman at domestic level. Wickremasinghe continued to be a steady, capable performer at domestic level and earned a recall against New Zealand in 1992-93. Sri Lanka won the series and Wickremasinghe gave an assured display behind the wickets dealing with the spin of Muralitharan, Warnaweera and Anurasiri with style. However, the selectors in their wisdom not for the first time chose to plump for the player with superior batting skills. For the next few years a number of candidates were tried without much success while Wickremasinghe continued to perform reliably at domestic level. Given the chance he could have made the position his own.\nJohann P Jayasekera",
    "Hashan Tillakaratne": "A tough competitor and adhesive crease-occupier, Hashan Tillakaratne was an important figure in Sri Lanka's emergence as an international force. As a schoolboy he excelled at cricket, first at Isipathana College Colombo and then subsequently at DS Senanayake College. He first came to prominence with a match-saving century against England B at Galle in 1986 while still at school, and went on to make his one-day international debut against India in November of that year. A Test debut followed against Australia three years later and early on in his Test career Tillakaratne often played as batsman-wicketkeeper.But his considerable batting potential was realised when he gave up the gloves in 1994. Tillakaratne was an important figure in Sri Lanka's emergence as an international force which culminated with a historic victory in the Wills World cup in 1996. He lost his place when Sri Lanka turned to youth after the 1999 World Cup, but heavy scoring in domestic cricket brought him back into the national team in 2001. His return bolstered the middle order and he enjoyed a prolific run with the bat until being named Test captain in April 2003. His ten-match tenure produced just one win, which clinched a series against England later in the year, and his leadership style was criticised for being too defensive. Following a 3-0 series whitewash against Australia he stepped down in March 2004, and despite remaining keen to continue his career as a batsman, he was overlooked for the subsequent tour of Zimbabwe.On February 1 2005, the Sri Lankan board appointed him executive director of Cricket-Aid, a body formed to provide relief following the December 2004 tsunami. Subsequently he turned his considerable people skills to politics , joining the United National Party, the oldest political party in the country and was appointed as the party's organizer for Avissawella electorate in the Colombo district. He continues his association with cricket apart from working to uplift the lives of people in his electorate, serving in various committees on the SLC at the invitation of the newly appointed president, Arjuna Ranatunga. Tillakaratne was bestowed a rare honour when conferred with a honorary life membership of the MCC from March 2008 onwards. In May, he was appointed the president of the Association of Cricket Umpires and Scorers of Sri Lanka (ACUSSL).  \n(Charlie Austin)",
    "Marvan Atapattu": "A vulnerable starter, Atapattu showed immense strength of character once he got his eye in. On a lifeless pitch, he was a master of the percentage game, his caution a useful counterpoint to the risks taken by Sanath Jayasuriya, his opening partner almost throughout his Test career. All his big Test innings - he scored six double-hundreds in his career, a feat bettered only by Don Bradman (12), Wally Hammond and Brian Lara (seven each) - were been slow affairs but the most tortuous episode of his international career was its start: it took him nearly seven years to get established. However, since the 1990s his average climbed upwards. An elegant player to watch, Atapattu's signature shot was his high-elbow cover-drive.For three years he stood as Jayasuriya's understudy before being appointed to lead the one-day side in April 2003. He had been expected to take charge of the Test team as well, but the selection committee appointed Hashan Tillakaratne for that job. Atapattu's career took another bizarre twist later in the year when embroiled in the cash-in-the-bedroom affair in which a match-fixing investigation was initiated after a large sum of cash was discovered in the safe of the hotel room he had occupied during England's tour in 2003. The ICC later cleared Atapattu of any wrongdoing and the likeliest explanation for the mystery remains a crude attempt to blacken his reputation.But by early 2004 the team was drifting downwards under Tillakaratne and the selectors were finally compelled to appoint Atapattu as the Test captain. Within weeks he had halted the team's slide and established himself as a strong leader. On the surface a quiet and reserved character, his captaincy pedigree was not entirely obvious to the outsider, but within the dressing-room he was a straight-talking and positive captain, firm and fair in his dealings with the players and aggressive in his approach to the game. By mid-2004 the fortunes of the team had changed as Sri Lanka won the Asia Cup and whitewashed South Africa. The team fared poorly in the ICC Champions Trophy but perked up against Pakistan in October 2004.But Atapattu's capacity for attracting the unexpected continued when, out of the blue, Ashantha de Mel, the new government-appointed chairman of selectors, launched a scathing attack on the team management on the eve of the Paktel Cup in 2004-05, accusing them of blocking his attempts to blood new players. Atapattu wisely steered clear of a public confrontation, though his relationship with the selectors remained prickly. His career was put on hold by a back injury early in 2006 which led to Mahela Jayawardene taking on the captaincy. He was slowly reintroduced to the one-day side, but his tussles with the selectors continued. He was a late inclusion on the Australian tour following a ministerial intervention to bring him into the squad, but midway through the series he hit out at the selectors again, calling them \"a set of muppets headed by a joker\". He scored two half-centuries in the series, including 80 in the second innings in Hobart, but announced his retirement from international cricket on the last day of the Test.   Atapattu then joined the unofficial Indian Cricket League, playing for the Delhi Giants and ICL World XI. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Atapattu was free to play domestic cricket back home.Since retirement from all cricket, Atapattu has forged a reputation as a technically adroit and hard-working batting coach, particularly for his work with the Sri Lanka team. He has been the national side's batting coach since 2011, and was promoted to the position of assistant coach in March 2013. In the wake of Paul Farbrace's sudden departure from the head coach position a year later, Atapattu was appointed the interim head coach for the away tour of England, and the home tour against South Africa, in July.\nCricinfo staff September 2008\n",
    "Charith Senanayake": "Charith Senanayake was given an opportunity to establish his position as an opener on the 1990-91 tour of New Zealand. A left-hand batsman, he was a capable strokeplayer but was probably better suited down the order on the New Zealand wickets where his defence was questionable against the new ball. In the second Test at Hamilton he made his highest test score of 64, adding 95 for the first wicket with Chandika Hathurusinghe. With Roshan Mahanama and Hathurusinghe forming a solid opening pair Senanayake was not given another opportunity following the tour. In seven one-day internationals he failed to impress somewhat surprisingly, as the free scoring nature of the game seemed to suit his mentality.\nJohann P Jayasekera",
    "Chandika Hathurusingha": "An opening batsman with a compact style and steadfast nature, Hathurusingha forged a steady opening partnership with Roshan Mahanama. Capable of playing lengthy innings when the situation warranted ,Hathurusingha possessed a variety of strokes. A handy medium-pace bowler, capable of genuine movement through the air. Called into the side against New Zealand at Hamilton as a replacement for the injured Mahanama, he responded by making three half-centuries in his first three Tests. Despite some handy contributions in following series, after an arduous time against the pace of South Africans he found himself left out. After a period on the sidelines, during which no other opener could establish a permanent position, he was selected to tour Pakistan and responded with an excellent series. After the emergence of Sanath Jayasuriya on the proceeding tour of Australia, Hathurusingha was again left out. Sri Lanka's failure to develop a competent allrounder saw Hathrurusingha reincarnated as a middle-order batsman and medium-pace bowler during the tour of England and The Asian Test Championship, though this experiment was shortlived. Chosen for the 1999 World Cup, Hathurusinghe was not called upon to play a single match, and the selectors' policy of picking younger players singled the end to his international career. He quit first-class cricket in 2005 to focus on coaching and has since coached UAE and Sri Lanka A. ",
    "Sanath Jayasuriya": "It's hard to imagine that for the first half-decade of his career, Sanath Jayasuriya was considered a bowler who could bat a bit. Think of him now and you think of forearms straight out of a smithy, shots hammered through point and cover and scythes over the leg side. You recall a man who could score equally briskly in every form of the game, who slashed and burned his way through bowling attacks. As with anyone who relied so much on extraordinary hand-eye coordination, there were troughs and lean times, but just as the obit writers got busy, he would produce another innings of supreme power. The bowling, always canny and relying more on variations in pace than sharp turn, became the supporting act, though 440 international wickets should tell you that he was pretty adept at what he did.Following Mark Greatbatch's success at the 1992 World Cup, most teams were rethinking the way they approached the one-day game and Jayasuriya, who had trawled the lower reaches of the middle order till then, had his first stint as opener during the Hero Cup in India in 1993. It was only during a home series against Pakistan the following year that he established himself in the role and by the time the World Cup rolled around 18 months later, he had already chalked up his first century in whites, a frenetic stroke-filled effort in Adelaide. The years that followed were both prolific and successful. People remember Aravinda de Silva's magical innings from the semi-final and final of  the 1996 World Cup but it was Jayasuriya's withering assaults that deflated India in Delhi and England in the last eight. Soon after, he began to exact as heavy a toll on Test attacks, scoring at such a pace that Muttiah Muralitharan and friends had ample time to work their way through opposition batsmen.After Arjuna Ranatunga's ouster, there was a four-year stint as captain that ended with a semi-final appearance at the 2003 World Cup, and just as the whispers grew about diminishing returns with the bat, he had one of his most successful years in 2004. There was a retirement announcement  in 2006, but he was back within weeks, and the walk off the Test stage came only 18 months later, after a typically cavalier innings in Kandy.The one-day flame continued to burn bright, and took Sri Lanka to another World Cup final in 2007, and he was instrumental in the Asia Cup win of 2008, a couple of months after it had seemed that the selectors' axe had fallen for the final time. The Indian Premier League gave him a new platform to showcase his big-hitting talent, but failure to replicate the success of the first season in subsequent campaigns was the surest sign that time had finally caught up with a man who was still pounding out one-day hundreds at the age of 39. His election as a Member of Parliament in April 2010 and his subsequent failure at the World Twenty20 suggested that his international career may be at an end, but he made the longlist for the 30-man squad for the 2011 World Cup, before being recalled to the one-day side for the series in England two weeks shy of his 42nd birthday.Dileep Premachandran",
    "Kapila Wijegunawardene": "Kapila Wijegunawardene was a steady medium pace bowler who served\nSri Lanka well when chosen. At international level he lacked a\nyard in pace to be a genuine threat but with an accurate line and\nthe ability to move the ball he could cause batsman trouble if\nthey underestimated his ability. The selectors clearly had\nWijegunawardene pegged as strictly a one day bowler and it was in\nthis form of the game that he made his international debut.\nTaking 2/29 from 8 tidy overs he helped Sri Lanka to a win over\nPakistan in his initial match. His Test debut came on the tour of\nEngland in 1991 in the one off Test, where he was used sparingly\nand went wicketless. In his second and final Test against\nPakistan at Faisalabad he had a prosperous time having the match\nanalysis of 7/98, and in the second innings his 4/51 nearly bowled\nSri Lanka to a memorable victory.(Johann Jayasekera , Sep 1999)",
    "Pramodya Wickramasinghe": "Pramodya Wickramasinghe, or 'Wicky' as he was known, was a reliable medium-fast bowler, who lent valuable experience and control to the attack. Relatively gentle in pace, he relied on accuracy and movement in the air. He was educated at Rahula College in Matara and played his club cricket for the Sinhalese Sports Club. He was introduced into the national pool after the Youth Asia Cup Championships in Bangladesh in 1989 and toured England with the Sri Lankan 'B' team in 1991. In 1992 he recorded the historic feat of capturing all ten wickets in an innings when he finished with 10 for 41 against Kalutura YCC. In 2000 he was forced to undergo surgery on his shoulder in Australia and found it difficult to cement his place in the side upon his return.\nWisden Cricinfo staff",
    "Romesh Kaluwitharana": "The diminutive \"Kalu\" burst onto the international scene with an unbeaten\n132 on debut against Australia in 1992-93. However, after such a wonderful\nstart, he failed to secure his place in the senior side because of occasional\nlapses behind the stumps. He was recalled for the crucial 1995-96 tour of\nAustralia, the turning point of his career as he combined with Sanath\nJayasuriya to form a devastating pinch-hitting opening partnership. The\npair's scoring rate revolutionalised one-day batting, and he was an integral figure in Sri Lanka's astonishing World Cup victory that winter. From then on, his batting style tempered somewhat and he set himself to play longer innings.\nThe emergence of Kumar Sangakkara led to his marginalisation after 2000,\nalthough he made sporadic returns for both the one-day and Test team. The\nselectors' decision to ask Sangakkara to concentrate on his batting in Tests\npaved the way for a Test return in 2004 but his performances with the bat\nwere patchy and, despite scoring 54 in his last Test innings, the selectors\nindicated a desire to look to the future when he was omitted for a 20-man training pool for New Zealand later in the year. He announced his retirement the day after, insisting that the time had come to focus on life after cricket.  He coached Colts CC while conducting a career as an insurance executive. He was appointed by Sri Lanka Cricket to be a member of the 2006 ACC Committee to Evaluate China, and in 2008 took temporary charge of Malaysia.\nCharlie Austin ",
    "Dulip Liyanage": "Dulip Liyanage, a fast-medium bowler, was a hard-working pace bowler who made  his Test debut alongside Muttiah Muralitharan in Colombo in 1992-93. He had an impressive debut, taking the wicket of Tom Moody with his third ball and going onto claim the wickets of Alan Border and David Boon.  In the two Tests whcih followed against New Zealand he continued his promising form taking seven wickets in a series generally dominated by Sri Lanka's spinners. On the unresponsive pitches. Injury limited his future opportunities and he drifted into obscurity before making a surprise, albeit short-lived, return to the international arena at one day level in 1997. He represented Sri Lanka in seven ODIs after his return, but after the Wills Quadrangular tournament in Pakistan he was injured again.  After an impressive season with Colts CC he was given another chance and recalled to the squad for India's tour of Sri Lanka in August 2001. He played in the final Colombo Test.\nWisden Cricinfo staff",
    "Muthiah Muralidaran": "Perhaps no cricketer since Douglas Jardine has polarised opinion quite like Muthiah Muralidaran. For the believers, he's among the greatest to ever spin a ball. For the doubters, he's a charlatan undeserving of the game's greatest records, responsible for changes in the laws that they think have legitimised throwing. What was undeniable was his ability to turn the ball sharply on just about any surface, and bowl the sort of marathon spells that would have seen a lesser man retire after five seasons rather than 18. Whether Sri Lanka played at home, on pitches where he was often unplayable, or overseas, Murali was the go-to man for half a dozen captains. He seldom disappointed.Scion of a family with confectionery interests in Kandy, he first came to prominence during a tour game against Australia in 1992-93, when no less a batsman than Allan Border failed to pick him. From the outset, his action was an object of wonder or ridicule, depending on which side of the fence you stood. A deformed elbow was only part of the story. Murali had exceptionally supple wrists and a shoulder that rotated as rapidly as a fast bowler's at the time of delivery. A combination of all these factors combined to enable him to turn the ball far more than most orthodox finger-spinners, but it was only with his mastering the doosra, the one that went the other way or held its line, that he became Shane Warne's rival in the wicket-taking and greatness stakes. The controversies always kept him company, yet Murali seldom lost his wide-eyed smile, or the ability to run through batting sides. Darrell Hair called him for throwing on Boxing Day in 1995, and Ross Emerson followed suit three years later. In 2004, he was asked to refrain from bowling his doosra, after it was found to exceed the 15-degree tolerance limit that had been agreed on after extensive analysis of his and other actions. While the sceptics continued to denigrate his achievements, Murali even bowled on television in a special cast, going through his entire repertoire to try and convince the doubters.Part of the World Cup-winning side in 1996, he was instrumental in the run to the final 11 years later, and he played his part in some of the country's greatest sporting moments. It was his 16 wickets that helped rout England at The Oval in 1998, back in the days when Sri Lanka were deemed worthy of only one Test. He averaged less than 30 with the ball in every country except India and Australia, and he finished a remarkable Test career with more than 100 wickets against India, England and South Africa. Backed to the hilt by Arjuna Ranatunga, he blossomed in the late 1990s, and there was a period when the opposition routinely budgeted for 20 Murali wickets or more in a three-Test series. As the years passed, his shyness gave way to a quiet confidence and wry sense of humour, and he won admirers around the world for the energy, time and money that he invested in reconstruction after a tsunami had devastated the Sri Lankan coast in 2004. Often the only Tamil in the side in a time of ethnic conflict, he became as powerful a unifying force as any in the country. That he was such a hero with ball in hand was only part of the story.Dileep Premachandran\n",
    "Ashley de Silva": "An experienced domestic player when selected to play for Sri\nLanka, de Silva's sojourn at international level was a brief one.\nMaking his first class debut in 1984 de Silva had been a steady\nperformer for the Colombo Cricket Club throughout the 80's and\nearly 90's. Sri Lanka's failure to develop a quality test\nwicketkeeper saw de Silva receive an call up for the one off test\nagainst England. Sri Lanka achieved their first test victory over\nthe English, de Silva contributing 9 runs, a catch and one\nstumping. De Silva's batting failed to impress at international\nlevel in his few outings, failing to reach double figures in any\ninnings, and was omitted from the side. His name added to the\never expanding list of former Sri Lankan test wicketkeepers.\n(Contributed by Johann P Jayasekera , Sep\n1999)",
    "Ruwan Kalpage": "A combative allround cricketer Kalpage has been a handy performer in the shorter format of the game where his allround skill makes him a valuable utility player. In the Test arena his appearances have been far more infrequent as he has struggled to find a defining role in the team, not being strong enough to warrant a position as either a batsman or bowler. A left-hand batsman capable of playing some forceful knocks in the lower order, at domestic level he can be regarded as a genuine batsman. His canny offspin provides a useful option for the captain, with the ability to maintain a tidy line and length, though at international level his bowling lacks penetration. Kalpage compliments his tidy allround skills by being a solid performer in the field.At Test level his bowling has not been an effective weapon failing to take more than two wickets in an innings in 11 matches.  With the bat he played some belligerent innings but is considered a lower-order batsman. He remained on the fringes of the international arena, and his opportunities were limited by the emergence of Upal Chandana.After quitting the game in 1999, he assisted Trevor Chappell as Sri Lanka's fielding coach the same year before taking over his role in 2001. He continued the task till 2005, but in 2004 he played a dual role when he was also appointed as the computer analyst of the team. He became the head coach of the Spinners Clinic in April 2006 and also coached the A team, and Under-19 and U-15 teams. In March 2008, he was appointed the high performance head coach of Bangladesh's National Cricket Academy.He left that job in 2010 to become the Sri Lanka team's fielding coach. Johann P Jayasekera and Sa'adi Thawfeeq",
    "Pubudu Dassanayake": "After a brief period as the first choice keeper, Dassanayake\njoined the ever increasing list of players to have held the\nposition. His batting fell below that of international standards\nand that led to him being replaced. Despite this when asked to\nbat at first drop to counter the threat of the South African pace\nattack, which had been demolishing the top order, he did so with\ncourage. After Chamara Dunusinghe was preferred for the tour to\nNew Zealand in 1994/95, Dassanayake made a return to the\ninternational scene, representing Sri Lanka 'A' against England A\nin 1998.  (Johann Jayasekera, benj@primus.com.au)",
    "Piyal Wijetunge": "One three schoolboys from St Anthony's College who played in the same team and then went on to represent Sri Lanka. Wijetunge, a left-arm orthodox slow bowler, formed a menacing partnership with Muttiah Muralitharan, terrorising batsman from other schools. The other member of the trio was Ruwan Kalpage. Unlike his fellow team-mates, Wijetunge did not go on to have a distinguished international career, playing only one Test. In a memorable personal moment Wijetunge made his Test debut alongside his former schoolboy team-mates against South Africa at Moratuwa where he bowled tidily taking two wickets. However, they could not bowl Sri Lanka to victory on the final day as they did many times at school, a defiant century from Jonty Rhodes holding them at bay.\nJohann P Jayasekera",
    "Kumar Dharmasena": "Dharmasena came into the international scene in 1994 against South Africa, aged 22. His quickish offspinners, delivered with a slightly unorthodox action, were invariably accurate making him an ideal one-day bowler, especially in Sri Lankan conditions. With time he also developed into a useful middle order batsman, which guaranteed him a regular place in the Sri Lankan one-day squad. His career came to a standstill after the Oval Test in 1998, when the ICC questioned his bowling action. However, he was cleared to play again by the Sri Lankan cricket board in July 2000. He subsequently played frequently for the one-day team, especially during home matches, but only played Test cricket sporadically. He retired from competitive cricket in November 2006 to pursue a career in umpiring and made his international umpiring debut in 2009. He was part of the panel of 18 umpires selected for the World Cup in India in 2011, officiating in the tournament opener between Bangladesh and India in Mirpur, and later the same year was promoted to the Elite Panel of ICC Umpires.\nCharlie Austin",
    "Dulip Samaraweera": "Dulip Samaraweera was a determined stoic opening batsman. Chosen as a replacement for Chandika Hathrurusinghe, Samaraweera did not do enough in his limited opportunities to warrant further selection. Making his debut against the West Indies in the inaugural Test between the two nations, he scored 16 and 5. In the following three-Test series against India he failed to pass 50 in any of his six  innings. A solid batsman at domestic level, for Sri Lanka he fell below the required standard. When he did see off the opening bowlers he failed to display the required strokeplay to take full advantage, failing to pass 50 in 14 Test innings. He was a handy offspiner. Johann P Jayasekera",
    "Ravindra Pushpakumara": "Ravindra Pushpakumara burst on to the Sri Lankan cricket scene in 1994-95, when he made his Test debut against Pakistan at Kandy, after impressing with the Under-19 team on tours to Malaysia and Singapore. He was the quickest Sri Lankan bowler to emerge for some time and was immediately touted as a perfect new ball partner for Chaminda Vaas. Blessed with a strong, broad-shouldered physique, he raced in off a long run and bowls with a powerful, muscular action. But despite his raw pace he lacked the necessary variation and cunning, especially on the subcontinent's bland surfaces, to trouble top class players and and he failed to secure a regular berth in the national squad. His last outing was against Bangladesh in the Asian Test Championship in 2001.\nCharlie Austin (July 2004)",
    "Sanjeeva Ranatunga": "Unlike his famous elder brother, Sanjeeva Ranatunga never touched lofty heights at the international level, but he was a talented left-hand batsman on the domestic level. Having scored heavily at the school level he went on to captain Ananda College and then Sri Lanka A on several occasions, after which he was picked for the home series against Pakistan in 1994. He began well in the one-day series, scoring 70 in his second match, but his form tapered off and he played the last of his 13 ODIs in January 1996. Ranatunga showed more promise in Test cricket, with back to back centuries in Zimbabwe in his second and third matches -  his average after seven Tests was 59.71 - and was given the chance to tour New Zealand, Pakistan and Australia. However, international cricket proved a difficult hurdle and Ranatunga was dropped from the side. A somewhat controversial recall came in June 1997, for Sri Lanka's tour to the West Indies, but one poor match was all it took for Rangatunga's international career to finish. \nCricinfo staff",
    "Chaminda Vaas": "Chaminda Vaas is easily the most penetrative and successful new-ball bowler Sri Lanka have had, and he has served his country well. He swings and seams the ball with skill, his trademark delivery being the late indipper. However, he also bowls a carefully disguised offcutter, and has recently added reverse-swing to his armoury, a skill that has made him a consistent wicket-taker even on bland subcontinental pitches. He outbowled New Zealand's seamers in green conditions at Napier to give Sri Lanka their first win in an overseas Test, in 1994-95. In 2001-02 he made a quantum leap, taking 26 wickets in the 3-0 rout of West Indies, becoming only the second fast bowler, after Imran Khan, to take 14 wickets in a match in the subcontinent. He then went on to take the first-ever ODI eight-for, against Zimbabwe, which included a hat-trick. He also claimed a hat-trick with the first three balls of the match against Bangladesh in the 2003 World Cup. Vaas reached the 300-wicket milestone in Tests against India in 2005-06, having passed the mark in ODIs on the tour to Zimbabwe. In 2004 he also gained overdue recognition for his talent when he was selected for the World XI at the inaugural ICC Awards. Vaas is easily Sri Lanka's second-most successful bowler - after Muttiah Muralitharan - in both forms of the game. His approach to his batting is equally sincere and in recent years he has gradually gained recognition as a useful allrounder. He waited 97 Tests for his maiden century, against Bangladesh, and soon after, became the third Sri Lankan to play 100 Tests or more.In August 2008, Vaas crossed yet another milestone when he had Yuvraj Singh caught for a duck in Colombo to get his 400th ODI wicket and become the fourth bowler to reach the landmark.  In July 2009, Vaas announced his retirement from Tests but said he will continue to play one-dayers and Twenty20s till the 2011 World Cup. \n",
    "Chamara Dunusinghe": "Dunusinghe had a successful induction into the Sri Lankan Test side when he made his debut on the 1994-95 tour to New Zealand. In his Test debut at Napier he had a marvelous all round game completing seven dismissals and then making 91 in the second innings, as Sri Lanka completed a rare victory away from home. With a safe pair of hands, it seemed Sri Lanka had found a player who could finally fill the wicketkeeping position, that for so long had been the side's weak point. However, on the subsequent tour to Pakistan, fast bowlers exposed his batting deficiencies. Despite this, his performances behind the stumps were solid. Selected to tour\nAustralia, Romesh Kaluwitharana was preferred in the international matches. It was accepted that Dunusinghe was the superior keeper, but not for the first time the selectors opted for the candidate with the stronger batting credentials, and within two years Dunusinghe had faded from even domestic cricket.\nJohann P Jayasekera",
    "Jayantha Silva": "A left-arm spinner, Jayantha Silva's seven-Test career split into two distinct segments. Serve up Zimbabwean prey and he was lethal: in three Tests against them he took 16 wickets at an average of 10.12, including a couple of match-winning performances in Colombo in 1996-97. But in four Tests against India, Australia and Pakistan, Silva was managed only four wickets at an average of 121.25. With a plethora of left-armers in domestic circles, Silva's time had passed and he disappeared from the first-class game before he was 28.\nMartin Williamson",
    "Nuwan Zoysa": "A left-arm seam bowler with a loping, rhythmical run-up and action, Zoysa has shown plenty of promise, but his career has so far been plagued by injuries. He was discarded after a disappointing tour to England in 2002, but he trained hard and regained pace, nip and bounce off the pitch. Most importantly, though, he returned with the delivery that moves back into the right-hander, a weapon that makes him a far more potent force.A natural striker of the ball, he's also emerged as a useful lower-order strokeplayer. During the A tour to Kenya in 2003, he was even employed as a pinch-hitter to good effect, and, making his comeback to international cricket in the one-day series against Australia in 2003-04, Zoysa further underscored his batting potential with a matchwinning unbeaten 47 in the final match.His bowling continued on its upward curve, culminating in a damaging five-wicket haul against South Africa in the one-day series in 2004-05. First spotted by Arjuna Ranatunga, who encouraged him to join the SSC in Colombo, he made his debut during the 1996-97 tour of New Zealand. In only his eighth Test, Zoysa achieved the rare feat of claiming a hat-trick off his first over of the match, against Zimbabwe at Harare in 1999-2000. His victims were accomplished top-order batsmen too - Trevor Gripper, Murray Goodwin and Neil Johnson.\nCharlie Austin (September 2004)",
    "Sajeewa de Silva": "Sajeewa de Silva took full advantage of his selection into the\nNational Side with an exemplary performance in the  Test series\nversus Pakistan in Colombo. Although, he has not produced a\nnoteworthy Test contribution since then, he still remains a very\nuseful one-day cricketer. Not a quickie by Test standards,\nSajeewa relies more on swing and maintaining an excellent line\nand length. He has an excellent wicket taking record in ODIs by\nemploying this tactic to often lull the batsmen into thinking\nthey can score off him. (Treshad Sosa, November 1997)",
    "Russel Arnold": "Arnold's ability to adapt his game to the situation makes him an ideal No.6 in limited overs cricket and an unselfish approach explains the high esteem in which he is held by teammates. A cool head under pressure helps when chasing and he adds great value in field with a safe pair of hands. He can also bowl useful offbreaks.A tall, angular left-hander and a patient accumulator, Arnold began his Test career as an opener but despite solid scores then, and on his recall for the Asian Test Championship two years later, he lost out to Marvan Atapattu as Sanath Jayasuriya's partner. Short of runs by late 2000, he dropped into the lower middle order. When a loss of form and confidence from Jayasuriya gave Arnold another chance at the top of the order in 2002, he scored 62 and 109 in a valiant rearguard at Old Trafford. Failure in the series that followed left him on the sidelines for long periods after the 2003 World Cup but Arnold made his way back into the team for the home series against Australia. Despite making 51 not out in his last ODI against Zimbabwe, Arnold was dropped from the ODI and Test teams in July 2004. The seven-man Ashantha de Mel selection committee wanted to blood new talent and Arnold's future looked bleak for a while. But he worked hard on his game in the nets and started to score heavily in domestic cricket. Finally, with his replacements failing to impress, he won a recall for the New Zealand tour in December 2004.  However, pressure from the young brigade - the likes of Tillakaratne Dilshan - left him fighting for his place. His Test role went first but, after a poor tour of England in 2006 (following some promising efforts in Australia), he was dumped. But experience can never be discounted in major tournaments and he found a spot in the 2007 World Cup squad. Arnold retired after the World Cup final and joined the unofficial Indian Cricket League, playing for the Chennai Superstars and ICL World XI. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Arnold was free to play domestic cricket back home. He has also dabbled in radio commentary. \nCharlie Austin September 2008",
    "Mahela Jayawardene": "A prolific, elegant and utterly classy batsman with a huge appetite for runs, and a calm yet authoritative captain - those are the qualities that best describe Mahela Jayawardene. His sheer quality as a batsman was never in doubt even when he just entered the international scene, but for Jayawardene the biggest challenge has been to justify all the early hype. With over 10,000 runs in both Tests and ODIs - and a captaincy stint that included a World Cup final appearance - it can safely be said that he has met that challenge more than adequately.Blessed with excellent hand-eye coordination and a fine technique, Jayawardene scores his runs all around the wicket. Among his favourite strokes are the languid cover-drive - often with minimal footwork but precise placement and timing - and the wristy flick off his legs, but there are several others he plays with equal felicity. The most memorable are the cuts and dabs he plays behind the stumps, mostly off spinners, but also against quick bowling, when bat makes contact with ball delightfully late. Apart from his artistry, what stands out about his batting is his hunger for big scores, most apparent in his record 624-run partnership with Kumar Sangakkara, but also in the regularity with which he notches up Test double-hundreds. And his century against Zimbabwe in the World Twenty20 in 2010 was a shining example of traditional methods succeeding in a new format.Jayawardene is easily one of the most elegant batsmen of his generation, but the major drawback in his career is his relative lack of success in overseas conditions. His averages in Australia, England, South Africa and New Zealand are all less than 35, but at home he averages more than 60.In the second half of his career, Jayawardene grew into an astute captain who read the game well and wasn't afraid to take risks. Under him, Sri Lanka shed their diffident approach, winning Tests in England and New Zealand, and - in what was Jayawardene's greatest achievement as captain - reached the final of the 2007 World Cup. He quit captaincy in February 2009, but agreed to a second stint, taking over from Tillakaratne Dilshan after the tour to South Africa in 2011-12, but resigned again after a year, handing the reins to Angelo Mathews. His limited overs batting has improved with age, and an increasing stroke repertoire has seen Jayawardene become almost as impressive an innovator at the crease, as he is a technician. An unbeaten 103 from 88 balls in the 2011 World Cup final made plain his limited  overs prowess, and marked him out as a big-match player, having already made a century in the semi-final of the same tournament four years ago. \nS Rajesh and ESPNcricinfo staff",
    "Lanka de Silva": "Lanka de Silva came into the Sri Lankan side in place of Romesh Kaluwitharana aged 22 with heavy expectations on his narrow shoulders. He proved up to the task in hand, and as well as being an excellent wicketkeeper, he showed a nifty touch with the bat. But competition for the wicketkeeper's place was tough, and de Silva lost his place when Kaluwitharana returned and has not received another chance since.\nTreshad Sosa",
    "Malinga Bandara": "Malinga Bandara was earmarked from an early age as a legspinner of great potential. On the basis of his school performances he was selected for the Under-19 tour to India in 1997, the Under-19 World Cup in South Africa, and the Sri Lanka A tour to England in 1999. In between, he made his Test debut against New Zealand in 1998-99 but looked all at sea in a disappointing display and did not come into consideration after that. But a match haul of 11 for 126 against England A in March 2005 confirmed his growing confidence and also helped attract the attention of Gloucestershire as they looked for a replacement for Upul Chandana. Bandara, like Chandana, is also a useful lower order batsman. He hasn't been able to nail a permanent place in the one-day set-up but has provided valuable support for Muttiah Muralitharan. It is his all-round versatility which won him a World Cup place for the Caribbean ahead of Chandana. He played just one game and has since struggled to find a place in the line-up. He was, however, named in the probables for the Champions Trophy. ",
    "Niroshan Bandaratilleke": "Bandaratilleke made a instant impact in his debut series against\nNew Zealand at home. His left arm orthodox slow bowling provided\nthe perfect support for Muttiah Muralitharan. Bandatatilleke\npushed the ball through and hit the wicket hard. He took\nadvantage of a poor Galle wicket to capture the match figures of\n9/82 in only his second Test match. In all Bandaratilleke\ncaptured sixteen wickets in the series. However, he had a minor\nimpact on the following tour to England, playing only two tour\nmatches. Reinstated for Sri Lanka's second Asian Test\nChampionship maych against Pakistan at the Gaddafi Stadium, he\nbowled tidily taking 3 wickets in the drawn Test. Somewhat\nsurprisingly ignored by the selectors since, Bandaratilleke was\nnot selected in the initial squad for the home series against the\nAustralian side. (Johann Jayasekera, benj@primus.com.au)",
    "Suresh Perera": "Suresh Perera was at one time considered to be the most naturally talented allrounder in Sri Lanka by coach Dav Whatmore, who pushed for him to be given an extended opportunity to fulfill his raw potential. A right-arm medium-fast bowler, his sideways-on whippy action allowed him to swing the ball. His outstanding eye for a ball allowed him to score runs freely.  He first rose to prominence when selected to play against England A during their tour of Sri Lanka (February 1998) before going on to make his Test debut at The Oval in 1998 Test where he took the wicket of Alec Stewart and smashed an entertaining 43*. This was followed by over a year out of the game with a stress fracture of the back. During the 2000-01 season he made a comeback for his club, the Sinhalese Sports Club, and was then fast tracked back into contention for the Coca-Cola Cup in Sri Lanka (July 2001) and the following three-Test series against India (August 2001). He starred in one match scoring an unbeaten 56 to guide Sri Lanka home against New Zealand, but proved expensive with the ball. He was reported by umpire Steve Bucknor for having a suspect action after the first Test in Galle and the next Test at Kandy - during which it was clear his confidence had taken a knock - was his last outing. Cleared by the ICC, he remained on the fringes of the Sri Lankan squad.",
    "Ruchira Perera": "Ruchira Perera is a lively and hard-working left-arm fast bowler with the\nability to swing the ball back into right-handers. He lost form and confidence\nafter his action was labelled suspect during Sri Lanka's early-season tour to\nEngland in 2002. After advice from Darryl Foster, a bowling coach and\nbiomechanics expert at the University of Western Australia, he modified his\nwrist position just before the point of delivery and that cleared the\nproblem with his elbow to the satisfaction of Sri Lanka authorities. But\nalthough he returned to international duty in late 2002 against South\nAfrica, his self-belief seeped away and he lost effectiveness. During the\nnext two years he battled hard but gradually became disillusioned, and prior\nto the recent Provincial Tournament was considering a career playing league\ncricket in England. However, he regained form during the Provincial\nTournament and caught the eye of the selectors and was selected for the 2006 tour of England. He's generally good for team spirit, bringing great humour to the dressing-room, and is respected for his commitment with ball in hand. September 2006",
    "Eric Upashantha": "A rangy fast medium bowler with a bustling approach to the wicket, Eric\nUpashantha has been on the fringes of the Sri Lankan team for a number of\nseasons, but inconsistent performances have stopped him from cementing a\npermanent position despite Sri Lanka's dearth of pace bowlers. He made his\nODI debut on Sri Lanka's tour of Pakistan in 1995/96, after making the squad\nduring the proceeding tour of Australia, but failed to make an impact and\ndropped out of the picture. Recalled for the Asian Test Championship in\n1999, shortly before the World Cup in England, he played his only Test to\ndate against India at SSC. In the first innings he struggled - as did the\nother seamers - bowled a vigorous spell in the second, capturing 2-41. In\nthe following Pepsi Cup he managed to impress sufficiently to earn a\nposition in the World Cup squad. In conditions that generally favoured the\nseam bowlers his performances were disappointing. Failing to deliver with a\nconsistent action he struggled to control the ball, bowling an inconsistent\nlength and spraying the ball. Again he fell out of favour, returning to play\nfor Colts Cricket Club in the domestic competition. Since then he appeared\nbriefly during Sri Lanka's ODI tour of New Zealand in February 2001, before\nbeing recalled to the squad for England as cover for the injured Dilhara\nFernando.(30.04.2002)",
    "Avishka Gunawardene": "An explosive left-hand opener in the mould of Sanath Jayasuriya, Gunawardene lives on the wild side. He first made headlines at the Commonwealth Games in 1998, scoring a century and top-scoring in the semi-final defeat to South Africa. A few months later, deputising for Jayasuriya, he smashed 145 off 20 overs with Kaluwitharana in an audacious attempt to reach 311 against Australia at Melbourne. He scored a career-best 132 against West Indies in the ICC Knockout in 2000. But impetuous dismissals and inconsistency prevented him from securing a regular berth. However, the appointment of a new selection committee in 2004 paved the way for his recall and he leapfrogged ahead of other fringe players. An opportunity finally came when Atapattu was rested in the Asia Cup and he grabbed his chance with an important half-century. Gunawardene was called up for Sri Lanka's Test squad to India in November 2005 but did nothing of note in the two matches he had handed. He also travelled with the one-day squad to New Zealand in the new year but failed in the one game he played. In September 2007 Gunawardene joined the unofficial Indian Cricket League, effectively ending his international career. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Gunawardene was free to play domestic cricket back home.\nCharlie Austin (September 2008)",
    "Upul Chandana": "Upul Chandana's career started to blossom in 2002 when he was asked to captain Sri Lanka A against Kenya. His batting gained a new authority and his bowling greater potency, as he topped both the batting and bowling averages in that unofficial Test series. A wonderfully supple fielder, capable of match-turning run-outs and sizzling airbourne catches, he was in and out of both the Test and one-day squads for a number of years before bedding down in the one-day team in mid-2003 after a match-winning innings at Bridgetown. His explosive qualities in the middle order made him an asset in the limited-overs game. But his bowling has also continued to improve, making him a better bet for Tests as well. Murali's withdrawal from the tour to Australia in 2004 put additional responsibility on him, and he responded well. As the year progressed, his legbreaks, traditionally nagging rather than explosive, started to fizz more venomously. More importantly, his line and length tightened up. By the end of the Asia Cup in 2004 he had become an important wicket-taker in the one-day team, but his form fell away and he was dropped late in 2005, making one rather unexpected one-day appearance in July 2007, retiring soon after. Chandana then joined the unofficial Indian Cricket League, playing for the Kolkata Tigers and ICL World XI. A ban on he and four other Sri Lankans was lifted in September 2008, meaning Chandana was free to play domestic cricket back home.\nCharlie Austin September 2008\n",
    "Rangana Herath": "Rangana Herath is an orthodox left-arm spinner who has taken over from Muttiah Muralitharan as Sri Lanka's main wicket-taking bowler in Tests. As a left-arm spinner, his strengths are his accuracy and his ability to bowl long spells, but to that he has added a 'mystery' ball, a delivery that is quicker and darts back into the right-hander. In his early years, he was seen as a support act to Muralitharan, though he had his moments to savour: against Pakistan in 2009, his 4 for 15 got Sri Lanka an improbable win, as Pakistan were bundled out for 117 chasing 168. Most of the time during that period, though, his role was to bowl long spells block the runs and build pressure on the batsmen, allowing Murali to work his magic from the other end.Since Murali's retirement, Herath has been Sri Lanka's go-to bowler. His unrelenting accuracy, and his ability to subtly vary his pace and flight have made him a potent force even overseas, where conditions don't always favour spin bowling. On Sri Lanka's tour to South Africa in 2011-12, Herath's match haul of 9 for 128 helped the team to their first Test win in South Africa. Next season he also had an impressive tour of Australia, bowling long spells, taking wickets and keeping the runs in check when the fast bowlers struggled to exercise any sort of control. He was the leading wicket-taker in Tests in 2012, with 60 at an average of 23.61, thus proving conclusively that he had broken out of Murali's shadow, and was among the best left-arm spinners going around.ESPNcricinfo staff\n",
    "Indika de Saram": "A slight man but nevertheless powerful batsman who has a sound technique, Indika de Saram broke into the national side in the 1999-2000 tour of Zimbabwe. However, he languished at number six or seven in the order and was never really given an opportunity to express his full potential. He was educated at St Thomas' College in Matara, with whom he also kept wicket and became one of the most consistent scorers in the country. The highlight of his schools career was when he scored 304 runs in just 149 balls, including 25 sixes and 19 fours at the Uyanwatte Stadium against Sri Devanand College, Ambalangoda. He was a regular in the A team before breaking into the national team. He was dropped from the side in 2001 and eight years later, made a comeback when he was included in the Twenty20 squad against the touring Indians and later for the ICC World Twenty20 in England. ",
    "Tillakaratne Dilshan": "With his relentless aggression, strong wrists and natural timing, Tillakaratne Dilshan is one of the most exciting batsmen in the game today. He is technically sound, but, much like Virender Sehwag, he uses the defensive option only as a last resort, after all the attacking alternatives have been explored. He loves to make room and thrash the ball through the off side, but the stroke that bears his signature more than any other is the one he developed for the 2009 ICC World Twenty20 - the eponymously named \"Dilscoop\" shot over his head, which confounded bowlers and experts alike.In fact, 2009 was a watershed year in his career, and a huge factor was his move up the batting order to open the innings in all three forms of the game. It was a move that proved his making, as he exploited attacking fields and amassed huge scores in all formats: he scored 11 international hundreds in the year, and won the World Twenty20 Player of the Series prize.Dilshan's abundant talent was never in doubt from the moment he made his debut, but he went through several early troughs, most notably when he was dropped from 2001 to 2003. Having burst onto the international scene with an unbeaten 163 against Zimbabwe in his first series in November 1999, Dilshan's career remained largely unfulfilled until he cemented his place as one of the most destructive openers in the modern era. Add his electric fielding, especially at backward point, and his underrated offspin, and Dilshan is a quality package. In 2011 he was named Sri Lanka's captain, after the resignation of Kumar Sangakkara, but his reign lasted less than a year, with Mahela Jayawardene replacing him after Sri Lanka's tour to South Africa in 2011-12. Like his team, Dilshan had had a poor run of form while he was captain, but his batting enjoyed a revival after being relieved of leadership, particularly in ODI cricket, where he was 2012's second-heaviest scorer, with 1119 runs. \nJamie Alter ",
    "Indika Gallage": "Indika Gallage is a lean right arm fast medium bowler, who remains on the fringes of the national side. A tall man, he bowls with high action and has the ability to land the ball on the seam. He is also able to generate bounce.Indika was born in Panadura on the 22nd of November 1976. He studied at Sri Sumangala, Panadura in the Southern Region, and played from the U13 level onwards he represented the school. He toured with the Sri Lankan side to England in 1998, and also represented the country in the Commonwealth Games in Kuala Lumpur. 1999 was the best year in his cricketing career. He was selected for the Carlton & United Series in Australia, the Coca Cola Trophy in Sharjah, and then went onto Zimbabwe where he made his debut for his country in the ODIs in the 5th match v Zimbabwe and made his test debut in the First Test vs Zimbabwe at Bulawayo.",
    "Dilhara Fernando": "When Fernando burst onto the international scene, young and raw, he soon inspired hope that he would be the long-term replacement for Chaminda Vaas as the cutting edge of the pace attack. He has natural pace - six months after his debut he was timed at 91.9 mph in Durban - hits the pitch hard and moves the ball off the seam. During the early years he paid for his inconsistent line and length, but then worked hard with Rumesh Ratnayake in the Fast Bowling Unit and became more reliable. He also learnt the art of reverse swing and developed a well-disguised slower ball. His career, though, has been plagued with injury. He suffered his second stress fracture of the back in 12 months in January 2004 and missed the entire home series against Australia. However, he has now been slowly nursed back to full fitness and after playing for Sri Lanka A in New Zealand, he has won his place back in the squad. He struggled to hold down a regular spot, especially in the Test team, and was again struck by injury in 2005. However, he fought his way back  for the one-day leg of the tour of England and, although he is having to look over his shoulder at the young seamers, has forced off the attention of Nuwan Zoysa for a place in the 2007 World Cup squad. But he remains a wild card that can either win or lose a match in one spell. Worcestershire thought of him as a winner, however, when they signed him for the final few weeks of their Championship campaign in 2008.\nCharlie Austin September 2008",
    "Prasanna Jayawardene": "Prasanna Jayawardene looked set for a long career after touring England as a\n19-year-old in 1998, but had been marginalised since the rocket-fuelled\narrival of Kumar Sangakkara in 2000. Waiting on the sidelines, in fact, had\nalready been a feature of Jayawardene's career. He made his Test debut against Pakistan at Kandy in June 2000, but was confined to\nthe dressing-room throughout, as Sri Lanka batted over the first three days before rain washed out play on the last two. The resurgence of Romesh Kaluwitharana threatened to push Jayawardene further down the pecking order, but his batting has\nsteadily improved in the intervening years, and with the Sri Lankan selectors voicing their concerns about overburdening Sangakkara, Jayawardene was recalled to the Test squad for the tour of Zimbabwe in April 2004. However, it wasn't until the tour of New Zealand in 2006-07 when he established himself in the Test side, allowing Sangakkara to play as a specialist batsman. Jayawardene started making better contributions with the bat, scoring his maiden century, against Bangladesh. Though Sangakkara remains the first choice keeper in limited overs cricket, Jayawardene was given a chance to reclaim his spot when named in the Champions Trophy probables.\n",
    "Kumar Sangakkara": "As soon as he broke into the side at the age of 22, while a law student, it was apparent that Kumar Sangakkara was destined for more than just batting stardom. The left-handers that had preceded him, like Arjuna Ranatunga and Asanka Gurusinha, had been pugnacious battlers but Sangakkara was cut from more graceful cloth, easing into strokes with the elegance often associated withthose that play with the 'other' hand. The cut and the pull came naturally to him and with growing confidence, he became a more assured front-foot player as well.Ranatunga had already exploded the myth of the Sri Lankans being meek men who could be bullied, but Sangakkara has refined the belligerence, combining a suave exterior with cutting asides and sharp sledges from behind the stumps. Initially, his glovework wasn't for the purists, but such was his batting ability that there was no question of displacing him from the XI.As a batsman, he has matured steadily, and the appetite for runs was best illustrated at the Sinhalese Sports Club Ground in Colombo in 2006, when he and Mahela Jayawardene, captain and close friend, added 624 against a South African attack boasting Dale Steyn and Makhaya Ntini. Sangakkara contributed 287 and did his burgeoning reputation no harm a year later when he went to Hobart and scored a dazzling 192 in a close defeat. By then, he already had a half-century in a World Cup final to his name, and long before Jayawardene relinquished the captaincy, it was understood that Sangakkara would be the anointed one.He has been far less relentless in the one-day arena, often throwing his wicket away when well set, but his leadership qualities have made him a sought-after signing in the Indian Premier League. With the captain's burden on his shoulders, he no longer keeps in Test matches, but the smart-alec remarks from behind the stumps are a common feature of every game that Sri Lanka plays in coloured clothes.Although leadership drew the best from him as a batsman, he remains a voracious no. 3 in all forms despite having relinquished the reins in 2011. Sangakkara won the top prize at 2012's ICC awards, in addition to the award for Test Cricketer of the Year and the People's Choice award for the second year running. Later that year he confirmed himself among batting's modern greats, by becoming the equal fastest man to 10,000 Test runs alongside Sachin Tendulkar and Brian Lara, with the biggest Test crowd Sri Lanka had ever played for in audience, at the Melbourne Cricket Ground. .Dileep Premachandran and ESPNcricinfo staff",
    "Dinuka Hettiarachchi": "Dinuka Hettiarachchi, a left-arm spinner and capable batsman, played cricket at every level from Under-13s to Under-19s and continued to shine with Colombo Colts in domestic competitions.  He was given a chance against England A in 1996-97 and against South Africa the following year, and in 1999 he took part in an unofficial tri-series in Abu Dhabi. In  2000 he played against Zimbabwe A, winning a call-up to the Test side on the back of good performances  but he failed to find a place in the XI. He finally broke into the side against England in 2000-01 but after a reasonable debut was dropped.\nCricinfo staff",
    "Thilan Samaraweera": "Thilan Samaraweera's batting will not fill a stadium; yet, in a batting line-up of flamboyant strokeplayers, his patience and solidity offers a vital balancing factor. In his second avatar he has added more strokes to make his batting more well-rounded, but what Samaraweera does best is wear bowlers down through patient and relentless accumulation. His batting is built around reserves of resilience, determination and sheer toughness, and he had to draw into them all to overcome the trauma of cricket's darkest hours - the terrorist attack on the Sri Lankan team in Lahore.Samaraweera will forever be remembered for not letting a bullet injury end his international career. He was in his best form, having scored two consecutive double-centuries in Pakistan, when his team bus came under fire in March 2009 and a bullet penetrated 12 inches into his left thigh. He needed surgery and spent three months dealing with the physical and mental wounds of his ordeal. That Samaraweera returned to play his 50th Test in July was a triumph of his strength of character.His return was a second coming after he had begun his career with a hundred on debut against India in 2001. The retirements of Aravinda de Silva and Hashan Tillakaratne gave Samaraweera a run in the middle order but indifferent form in 2006 led to him being dropped. He returned 18 months later, a more aggressive, prolific batsman and yet remained as solid as he was before, reigniting his career with a century against India in July 2008. It was the beginning of a purple patch which continued even after his run-in with gunmen.Despite all the runs Samaraweera scored, question-marks remained due to his relative lack of success outside the subcontinent. Worse was to follow when he went through a wretched run of form against Australia at home, in 2011. He was subsequently dropped for the Tests against Pakistan in UAE, but defeat in that series forced the selectors to recall him for the South Africa tour. Samaraweera responded in style with two centuries when some of his more illustrious team-mates struggled to put bat to ball. Samaraweera's finest hour came when his century in Durban delivered Sri Lanka their first win in South Africa. Though he had a moderately successful year in 2012, Samaraweera was the most notable batting failure in Sri Lanka's year-end tour of Australia. Despite scoring plenty of runs in the domestic season thereafter, he didn't find a place in Sri Lanka's squad for the home Test series against Bangladesh. With no meaningful Test cricket scheduled for Sri Lanka for several months, Samaraweera announced his retirement from all international cricket in March 2013.George Binoy ",
    "Michael Vandort": "Michael Vandort, a tall left hander, emerged onto the national scene in 2001 after a string of impressive performances for Colombo Cricket Club and Sri Lanka A. A late developer, Vandort played only one first-class match for St Joseph's First XI, but he quickly made an impression. He was then picked for a Board XI side against India in August 2001 and booked himself a berth in Sri Lanka's 16-man Test squad on the back of an impressive century. He sat on the sidelines throughout the series, but was finally given a chance against Bangladesh in 2001 when the selectors rested senior players. However, despite scoring a century in the second Test, he then waited three-and-half-years before reclaiming a place in the national squad. Opportunities were restricted due to the established Jayasuriya-Atapattu opening combination, but many argue he has nonetheless been unfairly ignored by the selectors.  An injury to Sanath Jayasuriya paved the way for his ODI debut against Australia at Melbourne in February 2006. He top scored with a gritty but slow 48 but was then dropped for the rest of his series. He played two Tests in the Bangladesh series that followed, again showing an impressive adhesiveness and is particularly strong off the front foot, through the off-side and leg-side. Rated highly as a slip fieldsman but is slow in the field, a weakness that continues to restrict his opportunities in the limited-overs game. ",
    "Charitha Buddhika": "Wisden overviewShort and skiddy, Charitha Buddika (or Buddika Fernando) generates lively\npace and handy away-movement from a spindly frame. He made a triumphant ODI\ndebut in October 2001, against Zimbabwe at Sharjah. After opening his account with two no-balls, he took a wicket with his first legitimate\ndelivery. Four more followed, and he finished with 5 for 67, the second-best\nfigures by a Sri Lankan on ODI debut, and the fourth best of all time. He\nsoon secured a place in the Test team and toured England in 2002. But after\nnine Tests (18 wickets @ 44) and 17 ODIs, he was dropped after some\ninconsistent performances. Remains on the fringes though, and could develop\ninto a useful lower order allrounder with four first-class fifties to his\nname.(Charlie Austin)\n",
    "Sujeewa de Silva": "Sujeewa de Silva, a left-arm swing bowler from the southern resort town of Beruwela, shot to prominence in the Premier Under 23 Trophy in 2000 when he broke the league record for the most wickets in a season. Although possessed with the precious ability to swing the ball late, he failed to catch the eye of the selectors until after Sri Lanka's tour of England, when he was picked to play two Tests against Bangladesh as the selectors rested senior bowlers. He had to wait nearly five years to play his next Test, coincidentally against Bangladesh. He later made it to the probables squad for the Champions Trophy. \n",
    "Chamila Gamage": "Chamila Gamage Lakshitha, a right-arm medium fast bowler who swings the ball into right-handers, burst onto the international scene with a wicket off his very first delivery in Test cricket. Given a chance to press for a place after Sri Lanka's disappointing tour of England, the 23-year-old, a product of the BCCSL's Fast Bowling Unit, who works for the Air Force, went onto to impress in that Bangladesh Test and was selected to play all three ODI's that followed. Further good performances during Sri Lanka A's tour of Pakistan ensured his place in the South Africa tour party. Also showed some promise with the bat in his debut Test, scoring 40 from just 46 balls at number eleven.\n(30.11.2002)",
    "Jehan Mubarak": "A graceful left-hander, Jehan Mubarak plays the game as though it was his birthright, and after representing his country at Under-15, U-17 and U-19 level, maybe it is. Born in Washington DC, the son of a respected scientist, Mubarak returned to Sri Lanka to attend Royal College in Colombo. He made his debut against Bangladesh in 2002 and impressed as a replacement in South Africa with classy 48 but a poor ODI run (68 runs in 7 innings) has limited opportunities since. He is a useful offspinner, an excellent fielder, a useful Twenty20 batsman and also a national swimming champion.\nAndrew Miller March 2008\n",
    "Naveed Nawaz": "Nawaz has scored consistently for his club side, Nondescripts, for a number\nof years, at an average pushing 40, but international opportunities have\nbeen limited: until his surprise recall for the NatWest series in England in\n2002, he'd made just a solitary one-day appearance - against Zimbabwe in\n1997-98. On that occasion, he failed to impress at No. 3, scratching around\nfor a 23-ball 5. Made his Test debut against Bangladesh in the following\nseries before slipping back into the A team.\nCharlie Austin",
    "Hasantha Fernando": "Hasantha Fernando was fast-tracked into Sri Lanka's one-day team as their selectors searched for a fast bowling all-rounder for the 2003 World Cup. After one full first-class season under his belt with Sebastianites Sports Club, he caught the eye with his impressive domestic performances, averaging 35.05 with the bat and hitting three centuries for his club. With the ball he also contributed regularly, claiming 61 wickets at 15.73. He made his one-day debut against Bangladesh in August 2002. Batting at No. 7 he wasn't able to prove his worth due to lack of opportunities but he impressed with the ball, showing plenty of variation despite his lack of pace. He toured South Africa later that year and his Test debut in Johannesburg was forgettable for the fact that he was dismissed for a pair. He made a comeback after a three-year hiatus for the tour of Bangladesh and was later recalled for the Twenty20 World Championship in South Africa.\nCricinfo Staff August 2007",
    "Kaushal Lokuarachchi": "Loukaracchchi is unfortunate that he belongs to an era where there are two\nother right-arm legspinners are also vying for a berth in the national team. The presence of Upul Chandana and Malinga Bandara meant that 'Loku', as he is referred to by  team-mates, had no place in the national team which also has the inimitable\noffspinner Muttiah Muralitharan.It seems Loku has somewhat decided that his best chance to play in the national team is in the shorter version of the game. He says he loves to play one-day cricket and his style of bowling and batting is most suited to it. \"It is difficult to play one-day cricket than Test cricket because the intensity is great. I love the challenge,\" Loku said. He believes as a legspinner he has a lot to learn, but admits gaining experience each time he plays for his country. He is also a useful batsman down the order with two first-class centuries and a batting average of 27.    He had an outstanding career at St. Peter's College where he won the best bowler's prize and was also voted Schoolboy Cricketer of the Year. Loku then joined Bloomfield in 1999 and represented them till last season when he changed clubs and went to SSC where he took 14 wickets in the Premier league semi-final against Colts and followed it up with a century which is the best performance of his career so far.Has benefited from attending Sri Lanka Spin Academy headed by former Sri Lanka offspinner Ruwan Kalpage and from coaching received from Sri Lanka A-team coach Chandika Hathurusingha.    \n Sa'adi Tawfeeq July 2007",
    "Prabath Nissanka": "Wisden overviewRaw and rapid, Prabath Nissanka made an impression on his\ncaptain, Sanath Jayasuriya, by clattering him on the helmet\nduring a net session. Capable of genuine speed, he has an\nupright, uncomplicated action but is prone to spray the ball\naround. After an accomplished debut at Sharjah in October\n2001, where he picked up two cheap wickets in a comfortable\nvictory over Pakistan, he was on the wrong end of a two-\npronged hiding from Naved Latif and Inzamam-ul-Haq the next\ntime the teams met. Injuries, particularly to his knees, have\nslowed his development, but he managed to sneak into the Sri\nLankan World Cup squad despite an ordinary VB Series in\nAustralia. (Andrew Miller)",
    "Thilan Thushara": "Thushara is one of new fast bowling prospects to emerge in the last two\nyears. From the coastal town of Balapitiya, he made his first-class debut in\n1998-99. After a few years of steady improvement, including a spell in the\nBCCSL's Fast Bowling Unit, he caught the eye of the selectors and was\nincluded for Sri Lanka's tour of South Africa in 2002. He made his Test debut\nagainst West Indies in 2003, but failed to make the Test or ODI squad for\nthe England tour later in the year. No rabbit with the bat, he is a\nhard-hitting striker of the ball and has two first-class half-centuries to\nhis name. He played an important role in Kandurata ending as Inter-provincial limited-overs joint champs in 2008, finishing as the leading wicket-taker in the tournament with 11 wickets. That earned him a recall to the Test squad for the tour of West Indies and he impressed with eight wickets in two Tests. He was later included in the 30-man probables for the Champions Trophy. He has been effective on Sri Lankan pitches, forming a successful partnership with Nuwan Kulasekara. \nCharlie Austin and Cricinfo Staff October 2009",
    "Dinusha Fernando": "Fernando, tall medium-fast swing bowler and useful lower order batsman,\nfirst announced his talent by making Mike Atherton his bunny during the\nwarm-up matches that led upto the 2001 Test series. But, despite impressive\nperformances for his club, Sebastianites, and the A team, he only graduated\ninto the national team in Nov 2003. He made an instant impression, claiming\n2 for 13 against England at Dambulla. He also played in the first two Tests,\nbut bowled only 21 overs and was dropped.(Charlie Austin)",
    "Farveez Maharoof": "Farveez Maharoof is a fast-bowling allrounder who bowls lively seamers from an upright, open-chested action. Sri Lanka's selectors, impressed by his performances as under-19 captain, fast-tracked him into the national squad for the Zimbabwe tour in April-May 2004 as they looked towards the future. Faced with a weak opposition, Maharoof picked up a bunch of wickets, but then came up against better competitors during the Asia Cup. He performed reasonably well, and made a mark with his swinging deliveries when South Africa came visiting. He had worked his way up through the representative ranks, playing for the Sri Lanka Under-15s, Under-17s and under-19s, and led the Under-19 team on four tours, including the 2004 Youth World Cup in Bangladesh. He enjoyed a prolific school career for Wesley College, with a highest score of 243 and best bowling figures of 8 for 20. Maharoof has not had too many opportunities in Test cricket but was a limited-overs regular for a good half-decade.A mean display during the 2004 ICC Champions Trophy in England, when he exploited the end-of-summer conditions expertly, indicated he could be especially useful when Sri Lanka play in seamer-friendly conditions. A useful series with bat and ball against Pakistan in early 2006 suggested he was ready to push on, but his bowling failed to impress on the tour of England - taking only one wicket in three Tests - in conditions that should have suited him.Then came an astonishing display at the Champions Trophy in India when his 6 for 14 skittled West Indies out for 80. He performed creditably with bat and ball for the Delhi Daredevils in the IPL's first seasonMaharoof was in and out of Sri Lanka's squad till 2012, when he was dropped following the Asia Cup in Bangladesh. He made a surprise comeback in 2016, when the selectors recalled him for the limited-overs leg of their tour to Ireland and England.Charlie Austin and ESPNcricinfo staff",
    "Lasith Malinga": "One of the great limited-overs bowlers in his pomp, Lasith Malinga gained a reputation for delivering searing inswinging yorkers from a round-arm action as destructive as it was distinctive. That yorker, a deceptive slower ball, and an excellent bouncer formed the body of Malinga's menace, while the action made his deliveries hard to pick up. All that ability was also set off by street smarts; Malinga was rarely shy to switch up plans, and reshuffle fields. Even when batsmen thought they knew what was about to come, Malinga retained the capacity to surprise.Found in his teens playing soft-ball cricket on the beaches of Rathgama, just north of Galle, Malinga became one of the poster boys for the informal Sri Lankan coaching system and its philosophy of equipping unconventional bowlers, rather than remaking them. Malinga has repeatedly credited Champaka Ramanayake for his success. It was Ramanayake who initially took interest in him, and with whom he developed the yorker that became the foundation of his career. The coach would glue a pair of shoes near the popping crease. Malinga would spend hours bowling at them. Initially picked for his pace, Malinga toured Australia with the Sri Lanka team in 2004, where he claimed 6 for 90 in a tour match and went on to make his Test debut - he dismissed Darren Lehmann and Adam Gilchrist in the same over, in Darwin. During an impressive tour of New Zealand the following year, his low-slung action resulted in the New Zealand batsmen asking the umpire to change the colour of their trousers as the ball was getting lost.But it was in the shorter formats that destiny beckoned Malinga. He became the first - and, so far, only - bowler to claim four wickets in four balls, when he took Sri Lanka to the brink of victory against South Africa, in the 2007 World Cup. He has two more ODI hat-tricks - against Australia and Kenya - and he quickly established himself as Sri Lanka's limited-overs spearhead. Though Mahela Jayawardene, Kumar Sangakkara and Tillakaratne Dilshan also played important roles, Malinga was arguably the single-most important player in Sri Lanka's excellent run in global tournaments from 2007-2014.It is felt Malinga never realised his full potential in Tests, though perhaps through no fault of his own. He was only the third player to reach 100 Test wickets for Sri Lanka but a knee injury in 2008 laid him low for two years. He was picked again for Muttiah Muralitharan's farewell series, but again found himself injured for a period of some months. In April 2011, at the age of 27, Malinga announced his Test retirement, citing the desire to manage his \"chronic knee injury\" and extend his limited-overs career. It is thought his unique bowling action places a substantial load on the joints in his hips and legs. However, the fact that he announced his retirement while playing for Mumbai Indians in the IPL rankled at home. Through the forthcoming years, Malinga would go on to have a complicated relationship with Sri Lankan fans and media. In that time, he also became one of the IPL's iconic figures, representing Mumbai throughout.Malinga's finest moment came during the 2014 World T20, in which he nominally captained the side through the knockouts but, more importantly, delivered a clinical final spell to muzzle the India middle order. Sri Lanka would go on to win that title but, before long, Malinga's career became threatened by fitness issues - both involuntary and self-inflicted. In late 2014, a long-standing ankle complaint deteriorated to the extent that it required surgery. Malinga was a diminished force through the 2015 World Cup and became significantly slower in his later years, in which he also put on weight. He stepped down as T20 captain ahead of Sri Lanka's 2016 World T20 campaign, again owing to a chronic knee injury, this time in his left leg. He has at times suggested that his career hangs in the balance as a result of these injuries. At others he has said he wishes to play on for another few years. Andrew Fidel Fernando",
    "Nuwan Kulasekara": "Kulasekara made an instant impression in his first ODI, against England at Dambulla in November 2003, after being selected from relative obscurity. From a bustling run-up and whippy open-chested action, he generates a lively pace, moves the ball off the seam and can reverse-swing the ball. Most importantly though, he can maintain a tight line and length. He started his career as a softball enthusiast before he shifted his focus to cricket, joining Nugegoda Cricket Club and then Galle Cricket Club. He also won the best bowler award in the 2002-03 domestic competition. A maiden test fifty against England at Lord's in 2006 showed his natural batting abilities in the lower order. But his bowling during the same tour lacked penetration and he dropped out of the squad for eight months. However, having worked hard on his action and gaining an extra yard of pace, he secured a place in Sri Lanka's World Cup squad. He rose to become one of Sri Lanka's strike bowlers, and in a 11-month period starting April 2008, he took 47 wickets. That helped him jump to the top of the ICC ODI rankings the following March. \nCharlie Austin March 2009",
    "Shantha Kalavitigoda": "Shantha Kalavitigoda was a surprise call-up for Sri Lanka's postponed tour\nto New Zealand in 2004-05. But Kalavitigoda, a right-handed opener, has been quietly knocking on the door in recent years. While younger batsmen have been given repeated opportunities to flatter and fail, Kalavitigoda has been\nconsistently accumulating first-class runs, scoring eight hundreds in the two seasons. In 2003-04 he was adjudged the best batsman in the Premier League, and in 2004-05 he scored nearly 800 runs for Colombo Colts and North West Province. That was enough to win him selection to the A team against England A in March 2005. He grabbed his opportunity with a fighting 83 off 177 balls at NCC in the second Test, an innings that persuaded the selectors to give him a chance in the senior team. When that opportunity did arrive in the second Test in Wellington he was shunted down to an unfamiliar No. 7 position and failed in both innings. Kalavitigoda's first taste of international cricket was with the Sri Lankan under-17 team at the 1994 World Cup in Malaysia. He was a prolific scorer for his school, Nalanda College, and once shared a 380-run partnership with Mahela Jayawardene in an under-23 match for SSC, his first club.\n",
    "Gayan Wijekoon": "Gayan Wijekoon is an allrounder of considerable talent and has performed at every opportunity against touring sides and on tours with the Sri Lanka A team. However, a place in the national team has so far eluded him, with the selectors often opting for others with lesser performances ahead of Wijekoon. The nearest he came to selection was being part of the Test squad to New Zealand in 2004-05. A lively left-arm \nmedium-pacer and a left-hand batsman, he opened both the batting and the bowling for Tamil Union for many years before joining Chilaw Marians CC in 2003-04. Upul Chandana and Mahela Jayawardene have been the major influences in Wijekoon's career so far. He made his international debut in the home Test series against West Indies in July 2005, though with limited success, picking up two wickets. He was recalled for the Twenty20 World Championship in South Africa after a two-year hiatus and the following year made it to the probables squad for the Champions Trophy.",
    "Upul Tharanga": "A batsman who has frustrated and thrilled in equal measure. Although his Test career has never really taken off - his two Test centuries have come more than 10 years apart - in ODIs he keeps illustrious company among Sri Lanka's finest. As of 2017, only Mahela Jayawardene, Tillakaratne Dilshan, Kumar Sangakkara and Sanath Jayasuriya had scored more than Tharanga's 13 one-day centuriesTharanga's call-up to the Sri Lanka one-day squad in July 2005 brightened a year marred by the Asian tsunami, which washed away his family home in Ambalangoda, a fishing town on the west coast. From an early age he was tipped for the big time, playing Premier League cricket for Singha CC at the age of 15 and passing seamlessly and successfully through the Sri Lanka Under-15, Under-17 and Under-19 development squads. He first really caught the eye during the Under-19 World Cup in 2004 when he cracked 117 against South Africa and then 61 in 42 balls against India in the next game. Then, after a successful tour with the under-19 team to Pakistan, during which he scored half-centuries in each of the two Tests and two one-day matches, the Sri Lankan board sent him to play league cricket in Essex, where he starred for Loughton Cricket Club. He soon graduated to the A team and after accomplished performances against West Indies A he was selected for the national squad a week later. However, it was on the 2006 tour of England that he really began to develop, especially in the one-day game, with an outstanding century at Lord's in the first match of Sri Lanka's 5-0 whitewash, and another in the final match as he and Jayasuriya flayed an opening stand of 286 in 32 overs.Back-to-back centuries followed in the Champions Trophy and he was forming a destructive partnership with Jayasuriya. After the Champions Trophy, however, it would be another three years until his next century. He flourished at the 2011 World Cup with score of 133 against Zimbabwe and an unbeaten 102 in the quarter-final against England.In 2013, during a tri-series in the Caribbean, he struck an unbeaten 174 against India in Jamaica but that would be his last fifty-plus score for 18 innings spread over three years during which time he spent considerable periods outside the team. He briefly returned when called up as an injury replacement at the 2015 World Cup, but his 2016 comeback provided slightly more longevity and he was named captain for the tri-series in Zimbabwe, a position he retained when Angelo Mathews was ruled out of the 2017 series in South Africa.\nJanuary 2017",
    "Chamara Kapugedera": "Among the more frustrating players to have represented Sri Lanka in recent years, Chamara Kapugedara had ample opportunities at the top level between 2006 and 2012, but did not manage to nail down a place. That he is a rare talent has never been in doubt, but in international cricket, that raw ability has not usually translated into runs. Perhaps his fans will argue that he was asked to bat too low in limited-overs cricket to have a major impact on the game. Nevertheless, his returns were modest, and his place in the side became untenable, for a few years at least. Kapugedara has, however, enjoyed something of a renaissance in T20 cricket, after he was picked in the national side again in 2015. He impressed initially during his second coming, but another round of mixed results saw him in and out of the team. Despite having played top-level cricket for over a decade, he is still relatively young, and it is hoped he may yet come good as a consistent player. Naturally aggressive, and capable of clearing the boundary, Kapugedara had been one of the few genuinely exciting batsmen the selectors unearthed from Sri Lanka's Under-19 set-up. From the age of 11, when he first turned out for Dharmaraja College in Kandy, Kapugedera had hardly wasted an opportunity to push himself up the ladder. He had captained all the junior school sides from the U-13 to the first XI. Following a prolific 2003-04 season, where he scored over 1000 runs, he was picked for the U-19 tour to Pakistan the following year and had excelled with a stunning knock of 131 in a one-dayer against the world champions. It was an innings he had rated as one of his best although he batted equally well for 70 in his first game for Sri Lanka A against the strong New Zealand A team in 2005. The selectors, desperate to unearth new talent, eventually gambled on an early promotion and fast-tracked him into the national squad after several glowing reports from development coaches.Kapugedera's father, also a former Dharmaraja cricketer, provided early coaching and all the encouragement he needed to develop. David Karunaratne (his first coach) and Sumithra Warnakulasuriya (his U-19 coach) also played important roles in shaping Kapugedera's career. He was first picked in the national squad against India in November but pulled out of the tour with an injury. However, he made his ODI debut, aged just 18, against Australia in Perth in 2006, immediately impressing with his composure. \n\nESPNcricinfo Staff",
    "Chamara Silva": "Chamara Silva first arrived on the scene as a slightly-built 19-year-old in 1999, a beneficiary of the youth policy adopted by Sidath Wettimuny, the chairman of the selectors at the time. He began with a promising 54 on his ODI debut against Australia. His mannerisms while batting - particularly bow-legged stance and the flamboyant cover drives - immediately attracted comparisons with the great Aravinda de Silva. But despite being prodigiously talented, he failed to nail down a regular place during tours to Sharjah (1999), Zimbabwe (1999), Pakistan (2000) and England (2002). After the England tour he dropped out of the selectors' radar and returned to domestic cricket where he captained Panadura Cricket Club. Over the next four years he was a prolific run-scorer, especially after a move to Sebastianites for the 2004-05 season. Eventually he caught the eye of Tom Moody, who could not understand why he was not in the national squad. A quick promotion back into the Sri Lanka A team followed and after a successful tour to India he won a long overdue international recall. Still just 27, he was a surprise selection for the New Zealand tour and was handed his maiden cap in the first Test at Christchurch. It was an inauspicious start as he bagged a pair and Sri Lanka lost by five wickets. Sri Lanka's team management, however, kept faith for the second Test in Wellington and he rewarded them handsomely, scoring 61 in the first innings and a magnificent unbeaten 152 in the second. His maiden one-day century followed in India, just three weeks before the World Cup.\nCharlie Austin February 2007",
    "Malinda Warnapura": "Despite his cricketing pedigree, Malinda Warnapura has taken his time to press forward his case for national recognition. Having begun his first-class career in 1998-99, it was not until 2006 that he really made his mark. The tour to India with Sri Lanka A to participate in the Duleep trophy saw this elegant left-hand middle-order batsman blossom. He finished the three-match tournament with an aggregate of 421 runs, at 105.25, which included two successive undefeated centuries at Eden Gardens. An unbeaten 111 steered his team to the final of the tournament. He then compiled 149 not out in the final against the eventual winners, North Zone. Recognition did not follow immediately. He was overlooked for the tour of New Zealand that followed but continued to pile on the runs for Sri Lanka A. He was not at his best on the tour of the Caribbean when illness laid him low, but Warnapura was in outstanding form  in the home series against Bangladesh A that followed. He scored a career best 243 in the first unofficial Test at his home ground at Colts and followed it up with an unbeaten 104 in the second unofficial ODI to confirm that he could score runs in both forms of the game. His first strides into Test cricket - during the home series against Bangladesh in 2007 - were hardly auspicious, as he was dismissed off his first ball. He returned admirably in his second Test, scoring 82. He followed it up with a century against West Indies in Providence the following year and later made it to the Champions Trophy probables. ",
    "Chanaka Welegedara": "Welegedara was a late starter to cricket. He learnt to play the game for St. Thomas' College in Matale at the age of 17, but he made rapid progress performing in provincial matches. When he came to Colombo he was selected as one of 15 probables by Daryl Foster, the Australian fast bowling coach, for the Sri Lanka Pace Academy headed by former Sri Lanka fast bowler Rumesh Ratnayake in 2000. Soon afterwards he was sent to the MRF Pace Academy in Chennai to further develop his skills. Playing for Moors SC since 2002 he bowled his club to the Premier league title in 2002-03 capturing 34 wickets (avg. 24.14) in 13 matches. But his career-best performance came the following season when he took a match haul of nine wickets against Colombo Cricket Club to steer Moors to a comprehensive ten-wicket win. He took the majority of his wickets bowling inswing and trapping the batsmen leg before. Welegedera toured Sharjah with the Sri Lanka Academy side and took seven wickets against UAE, which earned him selection for Sri Lanka A. But he suffered an ankle injury and had to be operated in Australia. The injury kept him out of cricket for 1 ½ years, but his Test debut finally arrived against England, in Galle, during the 2007-08 series. Often looked to as the leader of the pace attack, after it became apparent that Lasith Malinga would not return to Tests, Welegedara has had a mixed time at the top level. He improved considerably throughout 2011, and then turned in his best performance for Sri Lanka at the end of the year, as he took 5 wickets for 52 in the first innings in Durban, to help set up Sri Lanka's maiden Test win in South Africa. He has since been plagued by various injuries, and his absences have seen others make claims for the pace spearhead role in the past year. Sa'adi Thawfeeq and ESPNcricinfo staff July 2008",
    "Ishara Amerasinghe": "A six-foot tall fast bowler with a high-arm action, Ishara Amerasinghe has the ability to generate pace, but for much of his career he has been plagued by a lack of accuracy. He has been a regular member of the Sri Lanka A squad since 1999, the season in which he performed outstandingly well, taking 58 wickets from 12 matches in the Premier League for Colombo Colts. That performance opened a window of opportunities for him to tour South Africa, with the A team, and then England. Some hard work at the nets with Champaka Ramanayake, the national fast-bowling coach, and A team coach Chandika Hathurusingha, resulted in an improved line and length. He toured England with the Sri Lankam team in 2002, but was kept waiting for another five years - partly owing to a back injury sustained during that tour - before making his ODI debut against Pakistan in Abu Dhabi after the 2007 World Cup. He toured Australia in early 2008 as a replacement for Dilhara Fernando, and played a Test and a few ODIs that season, but didn't do enough to keep his place in the national team.\nSa'adi Thawfeeq October 2009\n",
    "Ajantha Mendis": "Ajantha Mendis reintroduced mystery to spin in the era of video analysts and super-slow-motion replays. Much like the original mystery spinner, Jack Iverson, and the other practitioner of the \"Iversons\", John Gleeson, Mendis stunned the world with his finger-flicked legbreaks. His Iversons came with a new name, the \"carrom ball\", taken from the way the striker is flicked in the popular board game in the subcontinent.His first, most famous, and most comprehensive victims were the most prolific middle order of his time: Rahul Dravid, Sachin Tendulkar, VVS Laxman and Sourav Ganguly. Following closely on the heels of a six-for in the Asia Cup final against India's ODI side, Mendis made a sensational Test debut. He took eight wickets in his first Test and 26 in his first series, two more than Alec Bedser's record for a three-match debut series.The early success was built as much on his variations - offbreaks, topspinners, carrom balls, googlies, ones that did nothing - as it was on accuracy and Muttiah Muralitharan's company. As the mystery wore, though, much like with Iverson and Gleeson, the world caught up with him, and Mendis failed to live up to the early promise. By the time Murali retired, Mendis was not ready to take over as the leading Sri Lankan spinner, a vast change from when he could have emerged as the leading spinner in the world.Mendis continues to be an effective spinner in shorter formats where batsmen don't have much time to adjust. He holds the record for the best figures in a T20I innings, but fails to find a regular place in the Sri Lankan side for the longer formats. The rest of his career will be an exercise in trying to rediscover success, this time not through mystery but by being a really good spinner.Sidharth Monga ",
    "Dhammika Prasad": "A promising career with the national team looked certain when Dhammika Prasad took two wickets in as many balls in his first over of his ODI debut against Bangladesh in 2006. He went on to play two more matches before his career was cut short by a back injury which kept him out of the game for six months. Having recovered, he was selected for the Sri Lanka A tour to England in 2007 where he hoped to perform well and regain his place in the national team. What may have helped him in this quest was his ability to bowl at the death in ODIs, having worked hard to develop subtle variations including a good yorker. Consistent performances on the domestic front earned him a first Test cap against India in August 2008 as Sri Lanka sought to add pace to their attack. He did not disappoint, taking five wickets in the match, including the wicket of India's best batsman, Virender Sehwag, in both innings. Interestingly, Prasad started his cricket at De Mazenod College, Kandana, as a No.3 batsman. He played in this position till he reached 17 when he was forced to switch \nover to bowling fast because the school could not find anyone suitable to bowl with the new ball. He was selected for the Under-19 World Cup in 2002 and his performance paid off when he won a six-month scholarship to play in England. Prasad's best bowling effort was in the now-defunct provincial tournament when he took six wickets for 25 (match bag ten wickets) for Southern Province against Uva Province at the Galle International Stadium in 2004. Sa'adi Thawfeeq August 2008",
    "Tharanga Paranavitana": "Tharanga Paranavitana is a tall, upright opening batsman who came into prominence during the Emerging Team Trophy in Sri Lanka in 2003. A run of consistent scores on the domestic scene followed, but it was Paranavitana's career-best 236 off 392 balls that helped Sinhalese SC clinch the 2007-08 Premier League Tier A title which furthered his opportunities at the international level. He made three hundreds during SSC's successful campaign and finished as the leading run-getter for the season with 893 runs at 74.41, \nand followed up with a century and two half-centuries in the unofficial Tests that Sri Lanka A played in South Africa. Named after that tour by coach Chandika Hathurusingha as a future prospect for Sri Lanka, Paranavitana earned a maiden Test cap in Pakistan in early 2009.\nCricinfo staff July 2009",
    "Angelo Mathews": "A robust batting technique, nagging consistency with the ball, and athleticism in the field, all set off by an imperturbable temperament, have made Angelo Mathews one of Sri Lanka's most prized assets and a figure on which the team hangs many hopes. He has risen quickly since earning wide acclaim with an acrobatic save in the 2009 World Twenty20, and in February 2013, became Sri Lanka's youngest ever Test captain at 25, after having been groomed for the post for two years. In limited overs cricket, Mathews' all-round skills are almost indispensable. When he pulled a quad in the World Cup semi-final in 2011, he forced three changes to the XI that played in the final, as the team strove for the balance he single-handedly delivers. He began his international career with ambitions of becoming a genuine allrounder, but has since given primacy to his batting, and effectively plays as a specialist batter in the Test side. Often coming to the crease at No. 6, Mathews provides solidity to the lower-middle order, which had been a weakness for Sri Lanka prior to his arrival. In ODIs he has provided two unforgettable finishes - against Australia in 2010, and Pakistan in 2012 - stealing victory with a sublime, sustained assaults, but his best work has come in the Test format. In an outstanding 2014, in which he scored 1160 runs at an average of 77.33, Mathews' finest moment was the rousing 160 at Headingley, which transformed that match and saw Sri Lanka win their first Test series in England (not including the one-off Test in 1998). Mathews' appointment to the captaincy has heralded a renewed focus on youth and development by the Sri Lanka selectors. Once a successful leader of the St. Joseph's College side and the Sri Lanka Under-19 team, Mathews has been charged with ushering in a new age of Sri Lankan cricket.Andrew Fidel Fernando",
    "Suraj Randiv": "A tall offspinner with gentle action, Suraj Randiv has eschewed the mystery balls many of his colleagues deal in and has instead forged a career reliant on flight, dip and, importantly, bounce. The topspinner and the arm ball are his only variations, and even his offbreak is not given to excessive turn. He had begun his career as a right-arm fast bowler at junior level, until his school found that they had no spinner in their Under-15 side and he was called on to fill the void. Starting as a part-time bowler, he was soon picking up wickets on a regular basis and started representing Matara SC while still at school. Twenty-three wickets in four matches in the U-23 tournament in 2003-04 did not go unnoticed by Marvan Atapattu and Mahela Jayawardene, who brought him over to SSC. He benefited immensely in the presence of Atapattu and Jayawardene, learning how to bowl under pressure and to different fields. He picked up 55 first-class wickets in 2005-06 but fell away in the next three seasons. However, he struck form again in 2008-09, taking 43 wickets and an injury to Murali before the Galle Test against Pakistan led to a national call-up, and made himself the Test side's second-choice spinner. Though a wonderful fielder and a handy lower order batsman, Randiv has not been able to nail down a place in the limited overs sides, perhaps other slow bowlers have been more committed to developing a wider variety of deliveries, which are more highly valued in the shorter formats. His position in the Test side has lately come under increasing pressure from a talented group of chasing spinners, led by Tharindu  Kaushal.\nSaadi Thawfeeq and ESPNcricinfo staff ",
    "Suranga Lakmal": "A right-arm fast bowler, Suranga Lakmal was first spotted by Sri Lanka Cricket's fast bowling coaches while still a student at Debarawewa Central. They closely monitored his progress to Richmond College and then to the Tamil Union team whom he represents in domestic cricket. What impressed the coaches about Lakmal was his height and ability to get bounce and swing at a tender age. Despite his natural ability, Lakmal had one big deficiency in that he lacked the stamina to bowl long spells and on occasions he did, he regularly fell ill. The lack of nutrition was quite common with fast bowlers coming from outside Colombo and soon after Lakmal was inducted into the academy, the coaches worked on developing his stamina. Good performances with Sri Lanka A saw him break into the national ODI side. He was one of three players marked for the future by Chandika Hathurusingha in 2008 when he coached the A side.  Sa'adi Thawfeeq January 2010",
    "Thisara Perera": "A bustling right-arm seamer and sporadically effective left-handed hitter, Thisara Perera has been been in Sri Lanka's short-format sides since 2010. Bowling is ostensibly Perera's major skill but, often deployed in the lower-middle order, he is also capable of delivering furious finishes to an innings. Perera is particularly severe on spin, which has led to his being used as a pinch-hitter through the middle overs, but he has at times also been weak to quality pace bowling. He is the kind of player for whom form in one discipline usually bleeds into the other. Dropped for the limited-overs series against South Africa in July 2014, but roared back in the following ODI series against Pakistan, getting his bowling and his hitting in order. He struck 78 runs at a rate of 169.56 and claimed a series-high nine wickets at an average of 10.66. Perera has also done well with bat and ball on previous tours to Australia, and has often been at his best against India, memorably slamming the straight six that completed Sri Lanka's World T20 triumph in 2014. His more recent years have been beset by inconsistency but Perera continues to command a place in the side. He has hat-tricks in both ODIs and T20s.Perera began his schooling at St Anthony's, Wattala, before accepting a scholarship to join St Joseph's College. It turned out to be a productive move as he teamed up with Angelo Mathews and produced many noteworthy performances in the thriving schools cricket scene. Perera played a key role in helping his school break the hoodoo in the Battle of the Saints (against St Peters College) that lasted more than 35 years. He received his maiden national call-up during Sri Lanka's tour of India in 2009 as an emergency replacement for Mathews. That quickly led to an IPL contract, as he was bought by Chennai Super Kings for $50,000, and he has been one of the few Sri Lanka players to consistently find employment in the competition.\nAndrew Fidel Fernando",
    "Lahiru Thirimanne": "An unflappable young talent with a killer cover drive, Lahiru Thirimanne came to the international landscape highly regarded by Sri Lanka's cricket elite, with Aravinda de Silva most notably among his champions. An opener by reputation, Thirimanne made his debut in early 2010 and earnt sporadic places in the national side over the next two years, but it was not until he was moved to the middle order in 2012 that he unearthed the consistency that would make him a regular at the top level. A measured batsman, if at times a limited one, Thirimanne has been a contrasting ally for Sri Lanka's middle-order dashers in ODI cricket, striking particularly memorable partnerships with Angelo Mathews to lift Sri Lanka out of trouble.His forte has always been the longest form however, as evidenced by a first-class average of almost 60 in his first full season for Ragama CC. Thirimanne could not recreate that form in his first few Tests as an opener, but conjured his finest innings to date at no. 4, when he stepped off a plane 36 hours before the 2013 New Year Test to strike a sparkling 91 on the first day in Sydney. Ten days later he hit a maiden international hundred in an ODI to take Sri Lanka to victory in Adelaide.  Andrew Fernando ",
    "Seekkuge Prasanna": "An accurate legspinner, and an improving late-order hitter, Seekkuge Prasanna has become one of several Sri Lanka spin options in limited-overs internationals. Quick through the air, and possessed of a good googly, Prasanna has largely been picked when the pitch is expected to take turn. He is prolific in domestic cricket, where he and Ajantha Mendis regularly run through teams on the spin-friendly Sri Lanka Army pitch at Panagoda. Prasanna has also recently begun to feature in foreign competitions, playing in the Bangladesh Premier League and for county side Northamptonshire, predominantly in the T20 Blast.  Having worked his way into the Sri Lanka Army team in 2006 as a 21-year-old, Prasanna made an immediate impact, taking 3 for 23 in 10 overs on his domestic one-day debut against Lankan Cricket Club. He built an outstanding List A record over the next five years, picking up 73 wickets at 18.38 in 45 matches, and was selected in the Sri Lanka A team that toured England in 2011. When he took a six-wicket haul while opening the bowling against England Lions, the Sri Lankan selectors immediately took note - having him fly back home for the two final ODIs against Australian. He took 3 for 32 in his international debut. \n\nESPNcricinfo staff\n",
    "Shaminda Eranga": "A brisk fast-medium bowler, Shaminda Eranga's ODI and Test debuts were both spectacular: in his first ODI, against Australia in 2011, he needed only two balls to make an impact, bowling Brad Haddin through the gate. An even more memorable dismissal followed, when Ricky Ponting failed to read his slower ball and pushed back a return catch.  He then made his Test debut against the same opposition, and became only the second Sri Lankan bowler to strike with his very first delivery, when he dismissed Shane Watson. He was laid low by a nerve-related back injury soon after his arrival at international cricket, but after nine months on the sidelines returned to the national side to take a wicket in his first over in Twenty20 internationals, completing an unprecedented treble. He has since made himself a mainstay in the Test attack, and despite his inexperience, is often called to spearhead the pacemen, when Chanaka Welegedara is absent through injury.Eranga was discovered at an all-island pace bowling competition in 2006 by former Sri Lanka medium pacer Champaka Ramanayake and Anusha Samaranayake. Their discovery led to his being picked for the Chilaw Marians and eventually the division-one premier league tournament, which in turn led to a place in the Sri Lanka development squad. He made his debut for Sri Lanka A in 2010 and following good performances on a tour of England in 2011, was flown back to Sri Lanka to be part of the national side, a move which fetched immediate results.\nESPNcricinfo staff\n",
    "Nuwan Pradeep": "Fast bowler Nuwan Pradeep didn't play with a cricket ball till he was 20 but less than three years later he was in Sri Lanka's Test squad. He won a pace contest in 2007, impressing the talent scouts in a soft-ball event, and was sent straight to Sri Lanka Cricket's academy. He follows in the Sri Lankan tradition of maverick bowlers with unconventional actions. Like Lasith Malinga, he has a slinging action and has troubled many batsmen in domestic cricket with his pace, generated from a long run-up. Pradeep toured Sri Lanka A to Australia in 2010, where he was among the quickest bowlers from both sides though he didn't bag many wickets. Less than a month later, he was rewarded with a call-up to the national squad for the second Test against India.Cricinfo Staff July 2010  ",
    "Kaushal Silva": "A collected right-hand batsman with a firm technique, Kaushal Silva churned out hundred after hundred in first-class cricket until the sheer volume in his output could no longer be ignored by the national selectors. His erstwhile omission had largely been because of the surfeit of wicketkeepers in Sri Lanka's Test squad. He had perhaps made enough runs to vindicate place on his batting alone, but the nuances of balancing a side and the quest to groom young batsmen for the future had kept a Test spot out of reach.Silva's voracious first-class appetite was finally rewarded when Tillakaratne Dilshan's retirement made an opening spot available in the Test XI. Silva had hit 27 first-class tons by the time he was granted an extended run in the side, and that in a position where he has not often batted in domestic cricket.His grit and determination were evident in his tour of the UAE in January 2014, where he made two important scores of over 80 and a 95 against Pakistan. Equally encouraging has been the energy and enthusiasm he has brought to the team - perhaps virtues that sustained him during the long stretches knocking on the selectors' door. A maiden Test ton in Dhaka shortly after the UAE series added force to the notion that he could consistently bring stability to the top order.Silva had played three Tests, largely as a fill-in wicketkeeper, in 2011, but was unable to capitalise on those chances. His cricket-coach father is said to have been a key influence on his cricket - something he shares with Kumar Sangakkara, who had been among Silva's champions before his emergence at the top level.In April 2016, he suffered a mild concussion when he was hit on the head while fielding at short leg in a practice game in the lead up to Sri Lanka's season. He was airlifted to a Colombo hospital as a precautionary measure, before being given a clean bill of health a couple of days later.\nAndrew Fidel Fernando",
    "Kosala Kulasekara": "Kosala Kulasekara is a big-hitting 6' 1\" batting allrounder who has been a regular performer in domestic cricket for Nondescripts CC in the Premier tournament and Ruhuna in the Inter-provincial tournament. His approach to the game is more suitable for the one-day and T20 formats where he has excelled in domestic matches. In 2010 he hit a whirlwind 43 off 15 balls against Basnahira North in the inter-provincial T20 match and captured four wickets for 26 with his nippy deliveries to help Ruhuna convert a losing cause into a winning one.  Kulasekara first began as a swimmer and won third place in the all-island swimming championships and cricket was only his second love. At Vidyartha College, Kandy he learnt his cricket and showed so much promise that he was selected to captain the Central Province Under-17 and U-19 teams. He was eventually selected to play for Sri Lanka in the U-19 World Cup in 2004 where he won two Man-of-the-Match awards for his all-round ability. After joining NCC, he was coached by former Sri Lanka cricketers Romesh Kaluwitharana and Chandika Hathurusingha who helped improve his batting technique. Kulasekara won a cricket scholarship to England in 2005 along with Upul Tharanga. He captained Sri Lanka Cricket Academy against England Academy and South Africa 'A' teams. \n",
    "Dinesh Chandimal": "Dinesh Chandimal is among the most promising young batsman going around in Sri Lankan cricket. A technically sound batsman with strokes all around the wicket, Chandimal also stands out because of the maturity he shows at the crease and his temperament to build and pace an innings.He made his international debut when only 21, and impressed almost immediately, scoring 111 in his second ODI, against India in the 2010 triangular series in Zimbabwe. Four innings later, he made another century, this time against England at Lord's, but his stocks rose significantly in 2012, when he performed superbly in ODIs on successive tours to South Africa and Australia. In conditions he wouldn't have been used to, Chandimal occupied the crucial No.4 slot and revelled in the responsibility, scoring consistently. In 16 ODI innings in those two series, he aggregated 630 runs, including six fifties. He was equally impressive on his Test debut too, scoring fifties in each innings in Durban as Sri Lanka won their first Test in South Africa. A dip in his limited overs form, especially at home, saw Chandimal dropped from the side during the latter half of 2012, though he remained in the Sri Lanka squad for all three formats. He returned to the Test side at the SCG for the New Year Test, and hit an unbeaten 67, batting alongside the tail. Six weeks later he became Sri Lanka's youngest ever captain, at 23, when he was handed the reins of Sri Lanka's top-ranked Twenty20, and was also named Angelo Mathews' deputy in Tests and ODIs. He celebrated his elevation with back-to-back Test hundreds against Bangladesh at home. Chandimal's rise to the national team came after consistent performances with bat and gloves at age-level cricket. That included an attacking century against India Under-19s in August 2007 and an unbeaten 112 in the tri-nation series against England U-19s the following year earned him a call-up to the squad for the U-19 World Cup in Malaysia in 2008.Shortly after completing a prolific season for Colombo's Ananda College, Chandimal was invited to join Nondescripts Cricket Club by Kumar Sangakkara. Chandimal was only 19 when scored his maiden first-class century against New Zealand in 2009, representing a Sri Lanka Cricket Development XI in two three-day practice matches against the likes of Chris Martin, Darryl Tuffey, Ian O'Brien, Jacob Oram and Daniel Vettori. He was among the leading run-getters in Sri Lanka's Interprovincial Twenty20 competition, and won a call-up to the national side for the ICC World Twenty20 in 2010. Soon after, the international opportunities followed, and Chandimal has made the most of them.\nSa'adi Thawfeeq and ESPNcricinfo staff",
    "Dimuth Karunaratne": "Dimuth Karunaratne is a solid left-hand opening batsman, and another alumnus of the St Joseph's College side that produced Angelo Mathews and Thisara Perera, whom he also played with in the Sri Lanka Under-19 side. Karunaratne made his first class debut for Sinhalese Sports Club (SSC) in 2008, but had a quiet first season, batting largely in the middle order. He secured a place in the top order in 2009, and began to score more consistently thereafter. His maiden first-class century, against Colts Cricket Club, heralded a deluge of 1186 runs in the season, at an average of 56.54. His prolific form earnt him a call-up for the Sri Lanka A team against visiting South Africa A, where he again impressed, making 184 against an attack that included Vernon Philander. Karunaratne has not reproduced the same volume of runs since his second season, but has developed a reputation for making big centuries against good attacks. He played two ODIs for Sri Lanka in 2011, making 4 and 60, and was also included in the Test tour to South Africa later in the year, though he did not get a game. He toured South Africa again in July 2012 though, with the A team, and impressed with scores of 83 and 150 not out on that tour. Soon after that, he found himself on the verge of a Test debut when he was chosen to open alongside SSC partner Tharanga Paranavitana, replacing the injured Tillakaratne Dilshan for the Test against New Zealand in Galle.Andrew Fernando",
    "Kithuruwan Vithanage": "A positive left-handed middle-order batsman, Kithuruwan Vithanage made his Test debut against Bangladesh, after hitting a better than run-a-ball 168 not out against the same team in a tour match one week earlier. Vithanage did little more than manning the ropes on a flat deck in Galle for much of his first Test, but when he finally made the trip to the crease on the fifth day, a lively 59 from 70 balls that featured seven fours and a six, marked him out as a young talent worth investing in.An alumnus of Royal College in Colombo, Vithanage played age-level cricket for Sri Lanka and was the vice-captain of the Under-19 side for the 2010 World Cup. In 2009, he had been the third-highest run-scorer in an Under-19 tour to Australia. He currently plays for Tamil Union.Andrew Fidel Fernando",
    "Sachithra Senanayake": "Sachithra Senanayake is an offspinner who made his international debut for Sri Lanka in the fourth ODI in the series against South Africa in 2011-12. At the time of making his international debut, Senanayake had already taken 297 first-class wickets from 59 matches at a fantastic average of 20.50, and 107 List A wickets at an economy rate of 3.90. In the 2010-11 season, he was the fourth-highest wicket-taker in Tier A of the Premier League tournament, taking 45 wickets in eight matches at 15.17. He has also shown that he can handle the pressure of limited-over matches: in the 2011-12 Premier Limited-Over tournament, Sri Lanka's main one-day competition, he was the highest wicket-taker with 16 in six games at 11.18.Senanayake's first foray into international cricket was short-lived though, and after several mediocre performances, he was released back into the domestic fold, where he continued to excel. He came back into international focus when he was bought for $650,000 by the Kolkata Knight Riders IPL franchise in 2013, largely owing to his reputation of possessing one of the better carrom balls in Sri Lanka. It turned out to be a good year for him, as he also put in a strong showing in the first-class competition, made a Test debut for Sri Lanka against Pakistan in December, and also had an extended run in the one-day team. He had mixed fortunes in the ODI series against England in June 2014 - remarkable figures of 4 for 13 that skittled England out for 99 were offset by news of his action being reported as suspect. While the controversy didn't stop him from being at the centre of a tense series win for Sri Lanka - he was also involved in a Mankading incident against Jos Buttler in the decider - he was dealt a big blow when his action was found to be illegal in July.  Senanayake remodeled his action and returned to international cricket in December 2014. ESPNcricinfo staff",
    "Dilruwan Perera": "A classical offspinner with an easy, fluent action, Dilruwan Perera had been among Sri Lanka's steadiest first-class performers, before being rewarded with the second spinner's berth in the Test squad, in 2014. It was with the bat that he made his first impression in Tests: Perera came within five runs of scoring a century on debut, against Pakistan at Sharjah, but he asserted himself as a bowler soon enough. His second-innings five-wicket haul helped wipe Bangladesh out in Dhaka, less than two weeks later.No big turner of the ball, and possessing only an arm ball as a variation, Perera's strengths lie in accuracy and persistence.  He has honed those skills by practicing spot-bowling intensively, on the advice of Muttiah Muralitharan, one of Perera's idols, alongside Saqlain Mushtaq. In his time in the Test side, Perera has proved a good fit for the attack's ethos of squeezing wickets from the opposition, and he has also been a fine partner for Rangana Herath when the two bowl from opposite ends.Perera had made rapid progress since starting his career at Sri Sumangala College, Panadura. He toured Australia with the Sri Lanka Under-19 team and, after he made his first-class debut for Panadura Sports Club, was drafted into the A side in 2001. He played one season for Chilaw Marians Cricket Club and holds the bowling record for the Under-23s with 55 wickets from seven matches in 2004.He had had some success in A team tours to England and Zimbabwe with both bat and ball, but continued to develop as a bowler through his time at Sri Lanka's Spin Bowling Academy, where he was coached by former offspinners Ashley Mallett and Ruwan Kalpage.In limited-overs cricket, Perera earned a call-up to Sri Lanka's squad for the ICC World Twenty20 in South Africa after Muralitharan was ruled out due to injury. He made his ODI debut at home against England in 2007. He forms an integral part of the Colombo Colts domestic side, which he has now represented for 10 years.Andrew Fidel Fernando\n",
    "Niroshan Dickwella": "An attacking left-hand and unorthodox wicketkeeper-batsman, Niroshan Dickwella arrived in first-class cricket already having built some hype through his stellar school cricket career. He won Sri Lanka's Schoolboy Cricketer of the Year award in 2012, having hit over 1000 runs in the previous season, and having led Trinity College to the national championship. Since then, Dickwella has become Nondescripts Cricket Club's regular wicketkeeper across all competitions, thanks in part to Dinesh Chandimal's long absences from domestic cricket, due to his presence in the national team. Dickwella has been particularly impressive in across all formats in domestic cricket, and has been a fixture in the Sri Lanka A team. He made his Test debut as far back as July 2014 - at the age of 21 - but despite a sparkling 72 at SSC against a strong South Africa attack, did not hold his place for long. He made another foray into international cricket in 2017, and on this occasion had some success with his impressive range of behind-the-wicket strokes, which include all manner of sweeps, scoops and ramp shots. ",
    "Tharindu Kaushal": "A tall offspinner who extracts substantial turn, Tharindu Kaushal has been perhaps the most exciting young bowler in Sri Lanka's domestic circuit since he made his debut in early 2013. Working off a distinctive high-kneed approach to the crease, Kaushal uses his wrist, as well as his fingers, to put significant work on the ball - a ploy that is said to make his doosra particularly difficult to pick.Having begun his cricket in Galle's Devapathiraja College, Kaushal's debut first-class season was a 20-year old's dream. In seven matches for Nondescripts Cricket Club, he reaped 50 wickets at an average of 15.20, and collected six five-wicket hauls. For those efforts, and for a strong List A season, he was picked in two Test squads within 14 months of arriving on the domestic scene, but did not get a game in either series.The bumper hauls continued in 2014, when he claimed 43 wickets at 23.55 in the Premier League Tournament, and had successful stints in the Sri Lanka A side. Rangana Herath's unavailability for the Boxing Day Test in New Zealand saw Kaushal named in the Sri Lanka squad for that tour. He made his Test debut in that match.Andrew Fidel Fernando",
    "Dushmantha Chameera": "Tall, slim and slippery, Dushmantha Chameera arrived at NCC in 2012, and was quickly marked out as a bowler for the future. First among his virtues is pace, generated from a slightly round-arm action that sacrifices movement. Capable of consistently hitting speeds of over 140 kph, coaches believe he had become the quickest bowler in the country by 23. He had played only a handful of games in his first two seasons, but came into his own in NCC's 2013-14 championship run, claiming 32 first-class cricket at 21.18.Chameera's earned a place in Sri Lanka's Test squad to New Zealand at the end of 2014, but did not play a Test, despite a strong showing in the tour match. He was a late entry into the ODI squad for the same tour, and made his international debut in Wellington, and claimed the wicket of Ross Taylor with a 146kph delivery in his first over.Andrew Fidel Fernando",
    "Kusal Perera": "Possessed of a short backlift, powerful forearms and relentless bloody-mindedness, left-handed batsman Kusal Janith Perera's batting is not just inspired by his hero Sanath Jayasuriya's technique, at times, it seems an exact duplicate. Like Jayasuriya, he has a second skill - though it is wicketkeeping rather than slow left-arm, and he was part of Sri Lanka's Under-19 teams, before he joined Colts Cricket Club as a senior. At Colts, Perera quickly set about forging a career founded on aggression and reliability in equal parts, and after two seasons, Sri Lanka's selectors could no longer ignore him. An injury to Kumar Sangakkara saw him earn a place in Sri Lanka's limited-overs squad to Australia in January 2012, where his breezy innings made plain his talent - particularly during a 22 not out at the Gabba that took Sri Lanka home in a low-scoring ODI.  Though a middle-order batsman by reputation, he was promoted to the position of opener in the two Twenty20s that followed, where he continued to play impactful inningsOn return to Sri Lanka, Perera hit a first-class double-ton, then a 275-ball 336, and had proved enough to the selectors to be given a central contract and an extended run in the limited-overs sides.Perera hit his maiden ODI century in Mirpur in 2014 to help Sri Lanka complete a 3-0 whitewash over Bangladesh. He then hammered a 17-ball half-century, Sri Lanka's joint-fastest, against Pakistan in Pallekele in July 2015, to equal Jayasuriya's record.A month later Perera was handed his Test debut against India in Colombo. He made twin fifties, becoming only the second Sri Lanka batsman to score two half-centuries on debut.Perera's burgeoning career hit a stumbling block in December 2015 when he was provisionally suspended from international cricket by the ICC, after having failed a dope test. He was recalled from Sri Lanka's tour of New Zealand and subsequently missed a bilateral T20 series in India, Asia Cup, and World T20.His plight appeared bleak when his initial sample tested positive for the performance-enhancing drug, 19-Norandrostenedione, but it grew bleaker when his B sample returned identical results.Perera had strong support from SLC, though, and also spent a substantial amount of his own money in fighting the WADA-approved lab's findings. His campaign to be cleared included a trip to England for a polygraph test, a hair analysis and a separate urine test, as well as substantial coordination with his main legal team, which was based in the UK. All this eventually paid off when his name was cleared in May 2016, bringing his suspension to an end after five months out - the Qatar-based lab's findings were deemed \"unsustainable\" for \"scientific and technical reasons\" by an independent expert hired by the ICC.ESPNcricinfo staff",
    "Milinda Siriwardana": "A busy middle-order batsman and a capable left-arm spinner, Milinda Siriwardana broke through to the national side in 2015 after several years of encouraging domestic returns. Outstanding form in the 2015 Premier League Tournament prompted his elevation. He was the first-class season's top scorer with 1144 runs at an average of 67.29, and had also claimed 20 wickets for Badureliya Cricket Club. Siriwardana showcased his attacking flair when he made his ODI and T20 debuts during Pakistan's mid-year tour of Sri Lanka, and memorably struck his first international fifty in 25 deliveries during a breakneck 114-run ODI stand with Angelo Mathews. A successful initiation in those formats paved the route to his Test debut against West Indies later the same year. He had made his first-class debut for Sebastianites Cricket and Athletic Club in 2005, and had played for Sri Lanka A for several years before getting his international break. Siriwardana came close to national recognition was when he was included in the 30-member provisional squad for the 2009 World T20, but he was left out of the final team. That call-up came close on the heels of his maiden first-class ton, 135 for Basnahira South against Ruhuna in the SLC Inter-Provincial Tournament, a match in which he also claimed five wickets.Andrew Fidel Fernando",
    "Kusal Mendis": "Blessed with a compact technique, an aggressive impulse, and an iron resolve, Kusal Mendis rose rapidly through the age-group system, and quickly became one of the most promising young batsmen in the world. He had played only 16 first-class innings before he made his Test debut at the age of 20, and had hit only one first-class hundred before he made a maiden Test ton. That hundred - the 176 against Australia at Pallekele - was a match-flipping, series-defining knock, which given the fact no other batsman mustered more than 55 in the game, is one of the greatest ever Sri Lankan innings. Since then, Mendis has put together some impressive ODI innings as well, and has embedded himself in the Test top four. A highly-rated graduate of Sri Lanka's school cricket system, Mendis' batting had earned him a large following long before he was on the national selectors' radar. As wicketkeeper and flowing right-hand batsman, Mendis won the Schoolboy Cricketer of the Year award in 2013, for his work in the Prince of Wales College team. He was Sri Lanka's under-19 captain in the Youth World Cup the following year.Mendis began his first-class career for Bloomfield Cricket Club in the Premier League Tournament of 2015. He had a middling first season, hitting 459 runs at an average of 30.60, but continued to be followed closely as Sri Lanka moved to flood their Test team with youth. It was Mendis' excellent returns in the Moin-ud-Dowlah three-day tournament in Hyderabad that paved his route to the national team. He was named in the squad to play West Indies in October 2015, and made his debut in the second match of that series.Andrew Fidel Fernando",
    "Udara Jayasundera": "Udara Jayasundera is a left-handed batsman who was selected for the 2010 Under-19 World Cup in New Zealand. He scored 82 against Bangladesh U-19 in the Tri-Series in November 2009. His idol is Brian Lara. He has ambitions of being an businessman if he cannot make it as a professional cricketer.  Cricinfo Staff January 2010",
    "Dasun Shanaka": "An explosive middle-order batsman, and steady right-arm seam bowler, Dasun Shanaka worked his way into Sri Lanka's T20 side through several seasons of good performances for Sinhalese Sports Club. Born and educated in Negombo, Shanaka made his T20 international debut against Pakistan in August 2015, but it wasn't until the following domestic season that he achieved wide acclaim. Batting at No. 4 in an AIA Premier T20 match against Saracens Sports Club, Shanaka struck a Sri Lankan record 16 sixes in an innings worth 123 from 46 balls. That wasn't even his biggest T20 score of the last week. He had hit 131 off 48 balls against Galle Cricket Club one week earlier.But it was with the ball that Shanaka first made his mark on the international stage. He took 3 for 16 on a Pune greentop, against India, having only taken two domestic T20 wickets before then. He played bright cameos in Sri Lanka's 2016 World T20 campaign, and in April he was picked in the Test squad - for Sri Lanka's tour of England -  for the first time, largely on his potential, rather than his first-class record.Andrew Fidel Fernando",
    "Dhananjaya de Silva": "A technically correct top-order batsman from the southern reaches of the island, Dhananjaya de Silva briefly caught the national selectors' eye in 2015, then went on to have a bumper domestic season that marked him out for more intensive national duty. De Silva had been picked on potential in Sri Lanka's mid-year T20s against Pakistan, in 2015, but didn't quite convince he was a T20 batsman, hitting 45 off 47 balls across two innings. What followed, though, was an emphatic blooming.De Silva first topped the batting charts in the Super T20 Provincial Tournament in early 2016, hitting 234 runs at a strike rate of 133, in six innings. Months later, he was the star of Tamil Union's first victorious first-class campaign in 55 years, hitting 868 runs at 54.20, which featured a crucial fourth-innings 121 in the match that clinched his team the title. Incredibly, though usually employed as a part-time offspinner, de Silva was also his club's most successful bowler that season, claiming 32 wickets at 14.23. Those numbers helped earn him his first call-up to Sri Lanka's Test squad - for the England tour in May and June 2016.  Andrew Fernando, May 2016 ",
    "Lakshan Sandakan": "A slight, left-arm wristspinner from the outskirts of Colombo, Lakshan Sandakan's consistent hauls in first-class cricket have placed him among the Sri Lanka's best spin prospects. Operating off a shuffling approach and a quick action, Sandakan has the ability to turn the ball both ways, and skid it into the pad.Graduating from De Mazenod College in Kandana, Sandakan made an inauspicious start to his first-class career in 2012, for Saracens Sports Club. But having moved to Colombo Cricket Club by the following season, the wickets began to come thick and fast. He topped the 2013-14 first-class season's wicket-takers' list, with 54 scalps at an average of 19.14. For those efforts, Sandakan earned a place in Sri Lanka's ODI squad to play England at home in late 2014, though he never played a game.In the following season, Sandakan was again impressive, with 45 wickets at 24.28. When he went on to top the wicket-taker's list for the second time in three seasons, in the 2015-16 Premier League Tournament, the national selectors rewarded him with a place in the A team squad to England. Sandakan took 5 for 40 in a List A match against Derbyshire on that tour, and was given a second call-up to the national squad almost immediately, thanks in part to injuries to several frontline Sri Lanka players. This time he got to play at the international level, making his Test debut against Australia in Pallekele.Andrew Fidel Fernando",
    "Vishwa Fernando": "A left-arm quick from Moratuwa, Vishwa Fernando has been earmarked for national duty, thanks largely to the skiddy pace he generates from a whippy action. Having made his first-class debut in 2012, Fernando showed early potential, claiming 26 wickets in his maiden season.Fernando's bowling, though, was always thought to be better than his figures suggest. His first foray into the national squad was based on little more than a selector's hunch, and a desire to blood left-arm quicks, who are in short supply in Sri Lanka's domestic cricket. Fernando was named in in Sri Lanka's Test squad to the UAE in 2014, before also traveling to Bangladesh with the side soon after. He did not make an international debut, however, and returned home to play out a modest series against the visiting England A side.He would get another break in 2015, when he was named in Sri Lanka's Test squad for the series against India, in August. This time, his selection was backed by wickets. Fernando had been the most penetrative quick in the 2014-15 Premier League Tournament, having claimed 40 scalps at an average of 21.97.\n",
    "Asela Gunaratne": "A batting allrounder with powerful shots square of the wicket, Asela Gunaratne put together several impressive seasons for Sri Lanka Army Sports Club before eventually being considered for higher honours in 2016. Though not an immediately eye-catching player, it was his consistency that impressed: batting in the middle order, Gunaratne averaged more than 50 in three of the four Premier League Tournaments between 2012 and 2016. A wide range of strokes, including his favoured reverse sweep, had also helped his case. He was a sporadic performer when chosen in the A side, yet was immediately effective in Tests, hitting a fifty and a hundred in his first three international innings, against Zimbabwe. With Angelo Mathews ruled out of that tour, Gunaratne also earned a place in the ODI squad, and made an impact with his dibbly-dobbly slow-medium bowling, claiming eight wickets at an average of 14.5 as Sri Lanka won the tri-nations trophy in Zimbabwe, in November 2016. He had an impact in the shortest format too, helping Sri Lanka claim a T20 series in Australia in February 2017 by knocking off 84 in 46 balls in Geelong - three consecutive sixes in the penultimate over included, in a chase of 174. A graduate of Sri Rahula College Kandy, Gunaratne has also served as a Bombardier in the Sri Lanka Army.",
    "Lahiru Kumara": "A robust, right-arm fast bowler from Kandy, Lahiru Kumara had played only eight days of first-class cricket - all of which were for the Sri Lanka A team - before he was selected in the Test squad in October 2016. He was largely picked on his promise. One of the fastest bowlers in Sri Lanka's system, Kumara possesses a sharp bouncer, and an ability to both swing and seam the ball - all allied to a bustling intensity.He had played in the Under-19 World Cup in February, but it was on a u-19 tour of England that he put himself into contention for higher honours. He took a series-high 13 wickets at an average of 18.30 through the Youth Tests, and was especially effective at Northampton, where he claimed first-innings figures of 7 for 82, then a further 4 for 52 in the second innings to send England Under-19s to their first home defeat in six years.Injury layoffs for Dushmantha Chameera, Nuwan Pradeep and Dhammika Prasad then opened up a spot for Kumara in the Test team. Though his initial performances in Zimbabwe were modest, Kumara became the second-youngest Sri Lanka bowler to claim a five-wicket haul at Newlands, in January 2017, taking 6 for 122 in the first innings. ",
    "Danushka Gunathilaka": "A poised, attacking left-handed opener groomed in part at Sinhalese Sports Club, Danushka Gunathilaka was plucked from the domestic system largely on potential, and drafted into Sri Lanka's A team for the tour of New Zealand in mid-2015. He impressed on that trip, hitting two smart fifties from four innings, to finish as the team's second-highest run-scorer.Those performances earned him a national call-up for the home series against West Indies in November. Gunathilaka then earned a second trip to New Zealand - with the senior team this time - and despite modest returns from his first three ODIs, he struck a rapid 65 in Nelson to win a Man-of-the-Match award.Gunathilaka was not originally part of Sri Lanka's squad for the 2017 Champions Trophy in England, but came into it ahead of their second match thanks to an injury to Chamara Kapugedara. He made a stunning entrance, scoring 76 off 72 balls to help haul down a target of 322. That innings was followed by a run of three fifties and a maiden hundred in the ODI series against Zimbabwe, cue a call-up to the Test side. The Test debut was a disappointment, Gunathilaka scoring 16 and 2 before falling to loose strokes in both innings.Strong square of the wicket, particularly on the off side, Gunathilaka, who admires Kumar Sangakkara, is also a part-time offspinner. He had played in Sri Lanka's Under-19 team in the 2009 Youth World Cup.Andrew Fidel Fernando",
    "Malinda Pushpakumara": "A canny left-arm spinner with dangerous variations, Malinda Pushpakumara has been Sri Lanka's most prolific domestic wicket-taker of recent years. First-class tracks on the island are stacked heavily in favour of spinners, but even so, it is Pushpakumara's consistency that makes him stand out. He was the Premier League Tournament's top wicket-taker in the 2012-13 and 2014-15 tournaments, and was among the best again in the years in between. But 2016-17 was his best tournament of the lot: at an average of 13.79, Pushpakumara claimed 77 scalps - 20 more than his nearest competitor. With that tally, he finally forced himself into a Sri Lanka Test squad, at the age of 29 and with 558 first-class wickets to his name. The delay in his being chosen for the top level perhaps also has to do with Rangana Herath's presence in the team - the selectors believing only on left-arm spinner necessary.Having begun his career in Lumbini College, Colombo, Pushpakumara had also played for Sri Lanka's Under-19 side in 2005, in a triangular tournament featuring England and Bangladesh. Later, after coming of age at the first-class level, he also played for Sri Lanka A with some success, against the likes of South Africa A, New Zealand A and West Indies A.Andrew Fidel Fernando",
    "Lahiru Gamage": "",
    "Sadeera Samarawickrama": "In the longest format, Sadeera Samarawickrama is a dashing wicketkeeper-batsman who plays in the middle order. In limited-overs cricket, he has routinely set his teams off to fast starts as an opener. In any case, few school leavers of his vintage have made such a successful transition to the senior level. The national selectors have taken notice. Having begun his cricket at Colombo's Thurstan College, Samarawickrama moved to St Joseph's in his final years, and prospered in the school system, even hitting a memorable 126 in St Joseph's biggest fixture of the year. That performance propelled him into Sri Lanka's Under-19 squad, where he again impressed, making 265 runs at an average of 44.17 in the 2014 Youth World Cup. While Kusal Mendis - his team-mate from that U-19 side - was fast-tracked to the national side, Samarawickrama would have to earn his place through first-class performances. His first season with Colts Cricket Club was modest, but his second was good, and his third outstanding. Samarawickrama topped Tier-A run charts with 1016 runs at 59.76 in the 2016-17 season. On his debut for Sri Lanka A in February 2017, he cracked 185 runs off 223 balls against a strong England Lions attack. On the back of those runs, Samarawickrama earned a maiden Sri Lanka call-up in September of the same year, for the Tests against Pakistan.Andrew Fernando",
    "Roshen Silva": "One of Sri Lanka's most consistent domestic batsmen, rare is the year in which Roshen Silva does not average close to or above 50 in the Premier League Tournament. His challenge has been to stand out. Though often one of the best batsmen in any first-class season, Silva has rarely been the top-scorer, nor the batsman who appears most naturally gifted among the domestic lot. But eventually the piles of runs he had accrued began to pique the national selectors' interest. For Silva, 2016 was almost a breakthrough year. Having impressed in an October tour of New Zealand for Sri Lanka A the previous year, Silva scored 678 runs at an average of over 55 in the 2016 Premier League Tournament. When he followed that up with 314 runs at 62.80 for Sri Lanka A in England, he was called up to the Test squad. Had it been any other series, Silva may have made his debut, only he had been selected for the series in which Sri Lanka would whitewash Australia 3-0 - the selectors saw no need to make changes to the batting order. Silva would be picked in the Sri Lanka squad again - this time in the outfit to play Pakistan, in September and October 2017. A graduate of St Joseph's College, Silva had also played for Sri Lanka's Under-19 side.Andrew Fernando\n",
    "Akila Dananjaya": "Another installment from Sri Lanka's production line of unorthodox spinners, Akila Dananjaya sparked controversy when he was picked in the preliminary squad for the 2012 World Twenty20, despite never having played a professional match in his life. Able to deliver a legbreak, googly, carrom ball, doosra and a stock offspinner with astounding control, he had impressed Mahela Jayawardene so much as a net bowler at a Sri Lanka practice session, that Jayawardene requested he be fast-tracked to the national squad.Dananjaya plays for Jayawardene's Wayamba United franchise in the Sri Lanka Premier League, and earned a call-up to the final 15 for the World Twenty20 after four fine performances in the tournament. He made significant contributions to that World T20 campaign, even playing in the final, but went out of favour with the selectors once Jayawardene stepped down from the captaincy. In the years since, Dananjaya has been sporadically picked in the Sri Lanka A team, but has not quite lived up to the promise of his early months in the spotlight. He was picked again in a Sri Lanka squad for ODIs against Zimbabwe, in June 2017. Andrew Fidel Fernando, June 2017",
    "Kasun Rajitha": "Virtually unheard of before 2015, the first inkling of right-arm seamer Kasun Rajitha's potential came during a three-dayer against the touring Indians in August of that year. He took 5 for 68 on a spicy Khettarama deck in that match, dismissing Shikhar Dhawan, Virat Kohli and Rohit Sharma in a single spell, before claiming Kohli's wicket in the second innings as well.Achieving appreciable seam movement at a sharp pace, and from a high release point, Rajitha proved to be a penetrative T20 bowler in the following domestic season. He was the second-highest wicket-taker in the Super T20 Provincial Tournament, with 10 scalps in six matches. That performance earned him an international T20 debut, where he claimed two wickets in his first over, against India in Pune.",
    "Mahela Udawatte": "A prolific run-getter for Ananda College, Mahela Udawatte's talents as a top-order batsman were not immediately recognised when he was overlooked for the Sri Lankan Under-19 team in 2003 despite scoring more than 1000 runs for his school that season. He got his break after he joined Chilaw Marians SC straight after school. Promoted to open the batting - he had batted at No. 3 at school - he reeled off three hundreds in five matches in the 2004-05 U-23 tournament, and was rewarded with a place in the Development Squad. He soon made it into the A team for the tour to England in 2007 after top-scoring for his club in the Premier final against SSC in 2005-06, making 67 out of 172 against an attack which included Dilhara Fernando and Nuwan Zoysa. A powerful and attacking batsman who likes to take on the quick bowlers, Udawatte is seen as a future prospect for the Sri Lanka one-day side, perhaps as a replacement for Sanath Jayasuriya. Rated highly by experts in Sri Lanka, including Mahela Jayawardene, Udawatte earned a call-up to the national squad for the tour of West Indies in 2008.  Sa'adi Thawfeeq July 2008",
    "Chamika Karunaratne": "",
    "Lasith Embuldeniya": "",
    "Oshada Fernando": "",
    "Wanindu Hasaranga de Silva": "A bruising lower-middle order batsman, and an aggressive legbreak bowler, Wanidu Hasaranga graduated from a strong Richmond College outfit, had a fine run in Sri Lanka's 2015 and 2016 Under-19 teams, and has made a promising start to his domestic cricket career.Though it was his bowling that largely impressed at the Under-19 level - he claimed a particularly impactful 3 for 34 in the 2016 Youth World Cup quarter-final against England - batting was Hasaranga's stronger suit in his first two seasons of senior cricket. Hasaranga made a rapid 87 on first-class debut with Ports Authority Cricket Club, and, having switched to Colombo Cricket Club, hit 586 runs at an average of 39.06 and a strike rate of 93 in the 2017 Premier League Tournament. When this first-class runs tally was followed by a stretch of good bowling form in List A domestic tournaments, Hasaranga piqued the national selectors' interest. He was chosen in Sri Lanka's squad for the first two one-dayers against Zimbabwe in June 2017, with his fielding also cited as a reason for his selection. And what a debut it subsequently was; he became the third debutant in ODI history to claim a hat-trick when he wiped out Zimbabwe's tail with the 14th, 15th and 16th deliveries of his international career.Andrew Fidel Fernando",
    "Minod Bhanuka": "",
    "Asitha Fernando": "",
    "Ramesh Mendis": "",
    "Pathum Nissanka": "",
    "Praveen Jayawickrama": ""
}