{
    "Ashantha de Mel": "ඔහු අති නවීනත්වීමේ හැකියාව ලබා ගැනීමේ හැකියාව ඇති බ්රිස්ක් දකුණු පන්දු යවන්නා වූ අතර, අශාන්ත ද මෙල් යනු ශ්රී ලංකාවේ ප්රමුඛ පෙළේ වේග පන්දු පන්දුවරය පූර්ණ පරීක්ෂණ තත්වයට පත්වීමයි.1981-82 දී එංගලන්තයට එරෙහි ශ්රී ලංකාවේ ආරම්භක ටෙස්ට් තරගයේදී ද මෙල් ලකුණු 30 ක් සහ 1 ක් සඳහා ලකුණු 4 ක් ලබා ගත්තේය. පාකිස්තානයේ පහත දැක්වෙන සංචාරයේදී කඩුලු 11 ක් දවා ගත්තේය.1982-83 දී ඉන්දියාවට එරෙහි එක් ඕෆ් ටෙස්ට් තරගයේදී ඔහු දෙවන ඉනිමේදී ලකුණු 5 ක උල්පතක් ලබා ගත් පළමු ශ්රී ලාංකික වේග පන්දු යවන්නා බවට පත්විය.පිතිහරඹය සමඟ, ද මෙල් ඔහුගේ ආක්රමණශීලී ශෛලිය සමඟ පහළ ඇණවුමේ වටිනා දායක මුදල් ලබා දිය හැකි හස්ත රංගන ශිල්පියෙකි.බරපතල දණහිසේ ආබාධයක් 1987 ලෝක කුසලාන තරගාවලියෙන් පසු ඔහුගේ වෘත්තිය නොමේරූ අවසානයකට ගෙන ආ නමුත් පොදුරාජ්ය මණ්ඩලීය ක්රීඩා උළෙලේ පෙනී සිටීම ඇතුළු ශ්රී ලංකාව පාලමෙන් පිරිනමන ලදී.ඔහු ශ්රී ලංකා ක්රිකට් මණ්ඩලයේ අතුරු කමිටුවේ අතුරු කමිටුවේ සේවය කළ අතර 19 න් පහළ පැත්තේ ජාතික තේරීම් කමිටුව සහ කළමනාකරුවෙකු ද විය.\nජොහාන් පී ජයසේකර (2004 අප්රේල්)",
    "Somachandra De Silva": "ශ්රී ලංකාවේ හොඳම කකුල් කරුවෙකු වන සෝමචන්ද්ර ද සිල්වාගෙන් එකක් වූයේ ශ්රී ලංකාවට පූර්ණ පරීක්ෂණ තත්ත්වයක් ලබා දීමෙන් පසුව බොහෝ ක්රීඩකයින් විශ්රාම යාමට නියමිත අවධියක සිටියදීය. ඔහු ශ්රී ලංකා කණ්ඩායමේ සවිකෘත, සහ හොඳින්\nලොව පුරා ක්රිකට් රවුම් ලින්කන්ෂයර් සහ ෂ්රෝප්ෂයර් සඳහා කුඩා කවුන්ටි ක්රිකට් ක්රීඩා කර ඇත. 70 දශකය පුරාම ඔහුගේ ගුවන් ගමන් සහ හොඳින් වෙස්වළාගෙන වැරදි ලෙස වැරදි ලෙස වෙස්වළාගත් වැරදි ලෙස වැරැද්දක් කර ඇත. ශ්රී ලංකාවේ සමාරම්භක පරීක්ෂණයේදී ඔහු සිය පළමු ටෙස්ට් කඩුල්ල 38 ක් සඳහා ලකුණු 38 ක් සහ 0 කට දැවී ගියේය. ද සිල්වා පහත දැක්වෙන සංචාරයේදී කඩුලු 17 ක් දවා ගනිමින්, පසුගිය කඩුලු 3 ක් තුළ කඩුලු 17 ක් ද, ශ්රී ලංකාව විසින් ෆයිසලාබාද් හි ලකුණු 59 කට කඩුලු 5 කට ලකුණු 5 ක් ලබා ගත්හ. 1982-83 නවසීලන්තයේ සංචාරය මුලදී දුලෙප් මෙන්ඩිස් තුවාල වූ විට ද සිල්වාට ගෞරවය පුද කළේය\nශ්රී ලංකාව ටෙස්ට් තරග දෙකකට මෙහෙයවීම. පිතිහරඹයත් සමඟ ඔහු කපිතාන්වරයා ලෙස අර්ධ ශතක දෙකක් සෑදීමට වඩා වැඩි යමක් විය. ක්රීඩාව තුළ ඔහු සිය ප්රසිද්ධියේ නඩත්තු කළේ ශ්රී ලංකාව පුහුණු කිරීමෙනි. පසුව ඔහු ශ්රී ලංකා ජනාධිපති මහින්ද රාජපක්ෂ මහතා විසින් 2007 දෙසැම්බර් මාසයේදී ශ්රී ලංකා ජනාධිපති මහින්ද රාජපක්ෂ මහතා විසින් 2007 දෙසැම්බර් මාසයේදී ශ්රී ලංකා ජනාධිපති මහින්ද රාජපක්ෂ මහතා විසින් රටේ යුද්ධයට ගොදුරු වූ උතුරු ප්රදේශවල ක්රීඩාව ප්රවර්ධනය කිරීම සඳහා පත් කරන ලදී. 2009 දී ද සිල්වා මහතා හතක හත් දෙනෙකුගෙන් යුත් අතුරු කමිටුවක සභාපති ලෙස ශ්රී ලංකා ක්රිකට් ක්රීඩාවේ සභාපති ලෙස ක්රීඩා අමාත්ය ගාමිනි ලොකුගේ මහතා විසින් පත් කරන ලදී.\nජොහාන් පී ජයසේකර (2009 මාර්තු)",
    "Ajit de Silva": "අජිත් ද සිල්වා තම මව්බිම තුළ ඉහළ පෙළේ වම් පසින් ඕතඩොක්ස් දඟ පන්දු යවමින් සිටියේය.සැලකිය යුතු බලපෑමක් ඇති කිරීමට අපොහොසත් වූ විට එය ඔහුගේ ආධාරකරුවන්ට විශාල කලකිරීමක් විය\nඉහළම මට්ටම.කොළඹදී එංගලන්තය ක්රීඩා කළ සමාරම්භක පරීක්ෂණ කණ්ඩායම තුළ ද සිල්වා තෝරා ගන්නා ලදී.සෑම ඉනිමකින්ම තරමක් කඩුලු 2 ක් කඩුලු 2 ක් කඩුලු 2 ක් දවාගනිමින් ඔහුට අඛණ්ඩව කඩුලු 2 ක් කඩුලු 2 ක් දවාගත හැකි නමුත් පන්දුව ස්පින් පන්දු යැවීම සඳහා වාසිදායක කඩුල්ලක් ලබා දීමට අපොහොසත් වුවද.ටෙස්ට් ක්රිකට් ක්රීඩාවේ ආරම්භක වසර තුළදී ශ්රී ලංකාව හොඳ ස්ථාවරයක් ලබා ගන්නා දඟ පන්දු යවමින් ඩී.එස්. ද සිල්වා සමඟ ශ්රී ලංකාව හොඳ ස්ථාවරයක් ලබා දෙනු ඇතැයි අපේක්ෂා කරන ලදී.කෙසේ වෙතත්, මෙය එසේ නොවේ, තවත් පරීක්ෂණ තුනකින් ඔහුගේ ප්රතිලාභ අපේක්ෂාවන්ට වඩා අඩු විය.පාකිස්තානයේ සංචාරය සඳහා ඔහු කරච්චි සහ ෆයිසලාබද්හි නිවැරදිව පන්දු යැවූ නමුත් පරීක්ෂණ ගුණාත්මක පිතිකරුවා බැහැර කිරීමට පොරබදීය.ඔහු ඕනෑම දෙයක් අවසන් කළා\n1982-83 දී ශ්රී ලංකාව නියෝජනය කිරීමට තවත් බොහෝ අවස්ථාවක් ඔහු දකුණු අප්රිකාවට සංචාරයට සම්බන්ධ විය.ජොහාන් පී ජයසේකර",
    "Roy Dias": "රෝයි ඩයස් ටෙස්ට් මට්ටමින් ශ්රී ලංකාව සඳහා අශෝභන තරඟයක් පැවැත්වූ අතර, අංක 3 හි පන්දුවට පහරදුන්; ලකුණු ලබා නොගෙන ඔහු බොබ් විලිස් විසින් ඔවුන්ව බැහැර කරනු ලැබීය. කෙසේ වෙතත්, දෙවන ඉනිම ඩයස් හි සියළුම පිතිකරණ කුසලතා 77.77. කඩුල්ල දෙස බැලීම සතුටට කරුණකි\nකාලය, සම්භාව්ය ශෛලියක් සමඟ සංයුක්ත වේ. ශ්රී ලංකාව ටෙස්ට් තත්ත්වය ලබා ගැනීමේදී දැනටමත් පළපුරුදු පළමු පන්තියේ ක්රිකට් ක්රීඩකයෙක් වන ඩයස් ශ්රී ලංකාවේ ආරම්භයේ ආරම්භයේ දී පන්දුවට පහර දීම සහ දුලීප් මෙන්ඩිස් සමඟ පන්දුවට පහර දීමේ කොඳු නාරටිය විය. පාකිස්තානයට පරීක්ෂණ චාරිකාවේදී පාකිස්තානයට පැමිණෙන පරීක්ෂණ චාරිකාවේදී ඩයස් සිය පංතිය ඉස්මතු කළේය. 49.16 දී ලකුණු 295 ක් රැස් කළ අතර, ෆයිසලාබාද් හි 98 ක් ඇතුළුව 98 ක් ඇතුළුව\n109 ලාහෝර්හිදී, ස්ථිරව තබාගෙන ස්ථිරව තබාගෙන ඉම්රාන් ඛාන්හි වේස් පන්දු යැවීමේදී වියළීව මිරිකීමේ මුහුණක ඔහු වටා කඩා වැටුණි. 1985-86 දී ඉන්දියාව තුළ ඉන්දියාවට වඩා ශ්රී ලංකාවේ මංගල ටෙස්ට් ජයග්රහණය සහ තරග ජයග්රහණය පිළිබඳ ජෙක්ව ජයග්රහණය කළ විට ඩයස්ගේ දායකත්වය තීරණාත්මක විය. දෙවන ටෙස්ට් තරගයේ ද්විත්ව පනස් questions යින් සැකසීමට උපකාරී විය\nඅවසන් ටෙස්ට් තරගයේදී ශ්රී ලංකාව අමතක වූ අද්දරදී ජයග්රහණයක් ලබා ගත් ඩයස් ශ්රී ලංකාව සුපිරි 106 ක් සමඟ ශ්රී ලංකාව බේරා ගත් අතර දිනුම් ඇදීමක් සහතික කර තිබේ. විශ්රාම ගැනීමෙන් පසු, කලක් ශ්රී ලංකාවේ තරගයේදී ඩයස් තම පැතිකඩ පවත්වා ගෙන ගියේය.\nජොහාන් පී ජයසේකර",
    "Mahes Goonatilleke": "පහළ නියෝගයේ කාර්යක්ෂම ග්ලෝවඹුවන් සහ ප්රවීණ පිතිකරුවෙකු වන ගූනතිලෙක් ශ්රී ලංකාවේ කඩුලු රකින්නා වූයේ ටෙස්ට් පිටියේදී ඔවුන්ගේ ආරම්භක අව්යාජ ය.දක්ෂ ක්රීඩකයෙකු වන ගූනැටිලෙක් ශ්රී ලංකාවේ ටෙස්ට් තරගයට පිවිසෙන පැත්තේ සිය තනතුර පිහිටුවන ලදී.කඩුලු පිටුපස විත්තිහක හෝ භ්රමණයට ඔසවා බැලූ කඩුලු පිටුපස දක්ෂතා දක්වන දක්ෂතාකරුවෙකු ලෙස ඔහුගේ රංගනයන්ගෙන් ඔහුගේ රංගනයන් පොරොන්දු වෙමින් තිබේ.පිතිහරඹයත් සමඟ ඔහු පහසු රංගනයන් යම් යම් කාර්ය සාධනයක් ඇති කිරීම සඳහා විශාල ප්රතිරෝධයක් ලබා දුන්නේය.ෆයිසලාබාද් හි දෙවන ටෙස්ට් තරගයේදී පිතිකරණය විවෘත කරන ලෙස ඔහුගේ හැකියාව එවැනි විය.පළමු ඉනිමේදී ලකුණු 27 ක් ලබාගෙන දෙවන ඉනිමේදී ලකුණු 57 ක් රැස් කරමින් ඔහු වටා ඇති පන්දුවට පහර දීමක් ලෙස ස්ටොයික් ප්රතිරෝධයක් ලබා දුන්නේය.ඔහු බලාපොරොත්තු සුන් වූ විට ශ්රී ලංකාව ගුණාත්මක ක්රීඩකයෙකු සොරකම් කරන ලදී\n1982-83 දී දකුණු අප්රිකාවේ සංචාරය කිරීමට තීරණය කළ අතර, ඔහුගේ ටෙස්ට් දිවිය අවසන් වෙමින් පැවතුනි.\nජොහාන් පී ජයසේකර",
    "Lalith Kaluperuma": "ලලිත් කලුප්පාමා ශ්රී ලංකාව ටෙස්ට් තත්ත්වය ලබා දෙන විට දේශීය මට්ටමින් ඉටු කරන ලද දම්පූර්ණ දරුවෙකි.පිතිහරඹය සමඟ පහළ අනුපිළිවෙලකට ද හැකියාව ඇති ඔහු තම ගෘහස්ථ ස්වරූපය ජාත්යන්තර තලයට මාරු කිරීමට අපොහොසත් විය.එංගලන්තයට එරෙහිව ශ්රී ලංකාවේ සමාරම්භක ටෙස්ට් තරගයේදී ඔහු සිල්වස් යන දෙඅජ්යය වන ඩී.එස්. සහ අජිත් යන ඩි ඩි.ෆයිසලාබාද් හි දෙවන ටෙස්ට් තරගාවලිය සඳහා ඔහු නැවත පාකිස්තානයට සංචාරය කරන ලද පාකිස්තානයට පිවිසීම නැවතත් ඔහු ද සිල්වාගේ පන්දු යැවීම තරගාවලියේදී යටපත් කළේය.ඔහු ඕනෑම දෙයක් අවසන් කළා\n1982-83 දී දකුණු අප්රිකාවේ සංචාරයට සම්බන්ධ වීමට තවදුරටත් නියෝජිත ගෞරව සම්පාදනය කිරීමේ අවස්ථා.පසුව ඔහු ජාතික තේරීම් කාරකයෙකු බවට පත්ව 2005 මැයි මාසයේදී 2005 මැයි මාසයේදී තේරීම් කමිටුව දෙසට ගමන් කළේය.ජොහාන් ජයසේකර",
    "Ranjan Madugalle": "මෙඩෙස්ට් පිටියේදී ශ්රී ලංකාවේ ආරම්භක වසරවල වර්තමාන සවිකිරීමේ තරගයක් වන මඩුගල්හි දැඩි දකුණු පසක පිතිකරුවෙකි. ඔහුගේ වෘත්තීය වාර්තාව සමහර විට ඔහුගේ දක්ෂතා පිළිබිඹු නොකරයි.1981-82 දී එංගලන්තයට එරෙහිව ශ්රී ලංකාවේ මංගල ටෙස්ට් තරගයේදී ඔහු සිය මංගල දර්ශනය කරමින් ක්ෂණික බලපෑමක් ඇති කළේය.ටෙස්ට් මට්ටමේ දී විශාල ලකුණු ලබා ගනිමින් මඩුගල සිය වෘත්තීය සමයේ දී solid න රංගන ශිල්පියෙකි.ඔහුගේ එකම ටෙස්ට් ශතකය 1985-86 කන්නයේ දී එස්එස්සී හි කන්නයේ දී - ඔහු නිවාස කඩුලු 42 ක් වන අතර ඔහුගේ සාමාන්යය 42.76 ක් වන අතර, ඔහුගේ සාමාන්යය 42.76 ක් වන අතර එය විදේශගත වූ අතර එය පසුගිය 21.50 ක් විය.ඔහු එක් වරක් ටෙස්ට් තරග 21 කදී ජයග්රාහී පැත්තෙන් පැවති අතර, එම අත්දැකීම ඕස්ට්රේලියාව සහ එංගලන්තයට අහිමි වීම සහ පිත්තෙන් කෙට්ටු අක්ෂර වින්යාසයක් අපේක්ෂා කරමින් ඔහු ශ්රී ලංකාව ටෙස්ට් තරගාවලියේ යෙදී සිටියේය.ඔහු 1993 දී අයිසීසී තරග තීරකවරයකු බවට පත්ව ඇති අතර 2001 දී ඔහු පළමු ප්රධාන විනිසුරුවරයා ලෙස පත් කරන ලදී.ඔහුගේ පහසු බාහිර හා ආකර්ශනීය පෞරුෂය දැඩි විනයගරුකයක් ලෙස කීර්තියක් ඇති අයෙකු සඳහා වෙස් මුහුණකි.\nමාටින් විලියම්සන් 2006 අගෝස්තු",
    "Duleep Mendis": "මනෝභාවය ඔහුව රැගෙන යන විට කිසිදු මට්ටමක ප්රහාර එල්ල කිරීමට හැකි විස්ඩන් ඕවර්වීවා ශක්තිමත්, මැලුම්, මැලුම් සහිත පිතිකරුවාට මනෝභාවය විනාශ කිරීමට හැකියාව ඇති අතර, මේන්ඩිස්, ශ්රී ලංකාවේ මුල් දිනවල ටෙස්ට් සෙල්ලම් කරකැවිල්ලක් ලෙස ක්රීඩා කළේය. 1972 දී ශ්රී ලංකාව වෙනුවෙන් ශ්රී ලංකාව වෙනුවෙන් මුලින්ම ක්රීඩා කළ මෙන්ඩිස් 30 ක් වන නමුත් ඔවුන් පළමු ටෙස්ට් තරගයට යන විට 30 ක් පමණ ආරම්භ වූ අතර, ඔවුන්ගේ තෙවැනි ටෙස්ට් පරීක්ෂණයෙන් පැත්තෙන් කපන්න බරක් තිබියදීත් ඉක්මනින් ඔහුගේ පාද සොයා ගන්නා ලදී. 1982 සිට 83 හැදී වැඩීම සඳහා ඔහු ඉන්දියාවට එරෙහිව ඉනිම දෙකෙහිම 105 ට පහර දුන් අතර, වසර දෙකක සිට වයස අවුරුදු දෙකකට පසුව, 111 සහ 94 ක් සමඟ එංගලන්තයට එරෙහිව. ඉන්දියාව 1985-86 දී ලකුණු 310 ක් රැස් කළේය. පාකිස්තානයට එරෙහිව සිය සියය පාකිස්තානයට පිළිපැදීමෙන් පසු ශීත කාලය ඔහුගේ අවසන් පරීක්ෂණ 10 තුළ පනස්කිරි දෙකක් පමණක් ලකුණු ලබා ගත්තේය. ඔහු වෙනුවට රන්ජන් මඩුගල් විසින් 1988 දී එංගලන්තයේ සංචාරය සඳහා නායකයා ලෙස පත් කරන ලද අතර එහිදී ඔහු ලෝඩ්ස් හි අවසන් ටෙස්ට් තරගයේදී 56 ක් අත්සන් කළේය. ඔහු ශ්රී ලංකාවේ ලෝක කුසලානය සාර්ථකව පැමිණෙමින් සිටියදී ඔහු මහජන අවධාණ්ඩනයේ රැඳී සිටියේය.",
    "Arjuna Ranatunga": "අර්ජුන රණතුංග යනු තොග සහිත වම්පස සහිත පිතිකරුවෙකු වන අතර 1996 ලෝක කුසලානය වන 1996 ලෝක කුසලානය වන ශ්රී ලංකාවට විශාලතම ක්රිකට් ජයග්රහණයට නායකත්වය දුන්නේය.ඔහුගේ නව්ය නායකත්වය ක්රිකට් ක්රීඩාවේ ශ්රේෂ් greatest තම ත්යාගය සඳහා තරඟයට පෙර ශ්රී ලංකා කණ්ඩායමක් ලබා ගත්හ.ඔහු ශ්රී ලංකාවේ සමාරම්භක පරීක්ෂණයේදී වයස අවුරුදු 18 දී ආරම්භ වූ අතර ඔහුගේ රටේ පළමු ටෙස්ට් අර්ධ අර්ධ ශතකය බවට පත් කළේය.වසර 20 කට ආසන්න කාලයක් පුරා ලොව පුරා ක්රිකට් පිට්ටරි පිළිබඳ ප්රමුඛ චරිතයක්, ඔහු කිසි විටෙකත් ගැටුමෙන් මිදුණු අතර, ඔහුගේ ක්රීඩකයින් සහ කඳේ අයිතිවාසිකම් ආරක්ෂා කර නොගනී.එක්දින ක්රිකට් ක්රීඩාවේදී අත්යවශ්ය යැයි සැලකෙන ඉක්මන් තනිකඩව විසඳීමට ඔහුගේ සාපේක්ෂ සුදුසුකම් නොතකා රණතුංගට කඩුල්ලේ දෙපස ඔත්තු ස්ථානගත කිරීම සඳහා මුදා හැරීමේ හැකියාවක් තිබුණි.ඔහු රැවටිලිකාර හා ප්රයෝජනවත් මධ්යම වේග පන්දු යවන්නාක් වූ නමුත් ඔහුගේ පන්දු යැවීම ඔහුගේ වෘත්තීය ජීවිතයේ පසුකාලීනව ඔහුගේ පන්දු යැවීම කලාතුරකින් දක්නට ලැබුණි.1999 ලෝක කුසලාන තරගාවලියේදී ශ්රී ලංකාවේ දුප්පතුකමෙන් පසුව ඔහුට නායකත්වය අහිමි වූ අතර වසරකට ජාත්යන්තර ක්රිකට් ක්රීඩාවෙන් විශ්රාම ගිය නමුත් ශ්රී ලංකා ක්රිකට් ක්රීඩාවට ඔහුගේ දායකත්වය අතිමහත් ය.ඔහු පරිපාලනයට ගොස් 2008 ජනවාරි මාසයේදී මණ්ඩලයේ සභාපතිවරයා ලෙස පත් කළේය. මතභේදාත්මක නිශ්ශබ්දතාවයක් ලැබීමෙන් පසු ඔහු දෙසැම්බර් මාසයේදී නෙරපා හරින ලදී.\nක්රික්ෆෝ කාර්ය මණ්ඩලය",
    "Bandula Warnapura": "ශ්රී ලංකාව ප්රමුඛ පෙළේ ටෙස්ට් රූගත කිරීමේ රටක් බවට පත්වූ විට බන්දුල වර්නට ශ්රී ලංකාවේ ප්රමුඛ පෙළේ ගෞරවයක් තිබුණි.ආරම්භක පිතිකරුවෙකු solid න තාක්ෂණයකින් යුත්,\nවර්නපුර ද දක්ෂ මධ්යම වේග පන්දු යවන්නා විය.ශ්රී ලංකාවේ සමාරම්භක පරීක්ෂණයෙන් 38 දෙනෙකුගෙන් යුත් ඉහළම ලකුණු 38 ක් ලබා ගනිමින් ඔහුගේ ටෙස්ට් තරග හතරේ පන්දුවට පහර දීම ගැන හැඟීමක් ඇති කිරීමට ඔහු අසමත් විය.ඔහුගේ පන්දු යැවීම එක්දින ආකෘතියට වඩාත් effective ලදායී විය.ශ්රී ලංකාවේ ආරම්භක වර්ෂවල ශ්රී ලංකාවේ ප්රමුඛ පෙළේ දුෂ්කරතා සම්බන්ධයෙන් චෝදනා ලැබූ වර්නපුර ප්රශංසනීය රැකියාවක් කළේය.කෙසේ වෙතත්, 1982-83 දී දකුණු අප්රිකාවේ කැරලිකාර කණ්ඩායම සමඟ සංචාරය කිරීමට ඔහු තීරණය කළ විට, ඔහුට ශ්රී ලංකා ක්රිකට් ක්රීඩාවෙන් ජීවිත තහනමක් ලබා දෙන ලදී.ජොහාන් පී ජයසේකර",
    "Sidath Wettimuny": "ටෙස්ට් පිටියේදී ශ්රී ලංකාවේ සමාරම්භක උත්සවයෙන් පසුව සිද්ත් වෙට්ටිමුනි සවිකිරීමේ ස්ථානයේදී සවිකෘත විය. වෙට්ටිමූනි යනු සංයුක්ත තාක්ෂණය සහිත දකුණු අතේ පිතිකරුවෙකි. ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කිරීමට සහෝදරයන් දෙදෙනෙකුගේ බාලයා වෙට්ටිම්නි ය; ඇත්ත වශයෙන්ම දුර්ලභ අවස්ථාවක ඔහු ටෙස්ට් තරග දෙකකදී තම සහෝදරයා වන මිත්රා සමඟ පිතිකරණය විවෘත කළේය. වෙට්ටිමූනි ටෙස්ට් මට්ටමින් සියවස් දෙකක් ලබා දුන්නේය\nඒවායේ historical තිහාසික වැදගත්කමක් ඇති. ෆයිසලාබාද්හිදී, ශ්රී ලංකාවේ ආරම්භක විදේශ සංචාරයේදී වෙට්ටිම්නි 157 ක් එල්ල කළ අතර දෙවන කඩුල්ල සඳහා රෝයි ඩයස් සමඟ හවුල්කාරිත්වයක් බෙදා ගත්තේය. එය ශ්රී ලාංකික ක්රීඩකයෙකු විසින් ටෙස්ට් මට්ටමින් මංගල ශතකය විය. ලෝඩ්ස් හිදී 1984 දී වෙට්ටිමුනි සිය පෙර උත්සාහය ග්රහණය කරගත්තේ විනාඩි 671 ක මුහුණුවල මිනිත්තු 642 ක් තුළ ය. පුදුමාකාර ආ rokes ාතනය සහ ඉනිමට විරේචක විචලනය කර තිබීම. ඉනිමකින් ඉනිමකින් සිය පන්දුව හරහා ගෙන ගිය පළමු ශ්රී ලාංකිකයා වූයේ 1982-83 දින කිහිපය තුළ නවසීලන්තයට එරෙහිව නවසීලන්තයට එරෙහිව - ඔහු නොදැවී ලකුණු 144 න් 63 ක් රැස් කළේය.ස්ථාපිත ආරම්භක හවුල්කාරිත්වයක් සොයා ගැනීමට ශ්රී ලංකාව අභිමතයක් ඇති කරවන විට තෙත් පහර ප්රතිවිරුද්ධ සන්ධ්යාවක් නොතිබීම නිසා ය.ඔහුගේ ටෙස්ට් දිවිය අවසන් වන විට ඔහු තම පෙර ජයග්රහණ පිතිකරණය සමඟ සැසඳීමට මහත් පරිශ්රමයක් ගත්තේය.ඔහුගේ\nඔහු විදේශීය කඩුලු වල වඩාත් effective ලදායී ක්රීඩකයෙකු බව වාර්තා පෙන්වා දෙයි.ඔහුගේ ක්රීඩා දින අවසන් වීමෙන් පසු වෙට්ටිතුනි තරඟ විනිසුරුවරයෙකු ලෙස මුලින් තරගයට සම්බන්ධ වී පසුව ශ්රී ලංකා ක්රිකට් කණ්ඩායමට සහභාගී වූවන්ගේ සභාපතිවරයා බවට පත්විය. ජයාන් පී",
    "Ravi Ratnayeke": "රවී රත්නායක යනු පිතිකරුවෙකු හා පන්දුව අතේ ඇති වූ තුර්කිය සහ බෝල යන දෙකෙහිම අව්යාජ දස්කම් දැක්විය හැකි ක්රීඩකයෙකි. සජීවී වේගයකින් පන්දු යැවීමේ හැකියාව ඇති දකුණු-හස්තයේ මධ්යම වේග පන්දු යවන්නාට හැකි වන අතර පන්දුව හිතකර තත්වයන්ට ගෙන යන්න. පන්දුව සමඟ ඔහුගේ හැකියාවට ප්රශංසා කිරීම සඳහා ඔහු පහළ නියෝගයේ දී දක්ෂ වම් පිතිකරුවෙකු ද විය. ඔහුගේ වෘත්තිය වර්ධනය වූ විට, ඔහුගේ පිතිකරණයට ඔහුගේ පන්දුවට පහර දුන් විට, ඔහුගේ පිතිකරණය පරීක්ෂණ මට්ටමින් පිතිකරණය විවෘත කරන ලෙස ඉල්ලා සිටි අතර එය සාර්ථකත්වය සමඟ එසේ කළේය. සමහරවිට ඔහුගේ ලොකුම ගුණාංගය ඔහුගේ කීර්තිමත්කම හා අධිෂ් ve ානය වන අතර, සෑම විටම තරඟකාරීත්වයට වඩා අඩු ප්රමාණයකට වඩා සෑම විටම තරඟ කිරීමට කැමැත්තෙන් සිටියේය. 21 හැවිරිදි වියේ පසුවන, රත්මේක් මුලින් තෝරාගෙන ඇත්තේ විශේෂ blace පන්දු යවන්නෙකු ලෙස ය. පාකිස්තානයේ ප්රතිචාර නොදක්වන කඩුලු 4 ක් උපයන ලද අතර එය මිල අධික කඩුලු 4 ක් සහ පිතිකරණයේ කඩුලු 4 ක් දවා ගනිමින් ලකුණු 10 ක් දවා ගනිමින් සිටින අතර එමඟින් ලකුණු ලබා ගැනීම දුෂ්කර වූ අතර එස්එස්සී හි නවසීලන්තයට එරෙහිව ඔහුට ඉදිරි ගමනක් ගියේය ඔහු 42 කට 5 ක් සඳහා ලකුණු 4 ක් ලබා ගත් විට, පාකිස්තානයට එරෙහි පසුගාමී තරගමාලාව විසින් රන්නයික් සිමෙන්ති සක්රීය කර ඇත්තේ පන්දුව සමඟ ආකර්ෂණීය සංදර්ශන සහ ඔහුගේ සදහටම වැඩිදියුණු කරන පිතිකරණයෙන් ය. සියල්කොට් හි දී ඔහු පාකිස්තාන ඉනිම 83 කට ලකුණු 83 කට දැවී ගිය විනාශකාරී සංදර්ශනයක් නිෂ්පාදනය කළේය. මෑත කාලය වන තෙක් සියලුම ශ්රී ලාංකික පන්දු යවන්නන් සඳහා මිණුම් ලකුණ ඉතිරි වේ. 1985 සිට 86 දී ඉන්දියානු සංචාරයේදී ආරම්භක ස්ථානයට තල්ලු කර ඇති අතර, රත්මේක් අමතර වගකීමට ප්රතිචාර දැක්වීය. නව පන්දුව සමඟ සටන් කිරීම ඔහුගේ ආරම්භක ඉනිමේදී ඔහු සිරුත් වෙට්ටිමුනි සමඟ 159 ක් එකතු කරමින් ලකුණු 93 ක් රැස් කළේය. පසුව සුපිරි තෙත් සංදර්ශනයක කඩුලු 4 ක් දවා ගත්තේය. දෙවන ටෙස්ට් තරගයේදී, ශ්රී ලංකාව ඔහු යටත් වූ බැවින්\n54 සමඟ ස්ථිර ඉහළ ලකුණු සංඛ්යාවක් පැවැත්වූ අතර, ඔහුගේ වඩාත් කැපී පෙනෙන සගයන් උච්චාරණය කරමින් සිටියේය. ඔහු කප්ටැක් හි පැවති අවසන් ටෙස්ට් තරගයේදී අවසන් ටෙස්ට් තරගයේදී ලකුණු 5 ක් සඳහා කැපී පෙනෙන මාලාවක් ලකුණු 5 ක් සම්පූර්ණ කළේය.\nමෙම අධිෂ් ve ානය හා තරඟකාරී ස්වභාවය ඕස්ට්රේලියාවට එරෙහි සිය මාලිමතුවේ ඉස්මතු විය. ඕස්ට්රේලියාව ශ්රී ලාංකිකයන් තලා දැමූ බැවින් 1988 දී ඔහු සිය ශ්රී ලාංකිකයන් විසින් ශ්රී ලාංකිකයන් තලා දැමීමත් සමඟම දක්ෂ ලෙස වෙහෙස මහන්සි වී වැඩ කළහ. පිතිහරඹය සමඟ ඔහු ලකුණු 28 ක් සහ 34 ක් ලබා ගත් අතර ඉතිරි පිතිකරණයේ ඉතිරි කොටස ලැබුණි. ඕස්ට්රේලියාවේ මීළඟ මාලාවේදී, ඔහුගේ වෘත්තීය දිවියේ අවසාන ශ්රේණියේ ඔහු අරමුණින් පන්දුවට පහර දුන් අතර ශ්රී ලංකාව ඔවුන්ගේ විශාලතම අවශ්යතාවෙහි සිටියදී ශතක දෙකක් රැස් කළේය.\nජොහාන් පී ජයසේකර",
    "Anura Ranasinghe": "1975 දී බටහිර ඉන්දීය කොදෙව් කොල කොඳු ඇට පෙළේ විය යුත්තේ 1975 ලෝක කුසලාන තරගාවලියේදී පාසැල් සිසුවෙකු සිය ජාත්යන්තර මංගල්යයක් බවට පත් කළේය. රණසිංහ ශ්රී ලාංකිකයින් සඳහා තරග තුනම ක්රීඩා කළේය. 1981-82 දී පාකිස්තානයේ ශ්රී ලංකාවේ සමාරම්භක ටෙස්ට් චාරිකාව සඳහා ඔහුගේ ටෙස්ට් තරගය අංක 7 ට පන්දුව ලකුණු 6 ක් සහ 5 පිතිකරණය සමඟ පොරබදමින් සිටියේය පළමු ඉනිම. ඔහුගේ දෙවන හා අවසාන පරීක්ෂණය පසුව ඉන්දියාවට එරෙහිව පැමිණියේය. ලුහුබැඳ ගිය 7 දෙනෙකු සඳහා ඉන්දියාව 135 ක් ලෙස ඉන්දියාව ලකුණු 135 ක් ලෙස වසා දැමූ බැවින් විශිෂ්ට ජයග්රහණයක් උදුරා ගැනීමට පාහේ ඉඩ දී ඇති හෙයින්. ඔහු අඛණ්ඩව ශ්රී ලාංකික කණ්ඩායමේ ප්රධාන ක්රීඩකයෙකු ලෙස කටයුතු කිරීමට අපේක්ෂා කළ නමුත් 1982-83 දී දකුණු අප්රිකාවේ කුප්රකට ශ්රී ලාංකික කැරලිකරුවෙකු සමඟ එක්වීමට ඔහු ජීවිතක්ෂයට පත්වීමට උත්සාහ කරමින් සිටියේය. එය 1989 දී නැවත සකස් කළ විට තවත් සෘතු කිහිපයක් සඳහා සිය ක්ලබ් වෘත්තිය නැවත ආරම්භ කළ අතර පසුව එය පුහුණු කිරීම සඳහා ගියේය. 1998 දී ඔහුගේ 42 වන උපන්දිනයට දින හතරකට පෙර ඔහු හදිසියේම හදිසියේ මිය ගියේය. මාටින් විලස්සන්",
    "Rohan Jayasekera": "1979 දී රොහාන් ජයසේකර එංගලන්තය සංචාරය කළ අතර ශ්රී ලංකා කණ්ඩායම බලවත් පිතිකරුවෙකු හා ස්ටැන්ලි ජයසිංහට ස්ටැන්ලි ජයසිංහ වෙත බලවත් පිතිකරුවෙකු හා වෙන්කිරීමේ කකිරීමක් ලෙස එබඳු ද්විත්ව කාර්යභාරය ඉටු කළේය.කෙසේ වෙතත්, ජයසිංහ වඩාත් කැමති පරිදි ඔහු ලෝක කුසලානය තුළ ක්රීඩා කළේ නැත.ශ්රී ලංකාවේ සමාරම්භක එක්දින තරගාවලියේදී එංගලන්තයට එරෙහිව දිවා කාලයේ එක්දින තරගාවලියේදී ඔහු මංගල්යය පැවැත්වීම, ඔහු කඩුලු 17 ක් ද, ශ්රී ලංකාව ලකුණු 6 කින් පරාජයට පත් කරමින් ලකුණු 17 ක් රැස් කළේය.ඔහුගේ එකම පරීක්ෂණය පාකිස්තානයේ සංචාරය සිදු වූයේ ලාහෝර් හි විශේෂ ist තිකි පිතිකරුවෙකු ලෙස ක්රීඩා කරන අවස්ථාවේදීය.ශ්රී ලංකාව කඩුලු 14 ක් දවාගත් ඉම්රාන් ඛාන් කඩුලු 14 ක් දවා ගත්හ.\nජොහාන් පී ජයසේකර",
    "Roger Wijesuriya": "ශ්රී ලංකා වම්පස වමතින් දඟ පන්දු යවන ක්රීඩක රොජර් විජේසූරිය ටෙස්ට් ඉතිහාසයේ වඩාත්ම දත් නැති පන්දු යවන්නා බවට ප්රකාශයක් තිබේ.ඔහු 1982 සිට 1986 දක්වා ටෙස්ට් තරග 4 ක් ක්රීඩා කළ අතර සෑම පන්දු 586 ක දුරක් කඩුල්ලක වැඩ වර්ජන අනුපාතයක් ලබා ගත්තේය.සාමාන්යයෙන් එය කඩුල්ලක් ලබා ගැනීම සඳහා විජේසූරිය 97 කදී කඩුල්ලක් ලබා ගත්තේය.වෙනත් වචන වලින් කිවහොත්, දින පහක පරීක්ෂණයකින් ඔහු දෙදෙනාම පන්දු යැවූයේ නම්, තරගය අවසන් වන විට විරුද්ධත්වය හතරක් පමණි ... ඔවුන් ලකුණු 1355 ක් රැස් කිරීමට ඉඩ තිබුණි.පාකිස්තානයට එරෙහි U19 මාලාවක කඩුලු 25 ක් දවාගත් අවස්ථාවේදී ඔහු මීට පෙර වැඩි ශබ්දයක් ඇති කළේය. ඔහොබ් ස්මෙත්",
    "Guy de Alwis": "අංක 1 කඩුලුම් රත්රර් නඩත්තු කිරීම සඳහා ද අල්විස් අමල් සිල්වා සමඟ නිරන්තර ගැටුමක් ඇති විය. තරමක් උස, ද අල්විස් උසස් නිලධාරියෙකු ලෙස සලකනු ලැබූ නමුත් සිල්වා පිතිකරණ කණුවල ඉහළ අතක් දිගු කලකින් තබා ඇත. මේත්\n1982-83 නවසීලන්තයේ සංචාරය පිළිබඳ සිය මංගල උත්සවය සඳහා ගූනැටිලකේගේ ඩි ඇල්විස්ට සිය මංගල උත්සවය ලබා දෙන ලෙස ද අල්විස්ට අවසර දුන්නේය. ක්රයිස්ට්චර්ච් හි පළමු ටෙස්ට් තරමේ පළමු ටෙස්ට් තරගයේදී, ඩි අල්විස් ලකුණු 0 ත් 3 ත් අතර අල්ලා ගත් අතර එක් ඇල්ලුවක් ගත්තේය. නවසීලන්තය ශ්රී ලංකාවට සංචාරය කළ විට ඩි අල්විස් ටෙස්ට් තරග තුනේම පවත්වා ගත්තද, අමල් සිල්වා වඩාත් කැමති විය. ඩි අල්විස්ගේ කටයුතු ආදර්ශවත් වූ අතර ඔහු ඒවා හරවා යැවීමට නොහැකි වූ පහළ නියෝගයේ දී සමහර ක්රියා ලකුණු කිහිපයක් කළේය. 1984 එංගලන්තයේ සංචාරය සඳහා එංගලන්ත සංචාරයේදී ඔහුට ඔහුගේ ස්ථානය අහිමි වූ අතර, සිල්වාට ස්වාමිවරුන්ගේ විශාල පරීක්ෂණයක් කර ඇති අතර ඉන් අනතුරුව. ඔහුගේ වැඩිදුර පරීක්ෂණ වලදී - සිල්වා තුවාල ලැබූ විට හෝ අසනීපව සිටින විට - ඩි අල්විස් වෙහෙසකර හැර, ඔහුගේ පිතිකරණය ප්රමිතියට වඩා අඩු විය. එක්දින ක්රීඩාවේදී ඩි අල්විස් තරමක් ප්රයෝජනවත් පහළ ඇණවුම් පිතිකරුවෙකි.\nජොහාන් පී ජයසේකර",
    "Susil Fernando": "",
    "Yohan Goonasekera": "බොහෝ ක්රීඩකයින්ගෙන් එක් අයෙකු 1982/83 ශ්රේණියේ අවස්ථාවක් ලබා දී ඇත\nනවසීලන්තය එය ගූනසේකරගේ එකම ජාත්යන්තරය බව ඔප්පු විය\nමාලාවක්.ඉහළ පන්තියේ නවසීලන්ත වේගයෙන් ප්රහාරයකට එරෙහිව\nශ්රීමත් රිචඩ් හැඩලී, කේන්ස්, චැට්ෆීල්ඩ් සහ ෂීඩ් ඔහුට ටොරිඩ් එකක් තිබුණි\nකාලය ඔහුගේ ලකුණු එක් එක් ඉනිම වැඩිදියුණු කළද.ගූනසේකරගේ\nසැලකිය යුතු ජයග්රහණය පළමු ඉනිමේදී අල්ලා ගැනීමක් සිදු කළේය\nවෙලින්ටන්හි දෙවන ටෙස්ට් තරගයේදී, ශ්රී ලාංකිකයෙකු විසින් වාර්තාගත උත්සාහයක්\nපසුව හෂාන් තිලකරත්න විසින් දශකයකට පසුව සමාන වේ.වම් අත\nපිතිකරුවා එක් දින හමුවීමේදී වැඩි දියුණු කළ ලිපි මාලාවක් තිබුණි\nතේරීම්කරුවන්ට නොපසුබස්නා උත්සාහයක් දැරීමට ප්රමාණවත් නොවීය\nඔහුව.(ජොහාන් පී ජයසේකර, සැප්තැම්බර් 1999)",
    "Sridharan Jeganathan": "මියයෑමට පළමු ශ්රී ලාංකික ටෙස්ට් ක්රීඩකයා වන තුන් ඉරියව්කරු ශ්රීධරන් ජෙගරන්තාන් වයස අවුරුදු 44 වන මැයි 14 වන දින අභාවප්රාප්ත විය. 1982-83. ඔහුගේ බලාපොරොත්තු සුන්වීම ඔහුගේ ලකුණු 19 (4.75) අතර තනි ලකුණු ලකුණු හතරක් ඇතුළත් වූ අතර කඩුල්ලක් ගැනීමට ඔහු අසමත් විය. ටික වේලාවකට නොසලකා හරින ලද 1987 ඉන්දියාවේ සහ පාකිස්තානයේ ලෝක කුසලානය සඳහා බටහිර ඉන්දීය කොදෙව්හි රිචයි රිචඩ්සන් විසුරුවා හැරීම සඳහා ඔහුව සිහිපත් කර ඇති අතර, එක්සත් ජාතීන්ගේ සංවිධානයේ රිචරඩ් පරාජයට එංගලන්තය විසින් පරාජයට පත්විය. ඔහුගේ 45 කට ඔහුගේ 2 දෙනා එක්දින තරග පහක උපරිම පන්දු යැවූ අතර, ඔහු කඩුලු 5 (41.60) කඩුලු 5 ක් දවා ගනිමින් ලකුණු 25 ක් රැස් කළේය (8.33). ජුගනාදන් 1979 දී සමාරම්භක අයිසීසී කුසලානය දිනාගත් කණ්ඩායම සමඟ එංගලන්තය සමඟ සංචාරය කර ඇති අතර, නොටින්හැම්ෂයර්ට එරෙහිව ලකුණු 92 කට දැවී ගියේය. සියලුම පළමු වරට ක්රිකට් ක්රීඩාවේදී ඔහු කඩුලු 49 ක් (31.61) ක් ලබා ගත් අතර 13.66 කදී ලකුණු 437 ක් රැස් කළේය. 1982-83 සංචාරයේදී 74 හැවිරිදි ඔහුගේ වැඩිම ලකුණු ප්රමාණය 1982-83 සංචාරයේදී ඩෙවන්මේරියාවට එරෙහිව: ඔහු කඩුලු 8 කට ලකුණු 140 ක් රැස් කළේය. පසුව ඔහු මැලේසියාවේ ජාතික පුහුණුකරු බවට පත්විය.\nවිස්ඩන් ක්රිකට් ක්රීඩකයින්ගේ අල්මනැක්",
    "Vinothen John": "විනෝඩ් ජෝන් කෙටි නමුත් සාර්ථක ජාත්යන්තර වෘත්තියක් තිබුණි.ශක්තිමත් මාධ්ය වේග පන්දු යවන්නා වන ජෝන් 1982-83 දිනට ක්රයිස්ට්චර්ච් හි නවසීලන්තයට එරෙහිව සිය මංගල සංවිධානය ආරම්භ කළේය.දෙවන පරීක්ෂණයෙන් වසර 60 කට 5 කට 5 ක් පමණ උසින් 5 ක් ලබා ගත්හඔහුගේ අවසන් ටෙස්ට් තරගය වන එංගලන්ත තරගයේදී ඔහු සිය අවසන් ටෙස්ට් තරගය, මුළු හදවතින්ම රංගන පන්දු ලකුණු 39.1 කදී ලකුණු 98 ක් රැස් කරමින් කඩුලු 4 ක් දවා ගත්තේය.එක් දින ආකෘතියෙන් ඔහු සාධාරණ ලෙස පවත්වා ගෙන ගියත් ඔහුට සාර්ථකත්වයක් ලැබුණි\nආර්ථික අනුපාතය.\nජොහාන් ජයසේකර",
    "Rumesh Ratnayake": "Wiry Ratnay විසින් යෞවනයා ලෙස සිය දිදුලයි\nවේගයෙන් උත්පාදනය කිරීමට සහ ඔහුගේ කසිගල්ලේ ක්රියාව සමඟ වේගයෙන් ගමන් කිරීමේ හැකියාව.\nඅසූව දශකයේ අග භාගයේදී රත්නායක ස්ථාවර රංගන ශිල්පියෙකි\nඅනතුරුව පිතිකරුවාට පැද්දීම සඳහා පිතිකරු කරදරකාරී කරදරය\nනව පන්දුව සජීවී වේගයකින්.කෙසේ වෙතත්, තුවාල හේතුවෙන් ඔහු විය\nඔහු පෙන්වූ නමුත් ඔහුගේ හැකියාවන් සැබවින්ම ඉටු කිරීමට කිසි විටෙකත් නොහැකි විය\nටෙස්ට් ක්රිකට් වෙත ආපසු යාමට අධිෂ් mination ානය ඔහු කිසි විටෙකත් එසේ නොවීය\nඑකම පන්දු යවන්නා ඔහුගේ තරුණ කාලයේ මෙන්.එසේ වුවද ඔහු දඩයක් විය\nටෙස්ට් පන්දු යවන්නා සහ වඩා හොඳ වේග පන්දු යවන්නන්ගෙන් එකක්\nදූපත් ජාතිය.පහළ පෙළේ රත්නායකගේ දක්ෂ පහරක්\nපිතිහරඹයේ හාඩ් ඉනිමක් සමඟ සෙල්ලම් කළා.ක්රයිස්ට්චර්ච් හි නවසීලන්තයට එරෙහිව ඔහු මංගලත කිරීම ඔහු සෑදුවේය\nනව පන්දුව නව පන්දුව ලබා දෙන ක්ෂණික හැඟීම KIWI විසින් සපයනු ලැබේ\nසමහර අමුතු අවස්ථාවන් සහිත පිතිකරුවා.1985/86 තරගයේදී\nඉන්දියාව ඔහු පැමිණියේ වයස් පන්දු යැවීමකදී කඩුලු 20 ක් අල්ලා ගැනීමටය\n22. එස්එස්සී හි දී ඔහු තිරසාර වේගයකින් හා ශක්තියෙන් පන්දු යැවීය\n6/85 සිට පන්දුවාර 41 කි.ශ්රී ලංකාවේ පුළුල් ජයග්රහණයක\nදෙවන ටෙස්ට් රත්නායක කඩුලු 9 ක් දවා ගැනීමේ ප්රධාන සාධකයකි\nතරගය.වන අශාන්ත ද මෙල් සහ සාලියා අහන්ගම සමඟ වේගය\nශ්රී ලංකාවට ශ්රී ලංකාවට නායකත්වය දෙන ඉන්දීය පිතිකරුට තිදෙනෙකුට වධ හිංසා කළේය\nසමාරම්භක මාලාව ජයග්රහණය.නිග්ලිං තුවාල සෑම විටම ඔහුගේ වෘත්තියට අංගමාරයකි\nසාමාන්යයෙන් ප්රතිචාර නොදක්වන කොන්දේසිවලදී මනරම් ලෙස වෙහෙස මහන්සි වී වැඩ කිරීම.ඔහුගේ කාලයේ\n1990/91 සංචාරයේදී ඔහු ගුණාත්මක වේග වේග පන්දු යවන්නා ලෙස පැවතුනි\nඕස්ට්රේලියාව ඔහු වේගයෙන් පැද්දීමේ පන්දු යැවීමේ කැපී පෙනෙන ප්රදර්ශනයක් ඉදිරිපත් කළේය\n6/66 අල්ලා ගැනීමෙන් හොබාර්ට්හිදී ඔහුගේ එකම පරීක්ෂණය.ස්වාමිවරුන් ඔහු තවත් එකක් දුන්නා\nComprifyed සංදර්ශනයක් 5/69, ඔහුගේ වේගය සහ පැද්දීම ඇති කරයි\nඉංග්රීසි වවුලන් ඉමහත් කරදරයක්.පිතිහරඹය සමඟ ඔහු බේරා ගත්තේය\nදීප්තිමත් අර්ධ ශතකයක් සහිත කණ්ඩායම.බොහෝ විට ඔහුගේ\nරංගනයන් ශ්රී ලංකාව ලෙස දුර්වල පිතිකරණය සමඟ බාධාවක් විය\nසාමාන්යයෙන් වාසිය නිවසට බලපෑම් කිරීම සඳහා සාමාන්යයෙන් නාස්ති වූ අවස්ථා\nරත්නායක සාක්ෂාත් කර ගැනීමට උදව් කර තිබුණි.තුවාල ඔහුගේ කාර්යක්ෂමතාව සීමා කළේය\nපාකිස්තානයේ පැවති මාලාවේ සහ එය ඔහුගේ අවසාන පරීක්ෂණය බව ඔප්පු විය\nමාලාවක්.(ජොහාන් පී ජයසේකර, සැප්තැම්බර් 1999)",
    "Mithra Wettimuny": "මිතිතු තෙත්මුනිගේ ක්රිකට් දිවිය - පළමු පන්තියේ පෙනී සිටම ඔහුගේ පළමු පන්තියේ පෙනී සිටීම නවයෙන් යුක්ත වූ අතර එය 2008 ට වඩා 1982-833 දී මාස හතරකට වැඩි කාලයක් ගත විය.බිහිසුණු දකුණු පසෙන් යුත් පිතිකරුවා වන ඔහු සිය පළමු පන්තියේ පංතියෙන් පනස් දෙනෙකු ලකුණු පනහක් ලබා ගත් නමුත් ඔහුගේ ඉතිරි ඕනෑම දුරක් තුළ එසේ කිරීමට අපොහොසත් විය.එසේ තිබියදීත්, නවසීලන්ත සංචාරය කිරීමට ඔහු තෝරා ගනු ලැබූ ඔහු, ඉනිම හතරකින් ඔහු ලකුණු 28 ක් රැස් කළ එම සංචාරය පිළිබඳ ටෙස්ට් අභිලාෂයන් දෙදෙනා ලකුණු 28 ක් රැස් කළේය.ඔවුන් ඔහුගේ අවසාන පළමු පන්තියේ තරඟ විය.මෙම ක්රීඩා වල පළමු අවස්ථාවේ දී ඔහු ඉනිම ඔහුගේ බාල සොහොයුරා වන සිද්ත් සමඟ ඉනිම විවෘත කළේය - සහෝදරවරුන්ගේ තුන්වන අවස්ථාව පමණි.ඔවුන්ගේ වැඩිමහල් සහෝදරයා වන සුනිල් ටෙස්ට් තත්ත්වය ලබා ගැනීමට පෙර ශ්රී ලංකාව වෙනුවෙන් ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කළේය\nමාටින් විලස්සන්",
    "Amal Silva": "අමල් සිල්වා ශ්රී ලාංකිකයා සමඟ තම කාලයේ වැදගත් භූමිකාවන් දෙකක් පිරවීය\nකණ්ඩායම සහ ඔහු ශෛලියෙන් අදහස් කළේ අවසානයේදී බර නිසාය\nඑක් ක්රීඩකයෙකුට මුහුණ දීමට ඕනෑවට වඩා.සිල්වා, දක්ෂිණ අත\nපිතිකරු සහ දක්ෂ කඩුලු රකින්නාට විවෘත කිරීම පිරිනමනදී ඉල්ලා සිටියේය\nතනතුර ඔහුගේ භූමිකාව සමඟ කඩුලු රකින්නා ලෙස සංයුක්ත වේ.වවුලන් සමඟ\nනව පන්දුව ආරක්ෂා කිරීමට සහ පහර දුන් බව සිල්වාට හැකියාවක් තිබුණි\nතත්වය අවශ්ය වූ විට ආ ro ාත.කඩුල්ල පිටුපස ඔහු විය\nඔහුගේ මලල ක්රීඩා භාවිතා කළ හැකි වේග පන්දු යවන්නාට එරෙහිව තවත් පහසුවෙන්ම පහසු වේ\nතෑගි.නවසීලන්ත සිල්වාට එරෙහිව ඔහුගේ මලපීම ලකුණු 8 ක් රැස් කළේය\nසහ 0, පන්දුවට පහර දීම - අත්වැසුම් සමඟ\nඔහු පතුල් 2 ක් එල්ල කළා. ගයි ද අල්විස් තිදෙනා තුළ වඩාත් කැමති විය\nපහත දැක්වෙන සංචාරයේදී නවසීලන්තයට එරෙහිව පරීක්ෂණ. සිල්වාගේ සටන\nඅංක එකේ ග්ලෝවෙයිමන් ලෙස තනතුර පවත්වා ගැනීම සඳහා ද අල්විස් සමඟ\nඔහුගේ මුල් දිවිය පුරා නියතයක්. ද අල්විස්ට තුවාල වීම\n1984 එංගලන්තයේ සංචාරය සිල්වා ඔහුගේ දෙවන තොප්පිය ලබා දුන් අතර ඔහු එය ගත්තේය\nAPLOMB සමඟ අවස්ථාව. සිල්වා පිතිකරණය විවෘත කළේය\nදෙවන ඉනිමේදී ලකුණු 102 ක් ලබා දී ඇති බවට සහතික විය\nකඩුල්ල පිටුපස ඇල්ලීම් තුනක්. සිල්වාට විශිෂ්ට වටයක් තිබුණි\nපිතිකරුවා සමඟ සංචාරය කරන්න, එය ඇතුළට පැමිණිය යුතු දේවල ලකුණක් විය\nඉන්දියාවට එරෙහි ටෙස්ට් තරගාවලියෙන් පසුව. එස්එස්සී හි පළමු ටෙස්ට් තරගයේදී ඔහු\nශ්රී ලංකාව පරීක්ෂණයෙන් ඇදී යත්, ඇල්ලීම් 9 ක් ලබා ගත්තා. දෙවැන්නෙහි ඔහුට අ\nසංවේදී සමස්ත වටයේ තරගය, 111 ලකුණු කිරීම, අල්ලා ගැනීම 8 ක් සහ\n1 කඹය කිරීම, සිල්වා ශ්රී ලංකාවේ ප්රධාන ක්රීඩකයෙකි\nසමාරම්භක පරීක්ෂණ තරගය ජයග්රහණය. සෑම සිල්වාම 22 ක් අල්ලා ගත්තේය\nසේවයෙන් පහ කිරීම, පන්දු 21 ක් සහ 1 ක් දිගින් දිගටම, තවමත් ශ්රී සඳහා වාර්තාවක්\nලංකා පාලකයා අද දක්වා මාලාවක.මෙයින් පසුව\nපෙර නොවූ විරූ කාර්ය සාධනය සිල්වාගේ වෘත්තිය පහත වැටුණි\nනව දේ සමඟ සටන් කිරීමේ වගකීම සමඟ කටයුතු කිරීමට ඔහු මහත් විය\nබෝල සහ පසුව කඩුලු ලෙස ජාත්යන්තර ප්රමිතියකට තබා ගැනීම.පසු\nපාකිස්තානයට එරෙහිව 1985/86 මාලාව තේරීම් කමිටු කැමති විය\nවෙනත් විකල්ප.සිල්වා ඊට එරෙහිව එක් පසුබෑමකට නැවත පැමිණියේය\n1988 දී එංගලන්තය නමුත් කෙටි කාලීන බව ඔප්පු විය.(ජොහාන් පී ජයසේකර, සැප්තැම්බර් 1999)",
    "Roshan Guneratne": "1982-83 දින මහනුවරදී පැවති ටෙස්ට් තරගයට පෙරළෙන පරිදි ජනාධිපති XI මණ්ඩලයට ක්රීඩා කරන සංචාරක ඕස්ට්රේලියානුවන්ට එරෙහිව සංචාරක ඕස්ට්රේලියානුවන්ට එරෙහිව සංචාරක ඕස්ට්රේලියානුවන්ට එරෙහිව ප්රේෂාන් ගුණරත්න සිය පළමු පන්තිය ආරම්භ කළේය.ගුණරත්න මහතා කෙප්ලර් වෙසල් කඩුලු 2 ක් දවා ගත් අතර ග්රෙග් චැපල් ලකුණු 66 කට 2 ක් ලබා ගත්තේය. මීට පෙර ඩී.එස්.ඕස්ට්රේලියානුවන් 4 දෙනෙකු සඳහා 514 ක් ලෙස ප්රකාශයට පත්කිරීමට පෙර එය අවාසනාවන්ත කාලය බව ඔප්පු විය.මෙම ගෘහස්ථ ක්රිකට් ක්රීඩාවේ මුවර්ස්, මුවර්ස්, මුවර්ස්, මුවර්ස්, මුවර්ස්, ඇමරිකා එක්සත් ජනපදය සහ සහෝදරිය සමඟ එක්වීමට පෙර කොල්ලකෑමට පෙර මුවර්ස්, මුවර්ස්, මුවර්ස් සහ නාමිකයන්.ඔහු වයස අවුරුදු 43 දී කැලිෆෝනියාවේ මිය ගියේය.\n\nජොහාන් පී ජයසේකරවිස්ඩන් ක්රිකට් ක්රීඩකයින්ගේ අල්මනැක් අවමංගල්යය2005 ජූලි 21 වන දින කැලිෆෝනියාවේ හෘදයාබාධයක් හේතුවෙන් ගුණනියජිත් විජේසිංහගේ හෘදයාබාධයකින් මිය ගියේය.ඔහු කොළඹ නාලන්දා විද්යාලයෙන් පිටත්ව ගොස් ඇත්තේ ඔහුගේ දෙවන පන්තියේ තරගය පමණි.කෙප්ලර් වෙසල්ස් සහ ග්රෙග් චැපල් 1983 අප්රියෙල් සමයේදී සිය පළමු පන්තියේ ආරම්භය සඳහා චැපල්, සංචාරයේ ඇති එකම පරීක්ෂණය සඳහා තෝරා ගන්නා ලද නමුත් කඩුල්ලක් ගැනීමට හෝ ඉනිමක පරාජයකින් ලකුණු ලබා ගැනීමට අසමත් විය.තරඟ 13 පළමු පන්තියේ වෘත්තියක කඩුලු 17 කට පසු ඔහු එක්සත් ජනපදයේ තම පවුලේ අය සමඟ එක්වීමට පිටත්ව ගියේය.ඔහු බටහිර ඉන්දීය කොදෙව් පිලට එරෙහිව මහනුවර ටෙස්ට් තරගයේ පළමු දිනයේදී ශ්රී ලංකාවේ ශ්රී ලාංකික ටෙස්ට් ක්රිකට් ක්රීඩකයෙක් වූ තුන්වන ශ්රී ලාංකික ටෙස්ට් ක්රිකට් ක්රීඩිකාව වන අතර වත්මන් කණ්ඩායම ඔහුගේ මතකයේ කළු ආම්බන්ඩ්ස් පැළඳ සිටියහ.",
    "Jayantha Amerasinghe": "සිම්බාබ්වේට එරෙහිව ශ්රී ලාංකික මණ්ඩලයක් සඳහා XI පන්තියක් ක්රීඩා කරමින් ඔහුගේ පළමු පන්තියේ එක්වීමේදී, 130 සඳහා ග්රහණය කරගත් එක් එක් ශ්රී ලාංකික ක්රීඩකයින් මෙන් ශ්රී ලාංකික ක්රීඩකයින් ද ටෙස්ට් කණ්ඩායමට පිවිසෙමින් සිටි අතර, සංචාරය කිරීමට එරෙහිව මහනුවරට මද විවාදයට පත්විය1983/84 දී සීලන්ඩ් කණ්ඩායම.අමරසිංහ පුණ්යාධාර මුඛය ලබා ගත්තේය.ශ්රී ලංකාව සමඟ කඩුල්ලට පැමිණි 155 කට ලකුණු 155 ක් වූ ඔහු ශ්රී ලංකාව වෙනුවෙන් විනෝඩ් ජෝන් සමඟ ලකුණු 60 ක් එක් කිරීමට කටයුතු කළේය.34 සමඟ අමරසිංහ ලකුණු 34 ක් රැස් කළේය. කෙසේ වෙතත්, ඔහුගේ වම් අත ඕතඩොක්ස් භ්රමණය දැඩි ලෙස භාවිතා කළ අතර, ඔහු මුළු පරීක්ෂණයෙන් පන්දුව 20 ක් පමණක් පන්දු යැවීය.අමරසිංහ මහතා පසුගියදා කොළඹදී පහත දැක්වෙන ටෙස්ට් තරගයේදී ක්රීඩා කළ අතර ඔහුගේ අවසාන පෙනුම, පිළිවෙලට ඕවර 30 කදී 73 කට ලකුණු 73 කට දැවී ගියේය.\nජොහාන් ජයසේකර",
    "Sanath Kaluperuma": "දකුණු අත ඉහළට පෙළෙන පිතිකරුවෙකු සහ හස්තය බැහැර පන්දු යවන්නා\nකලුගුමා සිය කෙටි අවස්ථාවෙහි හැඩගැසීමට අරගල කළේය\nජාත්යන්තර මට්ටම.ශ්රී ලංකාව යන කාල පරිච්ඡේදයක් තුළ ලේ වැගිරීම\nහැකියාවන් සහ අධිෂ් with ානය සමඟ ක්රීඩකයන් සොයමින් සිටියේය\nවයස අවුරුදු 23 ට අඩු කලුපෙරුමාගේ ස්වරූපය ඉහළම මට්ටමේ සාර්ථක වන්න\nපැත්තෙන් ඔහුව තේරීම් කමිටුගේ අවධානයට යොමු කළේය.ඔහුව සෑදීම\nනවසීලන්ත පිතිකරණයට එරෙහිව මිදී ඔහු ලකුණු තුනක පිතිකරණයට එරෙහිව ආරම්භ කළේය\n2/17 ක් අල්ලා ගත්තද, පිතිකරුවා සමඟ හැඟීමක් ඇති කරන්න\nඔහුගේ දඟ පන්දු යවන්නන්.මාලාවේ පරීක්ෂණ තුනම වාදනය කරමින් ඔහු\nඔහුගේ ඉනිම හයේ 30 ක් සමත් වීමට අපොහොසත් වූ අතර ඔහු අතහැර දැමීය.උපයා ගැනීම a\nඔහුගේ පෙර අවස්ථාව වසර හතරකට පමණ පසු මතක තබා ගන්න\nපර්ත්හිදී ඕස්ට්රේලියාවට එරෙහි එක් අත්හදා බැලීමේ පරීක්ෂණයක්, කලුපෙරුමා දුක් වින්දේ\nටොරිඩ් කාලය සහ එය ඔහුගේ අවසාන පරීක්ෂණය බව ඔප්පු විය.(ජොහාන් ජයසේකර, සැප්තැම්බර් 1999)",
    "Aravinda de Silva": "ක්රීඩාවේ හොඳම විනෝදාස්වාදකයින්ගෙන් එකක් වන ද සිල්වා උසම කෙටි ලකුණු ලාභීන් බොහෝ දෙනෙකුගේ ශක්තීන් සිල්වා ඇත: නොපැහැදිලි හා සම්බන්ධ වීම, කප්පාදු කිරීම හා සම්බන්ධ වීම, පසුතැවිලි නොවූ ප්රහාරකයෙක්.ලෝක කුසලාන අවසන් මහා තරගාවලියේදී ජයග්රාහී ශතවර්ෂයකු සමඟ ඔහුගේ වාර්තාව රටවැසියන් අතර ඇති වූ වාර්තාව අසනීප වේ.ඔහු 5 1/1 / 2in සිටගෙන සිටින අතර වඩා හොඳ කුඩා ක්රීඩකයෙකු නොමැති බව තර්ක කළේය.ඔහුගේ උද්යෝගය පුදුමාකාරයි: ඔහු ශ්රී ලංකා පැත්තේ මෙතෙක් මෙතෙක් සිටි අථත්යයක් වූ අතර එංගලන්තයේ සහ ඕස්ට්රේලියාවේ පළමු පන්තියේ හා සමාජීය ක්රිකට් ක්රීඩා කළේය.ඔහුගේ ජාත්යන්තර ජීවිතය 2003 ලෝක කුසලානය සමඟින් අවසන් වූ අතර, එහිදී ඔහු සියලු දුකෙන් හා පැරණි අරුචි සමඟ පන්දුවට පහර දුන් අතර ඔහුගේ පුපුරා ගියන් කැටයම් කළේය.ශ්රී ලංකාවේ ක්රිකට් බලධාරීන් සිය ක්රිකට් අත්දැකීම්වල ධනය නාස්ති වී ජාතික තේරීම් කමිටුවක් පත් නොකරන බව සහතික විය.ඔහුගේ අනෙක් ප්රධාන අවශ්යතා කේක් සහ කාර් (සාමාන්යයෙන් වේගවත් ඒවා) ය.සයිමන් වල්",
    "Saliya Ahangama": "ෆ්රැන්ක්ලින් සාලියා අහංගම ශ්රී ලාංකික ටෙස්ට් පාර්ශවයට උල්කාපාත ඉහළ ගියේය.1985-86 දී ශ්රී ලාංකික කෝල්ට් සඳහා ඔහුගේ පළමු පන්තියේ ආරම්භය වූ පසු සති දෙකකට පසු සති දෙකකට පසු ඉන්දියාව සෙල්ලම් කිරීම සඳහා ටෙස්ට් පාරට තල්ලු කර තිබේ.ඔහුට අ\nලකුණු 5 කට කඩුලු 1 ට වඩා 599 ට ගුරුත්වාකර්ෂණ විශ්ලේෂණයක් කරමින් මොහොමඩ් අෂාදර්ඩින් කඩුලු ලබා ගනිමින් ටෙස්ට් ක්රිකට් ක්රීඩාවට ජයග්රාහී ලෙස පිවිසෙන්න.19.33 දී කඩුලු.ශ්රී ලංකාවේ ටෙස්ට් ක්රිකට් සහ තුවාල නොමැති වීම\n1988 සහ 1991 දී එංගලන්තය සංචාරය කළත් ඔහු කිසි විටෙකත් වෙනත් පරීක්ෂණයක් කර නැත.ඔහු පසුව රූපවාහිනී විචාරකයෙකු ලෙස විකාශනය කරා ගෙන ගියේය.",
    "Asoka de Silva": "1985-1992 සිට ජාත්යන්තර ක්රිකට් දිවියක් අනුගමනය කරමින් ඔහු ටෙස්ට් තරග 10 කදී ඔහුගේ රට නියෝජනය කළ අතර, දකුණු අත දඟ පන්දු යවන්නා වන අශෝක ද සිල්වා ඉක්මනින් ශ්රී ලංකාවේ ශ්රී ලංකාවේ ශ්රී ලංකාවේ ඉස්මතු විය.1996/97 ද සිල්වා පළමු පන්තියේ ක්රිකට් ක්රීඩාවෙන් විශ්රාම ගත් පසු, ඔහුගේ අවධානය විනිසුරුවරුන් බවට පත් කිරීමට පෙර පූර්ණ සුදුසුකම් සහිත පුහුණුකරුවෙකු බවට පත්විය.ඔහු සිය ජාත්යන්තර තරඟාවලිය 1999/00 දී පාකිස්තානයට එරෙහිව ගාල් වෙත ගෙන ගොස් 2004 මුල් භාගයේදී පාකිස්තානයට එරෙහිව ගාල්ලේ ප්රභූ විනිසුරු මණ්ඩලයේ සිටියේය. කෙසේ වෙතත්, අයිසීසී ජාත්යන්තර විනිසුරු මණ්ඩලයේ සාමාජිකයෙකු වන අතර ඒවා බොහෝ විට පත් කරනු ලැබේජාත්යන්තර ක්රිකට් සමයේ කාර්යබහුල කාලවලදී ප්රභූ මණ්ඩලයට සහාය වීම.2003 සහ 2007 දී ක්රිකට් ලෝක කුසලාන දෙකක දී විනිසුරු කර ඇත. සාඩි තව තාව්ෆීක් 2008 පෙබරවාරි",
    "Sanjeewa Weerasinghe": "1985 දී ශ්රී ලංකාව පාසල් සිසුවෙකු ලෙස ශ්රී ලංකාව නියෝජනය කිරීම සඳහා සංජීවා වීරසිංහ තෝරා ගන්නා ලදී.ඩී.එස්. ද සිල්වාට අනුප්රාප්තිකයෙකු ලෙස ලෙපිපිනර්, වීරසිංහ සැලකුවේය.ඔහුගේ මංගලික ශ්රී ලංකාව ඉන්දියාවට පහර දුන් අතර, වීරසිංහ අරපිරිමැස්මෙන් භාවිතා කළද, ඔහු කඩුල්ලක් නොගෙන දුරු විය.පසුව පාකිස්තානයේ පසුකාලීන සංචාරයක් තිබියදීත් එය වීරසිංහගේ එකම පරීක්ෂණය බව ඔප්පු විය.ඉන්පසු ඔහු 30 ක් වීමට පෙර ඔහු කලාතුරකින් දීප්තිමත් වූ අතර ඔහුගේ වෘත්තිය අවසන් විය.\n\nජොහාන් පී ජයසේකර",
    "Roshan Jurangpathy": "ඔහුගේ මංගල උත්සවය වන ජුරංපාති ශ්රී ලංකාව නියෝජනය කළ සිව්වන ලාබාලතම ක්රීඩකයා විය. අතිශයින්ම දක්ෂතා දැක්වූ තුන් ඉරියව් ක්රීඩකයෙක්, තේරීම් කමිටු විසින් අත්හදා බැලීම් දෙකක් පමණක් ඔහු විසින් ඉවතලන සුළු හෝ ඇදහිල්ලක් පෙන්නුම් කරයි. ඔහුගේ රංගනයන් පිළිගත හැකි බව පිළිගත යුතුය\nසමයට වඩා පහළින්, නමුත් ඔහුගේ වයස, යම් මග පෙන්වීමක් හා කාලය සලකා බැලීමේදී ඔහුට ජාත්යන්තර පන්තියේ තුන් ඉරියව් ක්රීඩකයෙකු ලෙස වර්ධනය විය. පාකිස්තානයට එරෙහි වයස අවුරුදු 23 න් පහළ පැත්ත කැපී පෙනෙන කාර්ය සාධනයක් සමඟ ජරංපාති ප්රමුඛත්වයට වෙඩි තැබීය. පළමු පන්තිය සියයක් ලකුණු ලබා ගනිමින් අවුරුදු 17 ක් සහ දින 342 ක් වූ ඔහු ශ්රී ලාංකික ක්රීඩකයා බවට පත්විය. ඔහු සංක්රාන්තිය සොයා ගත්තේය\nක්රිකට් ක්රීඩකයාට දුෂ්කර එකක් පරීක්ෂා කිරීම සඳහා පාසල් සිසුවිය. ටෙස්ට් ඉනිම හතරකින් ඔහු තාරාවන් තුනක් සහ තනි තුනක් ලබා ගත් අතර, ඔහු සිය මංගල උත්සවය මත පැටවූයේ ඕවර 4 ක් පමණි. ඔහුගේ දෙවන හා අවසාන පෙනුම තුළ ඔහු ඕවර 21 කදී ලකුණු 69 කට ලකුණු 69 කට කඩුලු 2 ක් ද ඔහුගේ ඕවර්ස්ටයින් සමඟ අල්ලා ගත්තේය. තේරීම් කමිටුව විසින් ඉවතලන ලද අතර ඉන් පසුව ඔහු බටහිර ඕස්ට්රේලියාවේ ක්රිකට් ක්රීඩා කරමින් ක්රිකට් ක්රීඩා කළේය.\nජොහාන් ජයසේකර",
    "Asanka Gurusinha": "බුද්ධිමත් දළ විශ්ලේෂණය තාක්ෂණිකව ඉටු කරන ලද අංක 3, අසංක ගුරුසිංහ මහතා වසර 11 ක් තිස්සේ ශ්රී ලංකා පිතිකරණය ආරම්භ කළ පර්වතයයි.ඔහුගේ කට්සි හුදකලා හුදකලා සටන් ලොව පුරා විරුද්ධවාදීන්ගේ ගෞරවය දැක්වීය: 1990-91 දී චන්දිගාර්හි ශ්රී ලාංකික 82 ක් නොදැවී ගුරුසුනි අර්ධ ශතවර්ෂයක් අඩංගු විය.1995-96 දී මෙල්බර්න්හිදී ඔහු 143 හැවිරිදි ඔහුගේ කණ්ඩායමේ සහකරුවන්ගේ ලකුණු 144 ක් රැස් කළේය.අරවින්ද ද සිල්වාගේ උදව්වෙන් ඔහු 1996 ලෝක කුසලාන අවසන් මහා තරගයේදී තවත් අඩ සියවසක් සමඟ ඕස්ට්රේලියාවට මේස තැබීය.ඔහු කඩුලු රකි පාලකයෙකු ලෙස යෞවනයෙකු ලෙස ටෙස්ට් ක්රිකට් ආරම්භ කළ නමුත් ලෝක කුසලාන භෝජන සංග්රහයක් ලෙස, දැන් ඔහු ජීවත් වන ක්ලබ් ක්රිකට් කන්නයේ කන්නයේ පුහුණුව සඳහා ආපසු ගෙවීම ප්රතික්ෂේප කිරීමෙන් පසුව විශ්රාම ගියේය.ඔහුට නරක අතට හැරුණා.සයිමන් වල්",
    "Jayananda Warnaweera": "ඔහුගේ සීමිත ටෙස්ට් ජීවිතයේ දී වෝර්නවීර to ලදායී පන්දු යවන්නෙකි.අ\nඕෆ්ස්ටයින්නර්, වෝර්නවීර පන්දුව ඉක්මන් වේගයකින් පන්දුවයි\nඔහුගේ ක්රියාවෙහි නීත්යානුකූලභාවය පිළිබඳ ප්රශ්න අවසානයේදී ඔහුව දුටුවේය\nජාත්යන්තර තලයේ සඳහන් කර ඇත.ඔහු ඔහුගේ පරීක්ෂණවලින් බහුතරයක් වාදනය කළ නිවාස තත්වයන් යටතේ\nඔහු භයානක ගනුදෙනුකරුවෙකි.පිළිතුරට එරෙහිව පොරොන්දු මාලාවක්\nඑංගලන්තය කණ්ඩායමක් විසින් වෝර්නවීර තම ටෙස්ට් තරගය ආරම්භ කරන බව දුටුවේය\nපාකිස්තානය 1986 දී. අරපිරිමැස්මෙන් 1/26 රූපයක් තිබුණි\nපන්දු යැවීම ඕවර 8.3 ක් පමණක් වන අතර ඔහු වෙනුවෙන් 1990 නොවැම්බර් දක්වා බලා සිටීමට සිදුවිය\nඉන්දියාවට එරෙහි ඕෆ් ටෙස්ට් තරගයේ දෙවන අවස්ථාව, 3/90 සිට\nපිළිවෙලට ඇති ඕවර 46 ක්.පහත දැක්වෙන නව සංචාරයේදී ඔහු කඩුලු රහිතව ගියේය\nමාලාවේ ඔහුගේ එකම පරීක්ෂණය ලෙස වෙලින්ටන්.\n1992/93 දී නවසීලන්තයට එරෙහිව සිහිපත් වේ.එස්එස්සී හි ඔහු 4/25 ක් ලෙස ගත්තේය\nශ්රී ලංකාව නවසීලන්තය නවසීලන්තය විසිනි, පසුව පරීක්ෂණය ජයගෙන ඒ නිසා\nශ්රේණි 1-0.ඒ හා සමාන භූමියක වෝර්නවීර දායක විය\nඑංගලන්තය අල්ලා ගත්තන්ට එරෙහිව සිය පළමු ජයග්රහණයට ශ්රී ලංකාවට උදව් කිරීම\nතරගයේදී ඕවර 65.1 සිට 8/188.ඔහු ඉන්දියානු පිතිකරුවාට එරෙහිව\nටෙස්ට් තරග 3 කදී කඩුලු 6 ක් දවා ගැනීම අඩුයි.ඔහුගේ ක්රීඩා වෘත්තිය අවසන් වීමෙන් පසු වෝර්නවීර බවට පත්විය\nගාල්ල ක්රීඩාංගනය සැකසීමට සම්බන්ධ වේ.ඔහුගේ එකක්\nභූමිය දෙවන පරීක්ෂණයට සත්කාර කරන විට ආඩම්බර අවස්ථාව\nශ්රී ලංකාවට එරෙහිව සහ නවසීලන්තයට සාපේක්ෂව එහි ආරම්භක ජාත්යන්තරය\nසවිකිරීම.(ජොහාන් පී ජයසේකර, සැප්තැම්බර් 1999)",
    "Don Anurasiri": "ස්ථාවර වම් පසින් ඕතඩොක්ස් දඟ පන්දු යවන්නෙකු වන දොන් අනුරසිරි ස්ථිතික ජාත්යන්තර වෘත්තියක් තිබුණි. ඔහුගේ ජාත්යන්තර තරගය වයස අවුරුදු 20 දී ඔහුගේ ජාත්යන්තර තරගය කළ පසු, ඔහු ස්ථිර තනතුරක් සිමෙන්ති සිමෙන්ති අතුගා දැමීම asons තු ගණනක් asons තු සඳහා කණ්ඩායමේ මායිම වටා සිටියේය. ටෙස්ට් මට්ටමින් ඔහු මුළු හදින්ම රංගන ශිල්පියෙකු ලෙස හැඳින්වූ විට ඔහුගේ පන්දු යැවීම ටෙස්ට් තරග 18 කදී ඔහු කිසි විටෙකත් කඩුලු 5 තොගයක් නොගත් බව අවධාරණය කළේය. තිරසාර නිවැරදි පන්දු යැවීම, පියාසර කිරීමට කැමැත්ත සහ පන්දුව හැරවීමට කැමැත්තෙන් සිටින, පන්දුව හැරවීමට කැමැත්තෙන් සිටින බව අනුරසිරි ප්රතිචාර නොදැක්වීම සඳහා බොහෝ විට භාවිතා කරන ලදී. සංචාරක ඕස්ට්රේලියානුවන්ට එරෙහිව ඔහුගේ වඩාත්ම සාර්ථක තරගාවලියේදී කඩුලු 10 ක් දවා ගත්තේය. 1994 දී ඔහු ශ්රී ලංකා මණ්ඩලයේ ශ්රී ලංකා මණ්ඩලයට පැමිණි අනුරසිරිගේ වෘත්තිය වසර හතරකට පසුව 1997-98 දින අවසන් ටෙස්ට් තරගයේදී සිම්බාබ්වේට එරෙහිව පුදුමයක් ඇති කළේය. පන්දුව පන්දුව පන්දුව පන්දුවට පහර දීමෙන් පරාජිත මුරලිදරන් සඳහා ස්ථිර තීරුවක් ලබා දුන් අතර, 45 සහ 1 සඳහා ලකුණු 45 ක් සහ 41 ක් සඳහා ලකුණු ලබා ගත් අතර, එම ක්රියාවලියේදී ශ්රී ලංකාවට ජයග්රහණය කිරීමට උපකාරී විය. නමුත් ඔහු ක්රීඩා කළේ තවත් පළමු පන්තියේ ක්රීඩා තුනක් පමණි. ඔහුගේ අවසාන පරීක්ෂණ පෙනුමෙන් සති හයක් ඇතුළත ඔහුගේ වෘත්තිය අවසන් විය. ජයාන් ජයසේකර",
    "Kosala Kuruppuarachchi": "කසාල කුරුප්පුආරච්චිගේ මංගල දර්ශනය මත විචාරකයින් සහ පිතිකරු යන දෙදෙනාටම දුෂ්කර යෝජනාවක් සනාථ කළේය.වම් අත මධ්යම වේග පන්දු යවන පන්දු යවන පන්දු යවන්නා කුරුප්පුආරච්චි ටෙස්ට් පිටියේදී සිහින හැඳින්වීමක් විය.පළමු ඉනිමේදී ඔහු පාකිස්තාන පිතිකරණ පෙළගැස්ම ලෙස ලකුණු 5 කට කඩුලු 5 කට දැවී ගියේය.දෙවන ඉනිමේදී ඔහු රවී රත්නායක සඳහා අඛණ්ඩ සහයෝගය ලබා දුන්නේ තවත් කඩුලු 2 ක් දරයි.ටෙස්ට් ක්රිකට් ක්රීඩාවේ සහ කුරුප්පුආරච්චි යන ප්රදේශවල පාකිස්තානයට එරෙහිව පළමු ජයග්රහණය ශ්රී ලංකාව විසින් අත්කර ගත්හ.තුවාල හේතුවෙන් ඔහුට තරගාවලියේ අවසාන පරීක්ෂණය මග හැරීමට ඔහුට බල කළේය.කනගාටුවට කරුණක් නම් නවසීලන්තයේ අතහැර දමා ඇති ටෙස්ට් තරගාවලියේදී ඔහුගේ එකම පරීක්ෂණයයි.\nජොහාන් පී ජයසේකර",
    "Roshan Mahanama": "කුමාර් සංගක්කාර සහ මහේලා අභිබවා යන බැවින් 1997 දී ආර්. ජයවර්ධන 2006 දී. එම හවුල්කාරිත්වයට මහනාමකගේ දායකත්වය 225 ක් වූ අතර ඔහුගේ වෘත්තියේ වැඩිම ලකුණු සංඛ්යාව 225 කි. ඔහු 1996 ශ්රී ලංකාවේ ලෝක කුසලාන ජයග්රාහී පැත්තෙන් ප්රධාන සාමාජිකාවක් විය. 1999 ලෝක කුසලානයේදී ඔහුගේ කණ්ඩායමේ විනාශකාරී බවෙන් පසුව මහානාමා තරුණ දක්ෂතා මනාලයෙකි. නමුත් ක්රීඩකයන් ඔහුට වඩා වයසින් වැඩි වූ විට එය මහානාමාවට හා ප්රතිපත්තිමය හා ආත්ම ගෞරවය පිපිරීමේ කාරණයක් ලෙස ඔහු විශ්රාම යාමට තීරණය කළේය. මහනාමා තම චරිතාපදානය 'විශ්රාමික රිදවීම' අතහැර දැමූ විගස එය ඔහුගේ වෘත්තියේ යූපීවරුන් හා පහත් බිම්වල ගැඹුරින් සොයා බලයි. 2004 මැයි මාසයේදී 2004 මැයි මාසයේදී ඔහු අයිසීසී තරග තීරකවරයෙකු ලෙස රංජන් මදුගල්ල මහතා අනුගමනය කරන බව ඔහුගේ අතිශයින්ම මදුගල් අනුගමනය කළේය.\nසාඩි තව්ෆෙච්ෆෙෆෙරර් y 2008",
    "Kaushik Amalean": "1985-86 පාකිස්තානයට එරෙහි 1985-86 නිවාස මාලාවේ අවසන් ටෙස්ට් තරගයේදී විසි වසරක් ලෙස ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කිරීම සඳහා කෞෂික් අමලීන් තෝරා ගන්නා ලදී.එංගලන්ත බී කණ්ඩායමකට එරෙහි ආකර්ෂණීය සංදර්ශනයක් ඔහුගේ නම තේරීම් ජාලයට ගෙන ආහ.දකුණු-හස්තයේ වේගවත් මධ්යම පන්දු යවන්නාක්, ඔහුගේ ක්රියාව සමඟ ග්රහණය කර ගැනීම සඳහා තියුණු වේගයකින් පන්දු යැවීමට ඔහුට හැකියාව තිබුණි.මොෂින් ඛාන් සහ ජාවෙව් මියාන්ඩේඩ්ගේ කඩුලු 3 ක් දවා ගනිමින් 59 කට 39 කට 39 කට 69 කට වැඩි ප්රමාණයක් ලබා ගනිමින් ඔහු ඊට ප්රතිචාර දැක්වීය.එක් නොබැඳි ටෙස්ට් තරගයේදී පෙරත් හි ශ්රී ලංකාව තලා දැමූ 1987-88 ඕස්ට්රේලියානු සංචාරයේදී අමලියාගේ තවත් ටෙස්ට් තරගය අමලීන් 97 කට ගෞරවනීය 4 ක් ලබා ගත්හ.\nජොහාන් පී ජයසේකර",
    "Graeme Labrooy": "ගුණාත්මක පැද්දීමේ පන්දු යැවීමේ ප්රදර්ශනය කළ හැකි මධ්යම වේග පන්දු යවන්නෙකු, ග්රැමී ලේබ්රූයි රිචඩ් හැඩලී සිය පෙළ පොත් ක්රියාමාර්ගය සකස් කළේය. ලේබ්රියෝ රූමේෂ් රත්නායක සමඟ හොඳ නව බෝල හවුල්කාරිත්වයක් ඇති බව පෙනෙන්නට තිබුණත් ඔහුගේ පරීක්ෂණ වෘත්තිය කෙටියෙන් විය. වවුලන් සමඟ හැකියාව, ඔහුගේ කාලයේ ඔහුට පහර දෙන ආ ro ු සම්පීඩියක් නිපදවිය හැකි අතර එය බොහෝ විට විපක්ෂ කණ්ඩායම බිඳී ගියේය. ලැබ්රූයි ඉන්දියාවට එරෙහිව අවතා රංගනයක්, පිතිකරණයේ පිතිකරණයේ පිතිකරුවන් එක් මිල අධික කඩුල්ලක් බවට පත් කළ අතර පිතිකරුවන් ටෙස්ට් තරගයේ ආධිපත්යය දැරීය. එංගලන්තයට එරෙහි ලෝඩ්ස්හිදී ඔහු පන්දුව 4 කදී ලකුණු 42 ක් රැස් කරමින් ලකුණු 42 ක් රැස් කරමින් ලකුණු 42 ක් රැස් කළේය. ඔහුගේ දියුණුව ශ්රී ලංකාවේ වරින් වර පරීක්ෂණ කාලසටහනට අනුකූල විය. තම මව්බිමේ දේශපාලන ආතතිය හේතුවෙන් දීර් period කාලයක් පුරා ව්යාප්ත වූ පරීක්ෂණ නවයක්ම විදේශයන්හි සේවය කරන ලදී. ඕස්ට්රේලියානු සංචාරයේදී ඔහු\nගබ්බා හි ලකුණු 133 කට දැවී ගියේය. නවසීලන්තයේ සංචාරයේදී ඔහු ජාත්යන්තර මට්ටමින් ඔහුගේ පාද සොයා ගැනීම රූමේෂ් රත්නායක සමඟ නව පන්දුව ලබා ගත්තේය. පන්දුව සමඟ ඔහු කඩුලු 13 ක් දවා ගත්තේය. ඕක්ලන්ඩ් හි තෙවන ටෙස්ට් තරමේ අවාසනාවට ඔහුගේ අවසාන පරීක්ෂණයෙන් ඔහුට සුපිරි මංගරයක තරගයක් තිබුණි. පන්දුව සමඟ ඔහු ලකුණු 42 ක් සහ පිතිකරුවන් සමඟ ලකුණු 32 ක් සහ වවුල සමඟ 32 දෙනෙකුගෙන් 3 දෙනෙකු ග්රහණය කරගත් අතර පන්දු 80 කදී නොදැවී 70 කදී හතරේ පහර 14 ක් රැස් කළේය.\nජොහාන් පී ජයසේකර",
    "Brendon Kuruppu": "නවසීලන්තයට එරෙහිව, නවසීලන්තයට එරෙහිව, ඔහුගේ ටෙස්ට් තරගයට එරෙහිව, ඔහුගේ ටෙස්ට් තරගයේදී, ශ්රී ලංකා කඩුලු ුගිලකෙය්ස්-බ්රෙන්ඩන් කුරුප්පු මත ශ්රේෂ් ness ත්වය තදින් තල්ලු කළ නමුත් දිනක් හෝ දෙකක් පමණි..කුරුප්පු එයද අමාරුවේ දරුණා: ඔහුගේ මිනිත්තු 777 ඉනිම පළමු පන්තියේ ඉතිහාසයේ මන්දගාමී ද්විත්ව ඉතිහාසයේ මන්දගාමී වූ ද්විත්ව ඉතිහාසයේ, පසුව සියල්ලෝම එක්දින සටන් විද්යාගාරයක් ලෙස ඔහුගේ කීර්තියක් ඇති කළහ.එය ඔහුගේ පළමු පළමු පංතියේ ශතවර්ෂය වන අතර ඔහුගේ අවසන් වරට ටෙස්ට් සියවසේ: කුරුප්පු 1988 සහ 1991 දී එංගලන්තයේ ටෙස්ට් තරග හතරක්, ඔවුන්ගෙන් දෙදෙනෙකු වන පරීක්ෂණ හතරක් පමණි.\nරොබ් ස්මිත්",
    "Champaka Ramanayake": "රාමනායක යනු සුරක්ෂිත අධිෂ් with ානයක් සහිත කැමැත්තක් දක්වන රංගන ශිල්පියෙකි - ඔහු කිසි විටෙකත් ප්රශ්නය විසුරුවා හැරියේ නැත.ශ්රී ලංකාවට සැබෑ වේග පන්දු යැවීමේ තර්ජනයක් වූ කාල පරිච්ඡේදයක් තුළ අව්යාජ මධ්යම උමතුවක් වන රාමනායක, වැඩ බර පැටවීමේ බර දරා ගත්තේය.රාමනායකට අව්යාජ යැයි අමුසම් වේගය අඩු විය\nපරීක්ෂණ මට්ටමින් කඩුලු ලබා ගැනීම.අවංක වැසිකිළියක් සාමාන්යයෙන් පිතිකරුවා බැහැර නොකර පරීක්ෂා කිරීමට ඔහුට හැකි විය.පර්ත්හිදී ඕස්ට්රේලියාවට එරෙහි ටෙස්ට් තරගයේදී ඔහු කඩුලු රහිත විය. ඔහුගේ පළමු කඩුල්ල එංගලන්ත ටෙස්ට් තරගයේදී ෆිල් නිව්පෝට්ව ප්රතික්ෂේප කළ විට ඔහුගේ දෙවන ටෙස්ට් තරගය ආරම්භ විය. 1989-90 ඕස්ට්රේලියාවේ සංචාරයේදී, ඔහුගේ කඩුලු 4 ක සංචාරය සඳහා ඔහුට ඔහුගේ කඩුලු 4 ක සංචාරය සඳහා වෙහෙස මහන්සි වී වැඩ කිරීමට සිදුවිය.\nමාලාවක්. ආධාරක පන්දු යවන්නාගේ කාර්යභාරය රාමනායකට ගැලපේ. මොරටුවා හි ලකුණු 82 කට දැවී ගිය වෘත්තිය 3 කදී ලකුණු 3 කදී ලකුණු 3 කදී කඩුලු 17 ක් දවා ගනිමින් රාමනානායකගේ මහිමය වන ඕස්ට්රේලියාවේ ගත් මොහොතේම පසුව නිවෙස් මාලාවේදී රැස් විය. ඔහු\nමෙම ලිපි මාලාවේ සාර්ථක නව බෝල හවුල්කාරිත්වයක් ඇති කළේ නිව් කොඩි ඩාලීප් ලියනාගේ සමඟ ඕස්ට්රේලියානු ඉහළ පෙළේ ලකුණු චලනය හා පැද්දීම සමඟ ය. එය නොපසුබට උත්සාහය හා වෙහෙසකර තත්වයන් යටතේ වැඩ කිරීමට ඇති උත්සාහය සඳහා වූ විපාකයක් විය. එය කෙඳිරිගාමින් හිස ගසාගෙන යාමේ කෙටි දිග පිළිබඳ කෙටි දර්ශනයක් බව ඔප්පු විය\nරාමනායක සිය ජාත්යන්තර ජීවිතය පිළිබඳ ඉතිරි කාලය සඳහා ටෙස්ට් පිතිකරු බද්ධ කිරීම සඳහා ආපසු ගියේය.එක් දින මට්ටමේ රාමනායකගේ විලාසය effective ලදායී ආයුධයක් වූ අතර ඔහු ඔහුගේ ස්ථාවර රේඛාව සහ දිග සමඟ විශිෂ්ටතම කාර්ය සාධනයක් සහිත විය.ධාවන වේගය පාලනය කිරීමට ඔහුට ඇති හැකියාව නිසා ඔහු මෙම ක්රීඩාවේ මෙම ස්වරූපයෙන් ස්ථිර සවිකෘතයක් බවට පත් කළේය.1993 දී ඔහුගේ අවසන් පරීක්ෂණය කිරීමෙන් පසුව ඔහු ජාත්යන්තර තලයේ සිටුවීමට පෙර දින එක් ඇඳුමේ තනතුරක් පවත්වා තිබේ.1995-96 දී ඕස්ට්රේලියානු සංචාරයට පෙර සියුම් ගෘහස්ථ සමයක් ඔහු තම නම තේරීම් කමිටු ඉදිරියේ තල්ලු කරන බව දුටුවේය.රාමනායක තෝරා ගැනීමට වඩා ඔවුන් වඩාත් නරක අතට හැරෙන්නට තිබූ අතර, ඔවුන් තරුණ පරම්පරාවක් සමඟ යාමට තීරණය කළහ. ඒ කිසිවක් කිසිදු සටහනක් සමඟ සිදු නොවීය.I (ඉංග්රීසි) සහ දෙවන මට්ටමේ මට්ටමේ සුදුසුකම් ලත් පුහුණුකරුවෙකු වන ඔහු ශ්රී ලංකාවේ වේගවත් පන්දු යැවීමේ ඇකඩමියට වසර හතක් තිස්සේ රට වෙනුවෙන් ක්රීඩා කරන පන්දු යවන්නන් කිහිප දෙනෙකු මැඩපැවැත්වීය.2008 මාර්තු මාසයේදී බංග්ලාදේශයේ වේගවත් පන්දු යැවීමේ පුහුණුකරු ලෙස ඔහු පත් කරන ලදී.\nජොහාන් පී ජයසේකර",
    "Ranjith Madurasinghe": "ගෘහස්ථ කවයන්හි ඉහළින්ම ශ්රේණිගත කර ඇති මධුරීමා සිය සීමිත අවස්ථාවල ජාත්යන්තර මට්ටමින් බලපෑමක් කිරීමට අසමත් විය.ඔහුගේ උස ගොඩනැගීමත් සමඟ, මධුරසිංහ මහතා සිය හොඳින් පියාසර කළ ඕවර්ලස්පින් ලබා දීමේදීදී තට්ටුවේ ලබා ගත හැකිය.1988 දී ඔහු ලෝඩ්ස්හිදී එංගලන්තයට එරෙහිව එංගලන්තයට එරෙහි ආරම්භයේදීම කඩුලු දැරු වූ නමුත් ඔහුගේ දෙවන පරීක්ෂණයෙන් වැඩි සාර්ථකත්වයක් ලැබීය.චන්දිගාර්හ් හි ඉහළ ශ්රේණිගත කළ ඉන්දියානු පිතිකරණ මාර්ගෝපදේශයකට එරෙහිව මොහොමඩ් අෂාරුදින්ගේ කඩුලු 10 ක් දවා ගත්තේය\nසචින් තෙන්ඩුල්කාර්.පුදුමයට කරුණක් නම්, ඕස්ට්රේලියාවට එරෙහි ඕස්ට්රේලියාවට එරෙහි 1992-93 තරගාවලිය වන තෙක් ඔහු නැවත තෝරා නොගත්තේය.එය ඔහුගේ අවසාන ජාත්යන්තර තරගය වන අතර එය තවදුරටත් ඕනෑම අවස්ථාවකට ගෙවීම මුත්තයියා මුරලිදරන් බිහිවීම.ඔහු ගෘහස්ථ මට්ටමින් කදිම පන්දු යවන්නෙකු වූ අතර දක්ෂ පහළ පිතිකරුන්ට වඩා වැඩි ය.\nජොහාන් පී ජයසේකර",
    "Athula Samarasekera": "අතුල සමරසේකරගේ තීන්දුවකි. පටි. අතේ පන්දුවට පහර දීමත් සමඟ ඔහු බලවත් වැඩ වර්ජන සඳහා දක්ෂ වූ අතර එය මධ්යම වේග පන්දු යවන්නාට වඩා වැඩිය. සමරසේකර සිය වෘත්තීය ජීවිතය සඳහා අශ්වාරෝහක ආරම්භයක් ලබා දුන් අතර ඔහුගේ එක්දින ජාත්යන්තරය මත තාරාවෙකු ලකුණු ලබා ගත්තේය\nආරම්භය. ඔහුගේ ටෙස්ට් තරගයේදී ඔහු රංගනය මැඩපැවැත්වීම, පළමු ඉනිමේදී තාරාවෙකු සඳහා සේවයෙන් පහ කිරීම. දෙවන ඉනිමේදී ඔහු ලාක්ෂණික වශයෙන් ඉනිමක වාදනය කළ 57 ක් සෑදීම 57 ක් වන අතර එය සීමාවන් ගණනාවකින් විරාම ලකුණු වේ. ඔහු පොරොන්දු වූ මැනීමේ තරගය කඩුලු 2 ක් ග්රහණය කර ඇදී යන කරුණු දෙකක් රැගෙන ගියේය. එසේම\nබොහෝ විට සමරසේකරා පන්දු යැවීම ආධිපත්යය දැරීමට සූදානම් යැයි පෙනෙන විට, සැලකිය යුතු ලකුණු කුකලක් වූ බවක් පෙනෙන්නට තිබුණි. ඔහු ලකුණු කළ විට, ඔහුගේ ආක්රමණශීලී ශෛලිය සමඟ ඔහු උපරිම විනෝදාස්වාදය ලබා දෙන විට නැරඹීම වටී. කණ්ඩායමේ ස්ථිර තනතුරක් මුළුමනින්ම පිහිටුවීමට කිසි විටෙකත් නොහැකි වූ සමරසේකර තීරණය කළේය\nබංග්ලාදේශයේ වෘත්තීය ක්රිකට් ක්රීඩාවක් පැවැත්වීමට තීරණය කිරීමෙන් ඔහුගේ ජාත්යන්තර ජීවිතය අවසන් කරන්න.\nජොහාන් පී ජයසේකර",
    "Dammika Ranatunga": "ටෙස්ට් මට්ටමින් ශ්රී ලංකාව නියෝජනය කිරීම සඳහා සහෝදරයන් තිදෙනාගෙන් වැඩිමලා වූ ධම්මිකා රණතුංගට ජාත්යන්තර තලයේ ගිහි.1990-91 දී ඕස්ට්රේලියාවේ සංචාරය කිරීම සඳහා ඕස්ට්රේලියානු සංචාරය සඳහා ශ්රී ලංකාවේ ශ්රී ලංකාව වෙනුවෙන් පිතිකරණය විවෘත කරන ලද පුස්තකාල විවෘත කරන ලද පිතිකරුවෙකු ශ්රී ලංකාව වෙනුවෙන් ශ්රී ලංකාව වෙනුවෙන් පිතිකරණය විවෘත කළේය.එය ඔහුගේ එකම ටෙස්ට් තරගය බව ඔප්පු වුවද ඔහු සිය මංගල උත්සවය 40 ක් ලබා ගනිමින් ඉවසීම සහ ආසචනාවෙන් පරුණු ලෙස පරුණු ලෙස පිල ලකුණු රැස් කළේය.ඔහුගේ අන්තර්ජාතික විලාසිතාව ක්රීඩාවේ දිගු ආකෘතියට ගැලපෙන අතර ඔහු අරගල කළේ එක් දින මට්ටමක ඔහු තම සීමිත මට්ටමක බවයි.ඔහු පසුව ශ්රී ලංකා ක්රිකට් ධූරාවලියේ බලගතු පරිපාලකයෙකු බවට පත් වූ අතර එය ක්රිකට් මණ්ඩලයේ ප්රධාන විධායක නිලධාරියා විය.\nජොහාන් පී ජයසේකර",
    "Gamini Wickremasinghe": "ගාමිනි වික්රමසිංහ තේරීම් කමිටුවරුන්ගේ කැමැත්තෙන් පෙනී සිටියේය. කඩුලු පිටුපස craff න ප්රසංගයක් සහ තීරණය කරන ලද පහළ ඇණවුම් පිතිකරුවෙකු වූ ඔහුට ජාතික කණ්ඩායම තුළ ස්ථිර ස්ථාවරයක් ඇති කිරීමට අවස්ථාවක් ලබා නොදුනි. උත්ප්රාසාත්මක ලෙස තේරීම් කරුවන් තම නොන්ඩ්රල්ක්රිප්ට්ස් කණ්ඩායමේ කණ්ඩායම හෂන් හෂාන් තිලකරත්න කැමති විය\nශ්රී ලංකා කඩුලු රකින්නා නොතකා ක්ලබ් මට්ටමින් වික්රමසිංහ මහතා එම තනතුර දැරූ අතර තිලකරත්න විශේෂ පිතිකරුවෙකු ලෙස ක්රීඩා කළේය. වික්රමසිංහ 1989-90 සංචාරයේදී ගබ්බා හිදී සියදියේම කඩුල්ලේ ගබ්බා හිදී ද පිදුම් ලැබූ අතර ලකුණු දෙකක් රැස් කළේය. තුවාල වීම නිසා ඔහුට මග හැරුණි\nහොබාර්ට් සහ තිලකරත්න යන දෙවන ටෙස්ට් තරගය ආකර්ෂණීය සංදර්ශකයක් ලබා දෙන ස්ථානය භාර ගත්හ. මෙතැන් සිට ගර්මීසිංහට තින්කෙකරත්නට වඩා තිලකෙරත්නිට වඩා තින්කෙරත්නට කැමති බැවින් වික්රමසිංහ මත සිට වික්රමසිංහ පසුබිමට හෙළනු ලැබීය. වික්රමසිංහ මහතා දේශීය මට්ටමින් අඛණ්ඩව දක්ෂ, දක්ෂ දක්ෂයෙකු ලෙස කටයුතු කළ අතර 1992-99 දින නවසීලන්තයට එරෙහිව නවසීලන්තයට එරෙහිව නැවත කැඳවීමක් ලබා ගත්තේය. මාලිංග් තරගය ජයගත් අතර වික්රමසිංහ මුරලිදරන්, වෝර්නවීර සහ අනුරසිරිගේ විලාසිතාවේ භ්රමණය සමඟ කඩුලු පිටුපස සහතික සංදර්ශනයක් ලබා දුන්නේය. කෙසේ වෙතත්, ඔවුන්ගේ ප්ර wisdom ාවේ තේරීම්කරුවන් ප්රථම වරට නොව, උසස් පිතිකරණ කුසලතා ඇති ක්රීඩකයාට උදුරා ගැනීමට තීරණය කළහ. ඊළඟ වසර කිහිපය තුළ අපේක්ෂකයින් ගණනාවක් අපේක්ෂකයින් ගණනාවක් සාර්ථකව සාර්ථකව නඩු පවරන ලද අතර වික්රමසිංහ අඛණ්ඩව ගෘහස්ථ මට්ටමින් අඛණ්ඩව සිදු කළේය. ඔහුට තනිවම තනතුර සලස්වන්නට ඇති අවස්ථාව සැලකිල්ලට ගෙන.\nජොහාන් පී ජයසේකර",
    "Hashan Tillakaratne": "ශ්රී ලංකාවේ ජාත්යන්තර බලවේගයක් ලෙස ශ්රී ලංකාවේ ඉස්මතු වීමේ වැදගත් චරිතයක් වූ හෂාන් තිලකරත්න වැදගත් චරිතයක් වූ හෂන් තරඟකරුවෙකු හා මැලියම් කුවර්ෂකරයෙකි.පාසැල් සිසුවියක් ලෙස ඔහු ක්රිකට් ක්රීඩාවේ දක්ෂතා දැක්වූයේ කොළඹ ඉසිපතන විද්යාලයේ සහ පසුව ඩී.එස්. සේනානායක විද්යාලයේ දී ය.ඔහු මුලින්ම සිටියේ 1986 දී ගාලේ බී ගාලේ දී ගාලේ බී වෙත එරෙහිව තරඟ ඉතිරිකිරීමේ ශතකයක් වන අතර, 1986 දී ගාලේ දී ගාලේ බී ගාලේ තවමත් පාසැලේදී ඔහුගේ එක්දින ජාත්යන්තර තරඟාවලිය එම වසරේ නොවැම්බර් මාසයේදී ඉන්දියාවට එරෙහිව ගියේය.වසර තුනකට පසු ඕස්ට්රේලියාවට එරෙහිව පරීක්ෂණ ආරම්භයක් වූ අතර ඔහුගේ ටෙස්ට් වෘත්තීය ජීවිතය තුළ තිලකරත්න බොහෝ විට පිතිකරු-කඩුලු රකින්නා ලෙස ක්රීඩා කළේය.එහෙත් 1994 දී ඔහුගේ සැලකිය යුතු පිතිකරණ විභවය අවබෝධ විය.1999 ලෝක කුසලානයෙන් පසුව තරුණ තරුණියන්ට බරක් ලකුණු ලබා ගත් නමුත් 2001 අප්රියෙල් මාසයේදී ඔහු නැවත ජාතික කණ්ඩායමට ගෙන ආවේය. ඔහු 2001 අප්රියෙල් මාසයේදී ටෙස්ට් කැප්ටන් නම් කරන තෙක් පන්දුව සමඟ පිතිහරඹයක් භුක්ති වින්දා. ඔහුගේතරඟයට තරග 10 කින් යුත් සේවා කාලය නිපදවන ලද එක් ජයග්රහණයක් ලබා ගත් අතර එය පසුව එංගලන්තයට එරෙහිව මාලාවක් ලබා ගත් අතර, වර්ෂයේ දී එංගලන්තයට එරෙහිව මාලාවක් ලබා ගත් අතර ඔහුගේ නායකත්ව ශෛලිය ඉතා ආරක්ෂිත යැයි විවේචනය කරන ලදී.ඕස්ට්රේලියාවට එරෙහිව 3-0 ශ්රේණි ලෙස වයිට් වොච් අනුගමනය කරමින් ඔහු 2004 මාර්තු මාසයේදී ඉහළ ගිය අතර පිතිකරුවෙකු ලෙස සිය වෘත්තීය ජීවිතය කරගෙන යාමට උනන්දුවක් දැක්වුවද, පසුව සිම්බාබ්වේ සංචාරය සඳහා ඔහු නොසලකා හරින ලදි.2005 පෙබරවාරි 1 වන දින ශ්රී ලංකා මණ්ඩලය 2004 දෙසැම්බර් සුනාමියෙන් පසු සහන සඳහා පිහිටුවා ඇති ආයතනයක් වන ඔහු ක්රිකට් ආධාර පිළිබඳ විධායක අධ්යක්ෂවරයා ලෙස පත් කළේය.පසුව ඔහු කොළඹ දිස්ත්රික්කයේ පැරණිතම දේශපාලන පක්ෂය වන එක්සත් ජාතික පක්ෂයට සම්බන්ධ වූ අතර, කොළඹ දිස්ත්රික්කයේ වැඩිමලු දේශපාලන පක්ෂය වන එක්සත් ජාතික පක්ෂයට සම්බන්ධ වූ අතර පක්ෂයේ අවිස්සාවැල්ල මැතිවරණ කොට් for ාශයේ පක්ෂයේ සංවිධායකවරයා ලෙස පත් කරන ලදී.අලුතින් පත් කරන ලද ජනාධිපති අර්ජුන රණතුංගගේ ආරාධනයෙන් ශ්රී ලංකා ක්රිකට් ආයතනයේ විවිධ කමිටු හි විවිධ කමිටු හි සේවය කිරීම සඳහා ඔහු සිය ඡන්ද කොට් orate ාශයේ ජනතාවගේ ජීවිත සමඟ සම්බන්ධව කටයුතු කිරීම සඳහා ඔහු දිගටම කරගෙන යයි.තිලකරත්න 2008 මාර්තු මාසයේ සිට එම්.සී.සී.මැයි මාසයේදී ඔහු ක්රිකට් විනිසුරු සංගමයේ සභාපති ධුරයට පත් වූ අතර ශ්රී ලංකාවේ (ඇකොස්ල්) පිරිනමනු ලැබීය.\n(චාලි ඔස්ටින්)",
    "Marvan Atapattu": "අවදානමට ලක්විය හැකි ආරම්භකයක් වන අටපට්ටු චරිතයේ අතිවිශිෂ්ට ශක්තියක් පෙන්නුම් කළ අතර, ඔහු ප්රතිශත තණතීරුවක දක්ෂතා දැක්වූයේ, ඔහු සිය ආරම්භක හවුල්කරු වන සනත් ජයසූරිය, ඔහුගේ ආරම්භක හවුල්කරු වන සනත් ජයසූරියගේ අවදානම් සඳහා ප්රයෝජනවත් ප්රතිවිරුද්ධ ලක්ෂ්යයකිපරීක්ෂණ වෘත්තිය.ඔහුගේ මුළු බිග් ටෙස්ට් ඉනිම - ඔහුගේ වෘත්තීය ජීවිතය තුළ ඔහු ද්විභාෂා හයක් වාර්තා කළේයඑහි ආරම්භය: ස්ථාපිත වීමට වසර හතකට ආසන්න කාලයක් ගත විය.කෙසේ වෙතත්, 1990 දශකයේ සිට ඔහුගේ සාමාන්යය ඉහළට ඔසවා තැබීය.නැරඹීමට අලංකාර ක්රීඩකයෙක්, අටපට්ටුගේ අත්සන වෙඩි තැබීම ඔහුගේ ඉහළ වැලමිට ආවරණ ධාවකය විය.වසර තුනක් ඔහු 2003 අප්රියෙල් මාසයේදී එක්දින පාර්ශවයට නායකත්වය දීමට පෙර ජයසූරියගේ අවධාරනය විය. ඔහු ටෙස්ට් කණ්ඩායම ද භාර ගැනීමට අපේක්ෂා කළ නමුත් තේරීම් කමිටුව ද එම රැකියාව සඳහා හෂාන් තිලකරත්න මහතා පත් කළේය.අටපට්ටුගේ වෘත්තීය ජීවිතය වැඩිමහල් පරීක්ෂාවකින් ආරම්භ කළ අතර, තරග පාවාදීමක් සිදුකරන ලද මුදල් සම්බන්ධතාවයට පසුව තවත් විකාර සෙල්ලකැවිල්ලක් ආරම්භ කරන ලදී.2003 දී එංගලන්තයේ සංචාරය 2003 දී.නමුත් 2004 මුල් භාගය වන විට කණ්ඩායම තිලකරත්න යටතේ පහළට ගසාගෙන ගිය අතර ටෙස්ට් කපිතාන්වරයා ලෙස අටපට්ටු පත් කිරීමට තේරීම් කමිටුවලට බල කෙරුනි.සති කිහිපයක් ඇතුළත ඔහු කණ්ඩායමේ ස්ලයිඩියුලය නවතා දමා ශක්තිමත් නායකයෙකු ලෙස ස්ථාපිත කර තිබේ.මතුපිට නිහ quiet හා වෙන් කළ චරිතයක් වන ඔහුගේ නායකත්ව පරම්පරාව පිටස්තරයාට මුළුමනින්ම පැහැදිලිව පෙනෙන්නට තිබුණත්, කණ්නාඩි කාමරය තුළ ඔහු ක්රීඩකයන් සමඟ ගනුදෙනු කිරීමේදී සරල හා ධනාත්මක කපිතාන්වරයෙකි.ක්රීඩාවට.2004 මැද භාගය වන විට ශ්රී ලංකාව ආසියා කුසලානය දිනාගත් අතර දකුණු අප්රිකාව සුදු හුනු ගනිමින් ශ්රී ලංකාව සමත් විය.මෙම කණ්ඩායම අන්තර්ජාතික ක්රිකට් කවුන්සිලයේ චැම්පියන්ස් කුසලානයට වඩා දුර්වල වූ නමුත් 2004 ඔක්තෝම්බර් මාසයේදී පාකිස්තානයට එරෙහිව පැතිර ගියේය.නමුත් අටපට්ටු විසින් අනපේක්ෂිත ලෙස ආකර්ෂණය කර ගැනීම සඳහා අඛණ්ඩව සිදු වූ විට, නිල්, රසායනාගාර සභාපතිවරයාගේ සභාපතිවරයා වන පාක්ටීල් කුසලානය ඒවට චෝදනා කරයි.නව ක්රීඩකයින්ට රුධිරය සඳහා ඔහු දැරූ උත්සාහයන් අවහිර කිරීම.අටපට්ටු ප්රසිද්ධ ගැටුමක් ගැන පැහැදිලිවම බලපෑවේ, තේරීම් කරුවන් සමඟ ඇති සම්බන්ධය ගති කිකිළිය.ඔහුගේ වෘත්තිය 2006 මුල් භාගයේදී පිටුපස තුවාලයක් ලබා දී ඇති අතර එය මහේලා ජයවර්ධන නායකත්වය භාර ගත්තේය.ඔහු සෙමෙන් එක්දින පැත්තට නැවත හඳුන්වා දෙන ලද නමුත් තේරීම් කරුවන් සමඟ ඔහුගේ ඇඟිලි දිගටම පැවතුනි.ඔහු සංචිතයට ගෙන ඒම සඳහා අමාත්ය මැදිහත්වීමකින් පසුව ඔහු ඕස්ට්රේලියානු සංචාරය ප්රමාද වූ නමුත් ඔහු නැවත තේරීම් කරුවන්ට පහර දුන් තරගාවලිය හරහා ඔවුන් නැවත \"විහිළුවක් විසින් ගමන් කරන මතුවැක් කට්ටලයක්\" ලෙස හැඳින්වීය.දෙවන ඉනිමේදී හොබාර්ට් හි 80 ක් ඇතුළුව තරගාවලියේදී ඔහු අර්ධ ශතක දෙකක් ලබා ගත් නමුත් පරීක්ෂණයේ අවසාන දිනයේදී ජාත්යන්තර ක්රිකට් ක්රීඩාවෙන් විශ්රාම ගැනීම නිවේදනය කළේය.අටපට්ටු දිල්ලි යෝධයන් සහ ICL ලෝක XI සඳහා වන නිල නොවන ඉන්දීය ක්රිකට් ලීගයට සම්බන්ධ විය.2008 සැප්තැම්බර් මාසයේදී ඔහු සහ තවත් ශ්රී ලාංකිකයන් සිව්දෙනෙකු පිළිබඳ තහනමක් ඔසවා ඇති අතර, අටපට්ටු හි දේශීය ක්රිකට් පිටරට ගෙදර සෙල්ලම් කිරීමට නිදහස තිබුණි.සියලුම ක්රිකට් ක්රීඩාවේ විශ්රාම ගැනීමෙන් අටපට්ටු තාක්ෂණිකව බෙදා හැරීමේ හා වෙහෙස මහන්සි වී වැඩ කරන පුහුණු පුහුණුකරුවෙකු ලෙස කීර්තියක් ඇති කර තිබේ.ඔහු 2011 සිට ජාතික පැත්තෙන් පිතිකරණ පුහුණුකරු වන අතර එය වසරකට පසුව, පෝල් ෆාස්ට් පුහුණුකරුගේ හදිසියේම පිටත්ව යාමේ දී අටපට්ටු මහතා අතුරු දෙපාර්තමේන්තු ප්රධාන පුහුණුකරු ලෙස පත් කරන ලදී.එංගලන්තයේ සංචාරය සහ ජූලි මාසයේදී එංගලන්තයේ සංචාරය සහ දකුණු අප්රිකාවට එරෙහි ගෘහ චාරිකාව.\nක්රික්ෂෝ කාර්ය මණ්ඩලය 2008 සැප්තැම්බර් සැප්තැම්බර්",
    "Charith Senanayake": "1990-91 නවසීලන්තයේ සංචාරය පිළිබඳ ආරම්භක පිතිකරුවෙකු ලෙස සිය ස්ථාවරය ස්ථාපිත කිරීමට චරිත් සේනානායකට අවස්ථාව ලබා දෙන ලදී.වමතින් පිතිකරුවෙකු වූ ඔහු දක්ෂ ආ roke ාතකයෙකු වූ නමුත් නවසීලන්ත කඩුලු ටාකෑමේ නියෝගයට වඩා හොඳින් ගැලපෙන අතර එහිදී නව පන්දුවට එරෙහිව නව පන්දුවට සැක සහිත විය.හැමිල්ටන් හි දෙවන ටෙස්ට් තරගයේදී ඔහු තම වැඩිම ටෙස්ට් ලකුණු 64 ක් රැස් කළ අතර චන්දිකා හතුරිසිංහ සමඟ පළමු කඩුල්ල සඳහා 95 ක් එකතු කළේය.රොෂාන් මහානාමා සහ හතුරුසිංහ මහතා ශක්තිමත් ආරම්භක යුගලයක් පිහිටුවීමත් සමඟ මෙම සංචාරයෙන් පසුව තවත් අවස්ථාවක් නොලැබුණි.එක්දින ජාත්යන්තර ජාත්යන්තර ක්රියාකාරකම් හතරකදී ඔහු තරමක් පුදුමයට කරුණක් නම්, ක්රීඩාවේ නිදහස් ලකුණු ස්වභාවය ඔහුගේ මානසිකත්වයට සරිලන පරිදි තරමක් පුදුමයට කරුණකි.\nජොහාන් පී ජයසේකර",
    "Chandika Hathurusingha": "ආරම්භක ශෛලියක් සහ ස්ථිතික ස්වභාවයක් ඇති ආරම්භක පිතිකරුවෙකු වන හතුරුසිංහ රොෂාන් මහානාමා සමඟ ස්ථාවර ආරම්භක හවුල්කාරිත්වයක් ඇති කර ගත්තේය. තත්වය අවශ්ය වූ විට දීර් enghin ු ඉනිම වාදනය කළ හැකි විට හතුරසිංහ විවිධ ආ ro ාත ඇති බව හතුසිංහ. වාතය හරහා අව්යාජ චලනයකට හැකියාව ඇති ඩයිනකි මධ්යම වේග පන්දු යවන්නෙක්. තුවාල ලැබූ මහානාමා වෙනුවට හැමිල්ටන් හි නවසීලන්තයට එරෙහිව නවසීලන්තයට එරෙහිව පැත්තේ සිටි ඔහු ඊට ප්රතිචාර දැක්වූයේ ඔහුගේ පළමු පරීක්ෂණ තුනෙන් අර්ධ ශතක තුනක කාලයක් සියවස් තුනක් හදාරමින් ය. පහත සඳහන් ලිපි මාලාවේ පහසු දායකත්වයක් තිබියදීත්, දකුණු අප්රිකානුවන්ගේ වේගයට එරෙහිව දුෂ්කර කාලයකට පසු ඔහු අතහැර දමා ගියේය. පසෙකින් සිදු වූ කාල පරිච්ඡේදයකට පසුව, වෙනත් කිසිදු ආරම්භක පිතිකරුට ස්ථිර තනතුරක් ස්ථාපිත කළ නොහැකි, ඔහු පාකිස්තානය නැරඹීමට තෝරාගෙන විශිෂ්ට මාලාවක් සමඟ ප්රතිචාර දැක්වීය. ඕස්ට්රේලියාවේ සිදු වූ ගමනේදී සනත් ජයසූරිය ඉස්මතු වීමෙන් පසු හතුරුසිංහ යළිත් පිටව ගියේය. මෙම අත්හදා බැලීම කෙටි විය. 1999 ලෝක කුසලානය සඳහා තෝරාගත් හතුසිංහ එක තරගයක් සඳහා එක් තරගයක් ලෙස රෙකෝඩ් ලෙස හතුසිං කැඳවූ අතර, තරුණ ක්රීඩකයින් තෝරා ගැනීමේ තේරීම් කමිටුව අවසානය ඔහුගේ ජාත්යන්තර වෘත්තීය ජීවිතය සඳහා තෝරා ගත්තේය. ඔහු 2005 දී පළමු පන්තියේ ක්රිකට් ක්රීඩාවෙන් බැහැරව පුහුණු වූ අතර එක්සත් අරාබි එමීර් රාජ්යයේ සහ ශ්රී ලංකාවේ පුහුණුකරු ලෙස කටයුතු කර ඇත.",
    "Sanath Jayasuriya": "තම වෘත්තියේ දිවයිනේ මුල් භාගයේදී සනත් ජයසූරිය සිය වෘත්තීය ජීවිතය ගැන සිතීම දුෂ්කර ය.ඔහු ගැන දැන් ඔහු ගැන සිතන්න, ඔබ ස්මිටි වලින් කෙළින්ම කුළුණෙන් මඳක්, වෙඩි හා ආවරණය හරහා මිටියක් සහ ආවරණයක් සහ ආවරණය හරහා කපන ලද වෙඩි තැබීම ගැන සිතන්න.පන්දු යැවීමේ ප්රහාරවලින් කඩා දමා පුළුස්සා දැමූ සහ පුළුස්සා දැමූ ක්රීඩාවේ සෑම ආකාරයකම එක හා සමානව ලකුණු ලබා ගත හැකි මිනිසෙකු ඔබට මතකයි.අසාමාන්ය අතින් සම්බන්ධීකරණයෙන් බොහෝ දේ රඳා සිටිනු ඇති අතර, අගල සහ කෙට්ටු වාර ගණනක් ඇති වූ නමුත් ඔබ්ටිෆ් ලේඛකයින් කාර්යබහුල වූවාක් මෙන් ඔහු උත්තරීතර බලයේ තවත් ඉනිමක් බිහි කරයි.පන්දු යැවීම, සැමවිටම කඩුලු 440 ක්ම තමා කළ දේ ගැන සැලකිලිමත් වූ බව ජාත්යන්තර කඩුලු 440 ක්ම පැවසිය යුතු බව ජාත්යන්තර කඩුලු 440 ක්ම කඩුලු 440 ක් වුවද පන්දු යැවීම, සෑම විටම යුසී වර්ෂාව මත රඳා පැවතුනි.1992 ලෝක කුසලානයේදී ලොව එක්දින ක්රීඩාවට සහ ජයසූරිය වෙත ළඟා වූ ආකාරය සහ එනම් මැදපෙළේ පහළ සිට ලුහුබැඳ ගිය ආකාරය ගැන බොහෝ කණ්ඩායම් නැවත සිතා බැලූ විට බොහෝ කණ්ඩායම් නැවත සිතා බැලූහ.1993 දී ඉන්දියාව. ඊළඟ වසරේ පාකිස්තානයට පෙර පැවති උත්සවයකදී, මාස 18 කට පමණ පසු ලෝක කුසලානය පෙරළී යන කාලයත් සමඟම ඔහු පළමුවන සියවස වන විට සුදු ජාතිකයින් තුළ සුන්දර ආ roke ාතයක් ඇති කර තිබේඇඩිලේඩ් හි පිරි උත්සාහය.ඊළඟ වසර බොහෝ දෙනාම බහුල හා සාර්ථක වූහ.1996 ලෝක කුසලාන තරගාවලියේ අවසන් හා අවසන් මහා තරගයෙන් අරවින්ද ද සිල්වාගේ ඉන්ද්රජාලික ඉනිම ජනතාව සිහිපත් කරන නමුත් පසුගිය අට අට තුළ ඉන්දියාව දිල්ලියේ සහ එංගලන්තයේ ජයසූරියගේ පහරදීම් ද සිහිපත් විය.වැඩි කල් යන්නට මත්තෙන්, ඔහු ටෙස්ට් ප්රහාර එල්ල කිරීම සඳහා දැඩි හා විපක්ෂ පිතිකරුවන් හරහා වැඩ කිරීමට ප්රමාණවත් කාලයක් ගත කළ හැකිය.අර්ජුන රණතුංග නෙරපා හැරීමෙන් පසු නායකයා ලෙස වසර හතරක සිව් වසරක පැතිකඩක් වූ අතර එය 2003 ලෝක කුසලානයේදී අවසන් පූර්ව වටයෙන් අවසන් වූවා සේම, වවුලන් සමඟ ප්රතිලාභ අඩුවීම ගැන, ඔහුට ඔහුගේ වඩාත්ම සාර්ථක වසරක් විය.එක්දින ගිනිදැල් දිගින් දිගටම ශ්රී ලංකාව 2007 දී තවත් ලෝක කුසලාන අවසන් මහා තරගය දක්වා ගෙන ගිය අතර 2008 දී තවත් ලෝක කුසලාන තරගය සඳහා ඔහු දායක වූ අතර, එය තේරීම් කමිටුව 'පොරවකින් වැටී ඇති බව පෙනේඅවසාන අවස්ථාව.ඉන්දීය ප්රිමියර් ලීගය ඔහුගේ විශාල කලකිරීමේ දක්ෂතා ප්රදර්ශනය කිරීම සඳහා නව වේදිකාවක් ලබා දුන් නමුත් පසුකාලීන ව්යාපාරවල පළමු කන්නයේ සාර්ථකත්වය ප්රතිවර්තනය කිරීමට අපොහොසත් වූ අතර පසුකාලීන ව්යාපාරවල පළමු කන්නයේ සාර්ථකත්වය ලබා ගැනීමට අපොහොසත් විය.වයස අවුරුදු 39 දී සිය ගණනක්.2010 අපේ්රල් මාසයේ දී ඔහුගේ පාර්ලිමේන්තු මන්ත්රීවරයකු ලෙස ඔහු ලැබෙමින් මැතිවරණය සහ ඔහුගේ ජාත්යන්තර ජීවිතය අවසන් වන විට ඔහුගේ ජාත්යන්තර ජීවිතය අවසන් විය හැකි යැයි යෝජනා කළ නමුත් 2011 ලෝක කුසලානය සඳහා 30 දෙනෙකු සඳහා වූ 30-මෑන් 30 ක සංචිතයක් සඳහා ඔහු විසින් එල්-මෑන් 30 ක දැවැන්ත සංචිතයක් බවට පත් කළේයඑංගලන්තයේ ශ්රේණිය සඳහා එක්දින පැත්තේ සති දෙකක සති දෙකක ඔහුගේ 42 වන උපන්දිනයයි.දිලීප් ප්රේමචරන්",
    "Kapila Wijegunawardene": "කපිල විජේගුනවර්ධන යනු සේවය කළ ස්ථාවර මධ්යම වේග පන්දු යවන්නාකි\nතෝරාගත් විට ශ්රී ලංකාව හොඳින්.ජාත්යන්තර මට්ටමින් ඔහුට එය නොතිබුණි\nවේශකයේ අව්යාජ තර්ජනයක් වන නමුත් නිවැරදි රේඛාවක් සමඟ\nපිතිකරුවාට පිතිකරු කරදරයක් කළ හැකි පන්දුව ගෙනයාමට ඇති හැකියාව\nඔවුන් ඔහුගේ හැකියාව අවතක්සේරු කළහ.තේරීම්කරුවන් පැහැදිලිවම තිබුණි\nවිජේගුනවර්ධන දැඩි ලෙස එක්දින පන්දු යවන්නෙකු ලෙස සැලකූ අතර එය විය\nඔහු තම ජාත්යන්තර මංගල්යය කළ ක්රීඩාවේ මෙම ක්රමය.\nපිළිවෙලට ඕවර 8 න් 2/29 ක් ලබා ගැනීම ශ්රී ලංකාවට ජය ගැනීමට ශ්රී ලංකාවට උදව් කළේය\nපාකිස්තානය ඔහුගේ ආරම්භක තරඟයේදී.ඔහුගේ පරීක්ෂණ ආරම්භ වූයේ චාරිකාවේ ය\n1991 දී එංගලන්තය, ඔහු අරපිරිමැස්මෙන් භාවිතා කළ ඕෆ් ඕෆ් පරීක්ෂණයෙන්\nකඩුලු පුපුරා ගියා.ඔහුගේ දෙවන හා අවසාන පරීක්ෂණයේදී\nෆයිසලාබද්හි පාකිස්තානය ඔහුට තරගය සමෘද්ධිමත් කාලයක් තිබුණි\nවිශ්ලේෂණය 7/98, සහ දෙවන ඉනිමේදී ඔහුගේ 4/51 ක් පන්දු යැවීම\nශ්රී ලංකාව අමතක නොවන ජයග්රහණයකට.(ජොහාන් ජයසේකර, සැප්තැම්බර් 1999)",
    "Pramodya Wickramasinghe": "ඔහු දැන සිටි පරිදි ප්රමෝඩියා වික්රමසිංහ නොහොත් 'විකී' යනු විශ්වසනීය මාධ්ය වේග වේග පන්දු යවන්නා වන අතර එය ප්රහාරයට වටිනා අත්දැකීම් සහ පාලනයක් ලබා දුන්හ.වේගයෙන් සාපේක්ෂව මෘදුයි, ඔහු වාතයේ නිරවද්යතාව සහ චලනය මත විශ්වාසය තැබීය.ඔහු මටාරා හි රාහුල විද්යාලයේ අධ්යාපනය ලැබූ අතර සිංහල ක්රීඩා සමාජය සඳහා සිය සමාජ ශාලාවේ ක්රිකට් ක්රීඩා කරන ලදී.1989 දී බංග්ලාදේශ කුසලාන ශූරතාවලියේ සිට 1989 දී බංග්ලාදේශයේ කුසලාන ශූරතාවලියේ සිට 1991 දී ඔහු ශ්රී ලංකාවේ 'බී' කණ්ඩායම සමඟ හඳුන්වා දෙන ලදී.කළුතුරා ycC ට වඩා 41 ක් සඳහා 10 ක්.2000 දී ඕස්ට්රේලියාවේ ඔහුගේ උරහිස මත ශල්යකර්මයකට භාජනය වීමට ඔහුට බල කෙරුණු අතර, ඔහු නැවත පැමිණීම මත පැත්තේ ඔහුගේ ස්ථානය සිමෙන්ති කිරීම දුෂ්කර විය.\nවිස්ඩන් ක්රිනින්ෆෝ කාර්ය මණ්ඩලය",
    "Romesh Kaluwitharana": "අඩු \"කළු\" ම පුපුරා නොපැමිණීම සමඟ ජාත්යන්තර දර්ශනයට\n132 1992-93 දී ඕස්ට්රේලියාවට එරෙහි ආරම්භයේදී. කෙසේ වෙතත්, එවැනි අපූරු ය\nආරම්භය, ඉඳහිට ජ්යෙෂ් senior හස්තයේ තම ස්ථානය ලබා ගැනීමට ඔහු අසමත් විය\nකඩුල්ල පිටුපස අඩුපාඩුකම්. තීරණාත්මක 1995-96 සංචාරය සඳහා ඔහුව සිහිපත් කළේය\nඕස්ට්රේලියාව, ඔහු සනත් සමඟ ඒකාබද්ධ වූ විට ඔහුගේ වෘත්තියෙහි හැරවුම් ලක්ෂ්යය\nජයසූරිය විනාශකාරී හාඩ් හෙක්ටයාර් ඇටකටු හවුල්කාරිත්වයක් ඇති කරයි. එම\nයුගලයේ ලකුණු ලබා ගැනීම එක්දින පිතිකරණය විප්ලවීය ලෙස සිදු වූ අතර, ඔහු ශීත the තුවේ විශ්මය ජනක ලෝක කුසලාන ජයග්රහණයේ අනිවාර්ය චරිතයක් විය. එතැන් සිට ඔහුගේ පිතිකරණ විලාසය තරමක් සහ ඔහු වැඩි ඉනිම සෙල්ලම් කිරීමට සූදානම් විය.\nකුමාර් සංගක්කාර මතුවීම 2000 න් පසු ඔහුගේ ආන්තිකකරණයට හේතු විය,\nඔහු එක්දින සහ පරීක්ෂණ කණ්ඩායම සඳහා වරින් වර ප්රතිලාභ ලබා දුන්නද. එම\nපරීක්ෂකයින්ගේ පිතිකරණයේ පිතිකරණ පිතිකරණය කෙරෙහි අවධානය යොමු කරන ලෙස චන්ගකුකර්ගෙන් විමසීමේ තීරණය\n2004 දී ටෙස්ට් ප්රතිලාභයක් සඳහා මග පෑදූ නමුත් ඔහුගේ කණ්ඩායම සමඟ ඔහුගේ රංගනයන්\nඔහුගේ අවසන් ටෙස්ට් ඉනිමේදී ලකුණු 54 ක් රැස් කළ අතර තේරීම් කමිටු\nවසරින් පසු නවසීලන්තය සඳහා පුද්ගලයන් 20 ක පුහුණු තටාකයක් සඳහා මඟ හැරී යන විට අනාගතය දෙස බැලීමට ඇති ආශාව පෙන්නුම් කළේය. ක්රිකට් ක්රීඩාවෙන් පසු ජීවිතය කෙරෙහි අවධානය යොමු කිරීමට කාලය පැමිණ ඇති බව අවධාරනය කරමින් ඔහු දිනෙන් දින විශ්රාම යන බව ප්රකාශ කළේය. රක්ෂණ විධායකයෙකු ලෙස වෘත්තියක් පවත්වන අතරතුර ඔහු කෝල්ට්ස් සීසී පුහුණු කළේය. චීනය ඇගයීම සඳහා 2006 ඒපීඑස්පී කමිටුවේ සාමාජිකයෙකු ලෙස ශ්රී ලංකා ක්රිකට් කණ්ඩායම විසින් ඔහු පත් කරන ලද අතර, 2008 දී මැලේසියාවේ තාවකාලික චෝදනාවක් ලබා ගත්තේය.\nචාලි ඔස්ටින්",
    "Dulip Liyanage": "වේගවත් මධ්ය පන්දු යවන්නෙකු වන දුමුලිප් ලියනාගේ 1992-93 දී කොළඹදී මුත්තයියා මුරලිදරන් සමඟ ටෙස්ට් තරගය ආරම්භ කළේය.ඔහුට ආකර්ෂණීය මංගරයක් තිබූ අතර ටොම් මොඩිගේ කඩුල්ල ඔහුගේ තෙවැනි පන්දුවෙන් කඩුලු ලබා ගත් අතර ඇලන් දේශ සීමාවේ සහ ඩේවිඩ් බූන් කඩුලු ලබා ගත්තේය.නවසීලන්තයට එරෙහිව අනුගමනය කළ පරීක්ෂණ දෙකේදී ඔහු ශ්රී ලංකාවේ දඟ පන්දු යවන්නන්ගේ ආධිපත්යය දැරූ තරගාවලියේදී සිය පොරොන්දු වූ පෝරමය කඩුලු 7 ක් දවා ගත්තේය.ප්රතිචාර නොදක්වන තණතීරු මත.තුවාලය ඔහුගේ අනාගත අවස්ථා සීමා කරන අතර, කෙටිකාලීන, කෙටිකාලීන, කෙටිකාලීන, 1997 දී එක්දින තරගාවලියට නැවත පැමිණීමට පෙර ඔහු අපැහැදිලි විය. ඔහු එක්දින තරගාවලියේදී ශ්රී ලංකාව නියෝජනය කළේය.පාකිස්තානය ඔහු නැවතත් තුවාල ලබා ඇත.කෝල්ට්ස් සීසී සමඟ ආකර්ෂණීය කන්නයකින් පසු ඔහුට තවත් අවස්ථාවක් ලබා දී 2001 අගෝස්තු මාසයේදී ඉන්දියාවේ ශ්රී ලංකා සංචාරය සඳහා සංචිතයට සිහිපත් කළේය. ඔහු අවසන් කොළඹ පරීක්ෂණයේදී ක්රීඩා කළේය.\nවිස්ඩන් ක්රිනින්ෆෝ කාර්ය මණ්ඩලය",
    "Muthiah Muralidaran": "සමහර විට ඩග්ලස් ජැඩින්ට මුතු මල්ලිදුරන් මෙන් මතකය ධ්රැවීකරණය වී ඇති බැවින් ක්රිකට් ක්රීඩකයෙක් විය හැකිය.ඇදහිලිවන්තයන් සඳහා, ඔහු පන්දුවකට පහර දුන් ශ්රේෂ් greatest තම කාලය අතර වේ.සැකකරුවන් සඳහා, ඔහු ක්රීඩාවේ ශ්රේෂ් greatest තම වාර්තා නුසුදුසු ය.අවිවාදිත යනු කුමක්ද? ඕනෑම මතුපිටක් ගැන පන්දුව තියුනු ලෙස යොමු කිරීමට ඔහුට ඇති හැකියාව වූ අතර, අඩු මිනිසෙකු සමත් වූ මැරතන් අක්ෂර වින්යාසය 18 ට වඩා කන්සෑ ක්රියාවක්ද?බොහෝ විට ප්රතී නැත.ඔහු කලාතුරකින් බලාපොරොත්තු සුන් විය.මහනුවරදී රසකැවිලි ආසාදන පිළිබඳ පවුලක් ඇති පවුලක්, 1992-99 දී ඕස්ට්රේලියාවට එරෙහි සංචාර තරගයකදී ඔහු මුලින්ම ප්රසිද්ධියට පත්වූයේ, ඇලන් දේශ සීමාවට වඩා පිතිකරුවෙකු ඔහුව තෝරා ගැනීමට අපොහොසත් වූ අවස්ථාවේදීය.ආරම්භයේ සිටම, ඔහුගේ ක්රියාව පුදුමයේ හෝ සමච්චලයට ලක් වූ වස්තුවක් වූ අතර, ඔබ සතුව ඇති වැටෙන් කුමන පැත්තේද යන්න මත පදනම්ව.විකෘති වූ වැලමිට කතාවේ කොටසක් පමණි.මුරලිගි සුවිශේෂී ලෙස අතිරේක මැණික් කටුව සහ භාරදීමේදී වේගයෙන් භ්රමණය වන විට වේගයෙන් භ්රමණය විය.මෙම සියලු සාධකවල සංයෝජනයක් මගින් පන්දුව බොහෝ ඕතෝඩොක්ස් ඇඟිලි කැටයම් කරන්නන්ට වඩා පන්දුව සක්රීය කිරීම සඳහා ඔහුට හැකි වූ නමුත්, ඔහුගේ ප්රගුණ කිරීම, ඩෝසෝරා සමඟ, අනෙක් මාර්ගයට ගිය හෝ තම රේඛාව ෂේන් වෝර්න් බවට පත් වියකඩුලු ලබා ගැනීම සහ ශ්රේෂ් ness ත්වය කණුවක ප්රතිවාදියා.මතභේද සියලු සෑම විටම ඔහුට සමාගමක් තබා ඇති නමුත් මුරලි කලාතුරකින් තම පුළුල් ඇස් ඇති සිනහව හෝ පිතික පැති හරහා දිවීමේ හැකියාව නැති වී ගියේය.ඩාව්රෙල් හිසකෙස් 1995 දී බොක්සිංන දිනය මතට විසි කිරීම සඳහා ඔහුව හැඳින්වූ අතර වසර තුනකට පසුව රොස් එමර්සන් අනුගමනය කළේය.2004 දී, ඔහුගේ සහ වෙනත් ක්රියා පුළුල් විශ්ලේෂණයකින් පසු පුළුල් විශ්ලේෂණයකින් පසුව, ඔවුන්ගේ ඩොෂ්රාව පන්දු යැවීමෙන් වළකින ලෙස ඔහුගෙන් ඉල්ලා සිටියේය.සංශයවාදීන් දිගින් දිගටම ඔහුගේ ජයග්රහණ ප්රතික්ෂේප කළ අතර, මුරලි විශේෂ වාත්තුයක රූපවාහිනියේ පන්දු යැවූ අතර, ඔහුගේ සම්පූර්ණ තලය හරහා උත්සාහ කර සැකකරුවන්ට ඒත්තු ගැන්වීමට ය.1996 දී ලෝක කුසලාන ජයග්රාහී පැත්තෙන් කොටසක් 1996 දී ඔහු අවසන් වසර 11 කට පසුව පැවති ලකුණු 11 ට පසුව ඔවුන් ඉවහල් වූ අතර, රටේ විශාලතම ක්රීඩා අවස්ථා සමහරක් තුළ ඔහු තම කාර්යභාරය ඉටු කළේය.1998 දී එංගලන්තයේ ඕවල්හිදී එංගලන්ත එංගලන්තයට උදව් කළ ඔහුගේ කඩුලු 16 ක් දවා ගනිමින් ශ්රී ලංකාව එක් පරීක්ෂණයකට පමණක් වටිනා යැයි සැලකේ.ඉන්දියාව සහ ඕස්ට්රේලියාව හැරුණු විට සෑම රටකම බෝලය සමඟ 30 ට වඩා වැඩි පිරිසක් සමඟ විනෝද වූ අතර ඔහු ඉන්දියාව, එංගලන්තය සහ දකුණු අප්රිකාවට කඩුලු 100 කට වැඩි ප්රමාණයක් සහිත විශිෂ්ට ටෙස්ට් දිවියක් අවසන් කළේය.අර්ජුන රණතුංග විසින් මෙම ලෑස්තිටු 1990 දශකයේ අග භාගයේ මල් පිපී ඇති අතර, විපක්ෂය හරියස් කඩුලු 20 ක් හෝ ඊට වැඩි ප්රමාණයක් ටෙස්ට් තරගාවලියේදී අයවැය ගත කළ කාල පරිච්ඡේදයක් පැවතුනි.කාලය ගෙවී යත්ම, ඔහුගේ ලැජ්ජාව නිහ quiet දැඩි හැඟීමකට හා හාස්යය පිළිබඳ හැඟීමකට මග පෑදීය. ඔහු 2004 දී ප්රතිසංස්කරණය කිරීමේදී ඔහු ප්රතිසංස්කරණය කිරීමේදී ආයෝජනය කළ ශක්තිය, කාලය හා මුදල් දිනා ගත්තේය.ජනවාර්ගික ගැටුමේ කාලයකදී බොහෝ විට එකම ද්රෝහිය රටේ ඕනෑම කෙනෙකුට එක්සත් ජාතීන්ගේ බලවේගයක් බවට පත්විය.අතේ පන්දුව සමඟ ඔහු එවැනි වීරයෙකු වූ බව කතන්දරයේ කොටසක් පමණි. ඩිලී පීපී ප්රේමචන්ද්රන්",
    "Ashley de Silva": "ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කිරීම සඳහා තෝරාගත් විට පළපුරුදු ගෘහ වාදකයෙක්\nලංකා, ද සිල්වා ජාත්යන්තර මට්ටමින් ගඳ ගසමින් කෙටි එකක් විය.\nඔහුගේ පළමු පන්තියේ ආරම්භය 1984 දී ද සිල්වා හි ද සිල්වා ස්ථාවර විය\n80 දශකය පුරා කොළඹ ක්රිකට් සමාජය සඳහා රංගන ශිල්පියා\n90 දශකයේ මුල් භාගයේ.තත්ත්ව පරීක්ෂණයක් සංවර්ධනය කිරීමට ශ්රී ලංකාවේ අපොහොසත් වීම\nකඩුලු රකින්නා දුටුවේ ද සිල්වා ද සිල්වාට ඇමතුමක් ලබා ගැනීම සඳහා ඇමතුමක් ලබා ගනී\nඑංගලන්තයට එරෙහිව.ශ්රී ලංකාව ඔවුන්ගේ පළමු පරීක්ෂණ ජයග්රහණය අත්කර ගත්තේය\nඉංග්රීසි, ද සිල්වා ලකුණු 9 ක්, ඇල්ලීමක් සහ එකක් ලබා දෙයි\nකම්පනය.ද සිල්වාගේ පිතිකරණය ජාත්යන්තරව ආකර්ෂණය කර ගැනීමට අසමත් විය\nඕනෑම ඉන් පිටත ගමන් වලත මට්ටම, ඕනෑම දෙයක ද්විත්ව සංඛ්යා කරා ළඟා වීමට අපොහොසත් වීම\nඉනිම, ඒ පැත්තෙන් අතහැර දමා ඇත.ඔහුගේ නම එකතු කරන ලදි\nහිටපු ශ්රී ලාංකික ටෙස්ට් කඩුලු රකිපත්වීම්වල නිරතුරුවම පුළුල් කිරීම.\n(සසප, ජොහාන් පී ජයසේකර විසින් දායක වූ\n1999)",
    "Ruwan Kalpage": "චේලටර් කල්පගේ සටන්කරුවෙක් ක්රීඩාවේ කෙටි ආකෘතියෙන් හස්ත කර්මාන්ත ශාලාවක් වී ඇති අතර, ඔහුගේ සිත් ඇදගන්නා සුළු නිපුණතාවය නිසා ඔහු වටිනා උපයෝගිතා ක්රීඩකයෙකු බවට පත්වේ.ටෙස්ට් ක්ෂේත්රයේදී ඔහුගේ පෙනුම ඔහුගේ පෙනුම කණ්ඩායමේ නිර්වචක කාර්යභාරයක් සොයා ගැනීමට වෙහෙස මහන්සි වී වැඩ කළ අතර, පිතිකරුවෙකු හෝ පන්දු යවන්නෙකු ලෙස තනතුරක් අවශ්ය වේ.පහළ ඇණවුමේ බලහත්කාරයෙන් තට්ටු කිහිපයක් වාදනය කළ හැකි වාමාංශික පිතිකරුවෙකුට, දේශීය මට්ටමින් ඔහු අව්යාජ පිතිකරුවෙකු ලෙස සැලකිය හැකිය.ඔහුගේ කැනී ඕර්ස්ටයින් කැප්ටන්ට සඳහා ප්රයෝජනවත් විකල්පයක් සපයන අතර, ජාත්යන්තර මට්ටමේ ඔහුගේ පන්දු යැවීමේදී ඔහුගේ පන්දු යැවීමේ හැකියාව ඇති නමුත් ඔහුගේ පන්දු යැවීමේ හැකියාව ඇත.කල්පේගේ කෙතේ solid න රංගන ශිල්පියෙකු වීමෙන් කල්පජ් ඔහුගේ පිළිවෙලට ඇති කර ගැනීමට ප්රශංසා කරයි.ටෙස්ට් මට්ටමින් ඔහුගේ පන්දු යැවීම තරග 11 කදී ඉනිමක කඩුලු 2 කට වඩා ගැනීමට අපොහොසත් වී ඇති අතර එය effective ලදායී ආයුධයක් නොවීය.පිතිහරඹය සමඟ ඔහු සටන්කාමී ඉනිමක් ක්රීඩා කළ නමුත් පහළ ඇණවුම් පිතිකරුවෙකු ලෙස සැලකේ.ඔහු ජාත්යන්තර තලයේ ඉස්සරහගේ මිරිකීම්වල රැඳී සිටි අතර ඔහුගේ අවස්ථාවන් උපකල් චන්දනා බිහි වීමෙන් සීමා විය.1999 දී තරගය අත්හිටුවීමෙන් පසු ඔහු 2001 දී සිය චරිතය භාර ගැනීමට පෙර ශ්රී ලංකාවේ ක්ෂේත්ර පුහුණුකරු ලෙස ට්රෙපල්ටිව්ස් මෙම කාර්යය දිගටම කරගෙන ගිය නමුත් 2004 දී ඔහු පරිගණකය ලෙස පත් කරන විට ද්විත්ව කාර්යභාරයක් ඉටු කළේය.කණ්ඩායමේ විශ්ලේෂක.ඔහු 2006 අප්රියෙල් මාසයේදී ස්පෙනර් සායනයේ ප්රධාන පුහුණුකරු බවට පත් වූ අතර කණ්ඩායමක් පුහුණු කළ අතර 19 න් පහළ U-15 කණ්ඩායම් ද පුහුණු විය.2008 මාර්තු මාසයේදී බංග්ලාදේශයේ ජාතික ක්රිකට් ඇකඩමියේ ඉහළ කාර්යසාධන ප්රධාන පුහුණුකරු ලෙස ඔහු පත් කරන ලදී.ජොහාන් පී ජලායාසෝස් සහ සාඩර්වේක්",
    "Pubudu Dassanayake": "පළමු තේරීම් පාලකයා ලෙස කෙටි කාල පරිච්ඡේදයකට පසුව, දසනායක\nරඳවා තබා ගැනීම සඳහා ක්රීඩකයන්ගේ දිනෙන් දින වැඩි වන ලැයිස්තුවට සම්බන්ධ විය\nතනතුර.ඔහුගේ පිතිකරණය ජාත්යන්තර ප්රමිතීන්ට වඩා පහළින් පහත වැටුණි\nඑය ඔහු වෙනුවට ආදේශ කිරීමට හේතු විය.ඉල්ලූ විට මෙය තිබියදීත්\nදකුණු අප්රිකානු වේගයේ තර්ජනයේ තර්ජනයට සම්බන්ධ වීමට පළමු අතේ පන්දුව\nඉහළ ඇණවුම කඩා බිඳ දමා ඇති ප්රහාරය, ඔහු එසේ කළේය\nධෛර්යය.චමාරා ඩුනුසිංහ සංචාරය සඳහා කැමති වූ පසු\nනවසීලන්තය 1994/95 දී දසනායක නැවත පැමිණියේය\nජාත්යන්තර තලය, එංගලන්තයට එරෙහිව ශ්රී ලංකාව 'ඒ' නියෝජනය කරයි\n1998 දී. (ජොහාන් ජයසේකර, බෙන්ජ්ඩ්අෆ්අයිම්ස්.කොම්.ඒ.ඒ.ඒ.ඒ.",
    "Piyal Wijetunge": "එම කණ්ඩායමේම ක්රීඩා කළ ශාන්ත අන්තෝනි විද්යාලයේ පාසල් ළමුන් තිදෙනෙක් ශ්රී ලංකාව නියෝජනය කළහ.වමතින් ඕතඩොක්ස් මන්දගාමී පන්දු යවන්නා වන විජෙතුංගේ, වෙනත් පාසල්වල පිතිකරුවන් බිය ගන්වමින් මුත්තයියා මුරලිදරන් සමඟ දැඩි හවුල්කාරිත්වයක් ඇති කර ගත්තේය.තිදෙනා හි අනෙක් සාමාජිකයා වූයේ රුවන් කල්පගේ ය.ඔහුගේ සෙසු කණ්ඩායම් සහකරුවන් මෙන් නොව, විජෙතුංගේ කීර්තිමත් ජාත්යන්තර වෘත්තියක් සඳහා නොපැමිණෙන බව එක් පරීක්ෂණයක් පමණක් ක්රීඩා කළේය.අමතක නොවන පෞද්ගලික මොහොතක විජෙට් නාශක දකුණු අප්රිකාවට එරෙහිව දකුණු අප්රිකාවට එරෙහිව ඔහුගේ හිටපු පාසල් ළමුන්ගේ කණ්ඩායම් සහකරුවන් සමඟ ටෙස්ට් තරගය ආරම්භ කළ අතර එහිදී ඔහු කඩුලු 2 ක් දැවී ගියේය.කෙසේ වෙතත්, අවසන් දිනයේදී ශ්රී ලංකාව ජයග්රහණය කරා යා නොහැකි විය.\nජොහාන් පී ජයසේකර",
    "Kumar Dharmasena": "1994 දී දකුණු අප්රිකාවට එරෙහිව ධර්මසේන ජාත්යන්තර ක්ෂේත්රයට පැමිණියේය. කාලයත් සමඟ ඔහු ප්රයෝජනවත් මැද පෙළේ පිතිකරුවෙකු ලෙස සංවර්ධනය කළ අතර එය ශ්රී ලංකා එක්දින සංචිතයේ නිත්ය ස්ථානයක් සහතික කළේය. ඔහුගේ වෘත්තිය 1998 දී ඕවල් ටෙස්ට් පරීක්ෂණයෙන් පසුව නැවතුමක, අයි.සී.සී. ඔහුගේ පන්දු යැවීමේ ක්රියාව ගැන ප්රශ්න කළ අවස්ථාවලදී නතර විය. කෙසේ වෙතත්, 2000 ජූලි මාසයේදී ශ්රී ලංකා ක්රිකට් මණ්ඩලය විසින් නැවත ක්රීඩා කිරීමට ඔහුව ඉවත් කරන ලදී. ඔහු පසුව එක්දින කණ්ඩායම සඳහා නිතර එක්දින කණ්ඩායම සඳහා, විශේෂයෙන් ගෘහස්ථ තරඟ වලදී ක්රීඩා කළ නමුත් එය ක්රීඩා කළ ටෙස්ට් ක්රිකට් ක්රීඩාවට පමණක් ක්රීඩා කළේය. 2006 නොවැම්බරයේදී විනිසුරු වෘත්තියක් කරගෙන යාම සඳහා ඔහු තරඟකාරී ක්රිකට් ක්රීඩාවෙන් විශ්රාම ගොස් ඔහුගේ ජාත්යන්තර විනිසුරු ලෙස 2009 දී සිය ජාත්යන්තර විනිසුරු මලපාලම 2011 දී පැවැත්විණි. ඔහු 2011 දී ඉන්දියාවේ පැවැත්වූ ලෝක කුසලානය සඳහා තෝරාගත් විනිසුරු 18 දෙනෙකුගෙන් යුත් කොටසකි ඉන්දියාවේ මිර්පූර්හි ඉන්දියාව, එම වසරේම අයිසීසී විනිසුරුවන්ගේ ප්රභූ කමිටුවට උසස් කරන ලදී.\nචාලි ඔස්ටින්",
    "Dulip Samaraweera": "දුලිප් සමරාවිරා යනු අධිෂ් standard විවෘත ආරම්භක පිතිකරුවෙකි.චන්දිකා හෘරුසිංට ආදේශකයක් ලෙස තෝරාගත් සමරාවීර මහතා තවදුරටත් තේරීමට වරෙන්තු කිරීමට ඇති සීමිත අවස්ථාවක ප්රමාණවත් නොවීය.ඔහු ලකුණු 16 සහ 5. ලකුණු 16 ත් 5 ක් ලබා ගත් බව ඔහු විසින් ලකුණු 16 සහ 5. ලකුණු 16 ක් ලබා ගත්හ.දේශීය මට්ටමින් Bater න පිතිකරුවෙකු ශ්රී ලංකාව සඳහා ඔහු අවශ්ය ප්රමිතියට වඩා පහත වැටුණි.ආරම්භක පන්දු යවන්නන් ඔබ දුටු විට ඔහු පූර්ණ වාසි ලබා ගැනීම සඳහා අවශ්ය ආරවුල් ප්රදර්ශනය කිරීමට අපොහොසත් වූ ඔහු ටෙස්ට් ඉනිම 14 ක 50 ක් සමත් වීමට අපොහොසත් විය.ඔහු අතිවිශිෂ්ට ඩොමෙටිනර් කෙනෙක් විය.ජොහාන් පී ජයසේකර",
    "Ravindra Pushpakumara": "1994-95 දී රවීන්ද්ර පුෂ්පකුමාර 1994-95 දී ශ්රී ලංකා ක්රිකට් ස්ථානයට පැමිණි අතර, ඔහු පාකිස්තානයට එරෙහිව මහනුවර පාකිස්තානයට එරෙහිව මහනුවරට එරෙහිව තරගාවලියක් ලැබුණු අතර, 19 න් පහළ කණ්ඩායම මැලේසියාව සහ සිංගප්පූරුවට අනුභව කළේය.ඔහු යම් කාලයක් තිස්සේ මතුවූ වේගවත්ම ශ්රී ලාංකික පන්දු යවන්නා වූ අතර වහාම චමින්ද වාස් සඳහා පරිපූර්ණ නව බෝල සහකරුවෙකු ලෙස පැමිණියේය.ශක්තිමත්, පුළුල් උරහිස් ශරීරයක් ඇති ආශීර්වාද සහිතව, ඔහු දිගු කලකින් යුක්තව බලවත්, මාංශ පේශි ක්රියාවක් සමඟ බැඳී සිටියේය.නමුත් ඔහුගේ කුට්ටිය නොතකා ඔහුට අවශ්ය විචල්යතාවය සහ කප්පාදු කිරීම, විශේෂයෙන් උප කොල්ගේඩ්ගේ දැවැන්ත පෘෂ් on යේ ඉහළ පංතියේ ක්රීඩකයන්ට කරදර කිරීම සහ ජාතික සංචිතයේ නිත්ය නැංගුරමකට ගොදුරු වීමට ඔහු අසමත් විය.2001 දී ආසියානු ටෙස්ට් ශූරතාවලියේදී ඔහුගේ අවසන් ගමන බංග්ලාදේශයට විරුද්ධ ය.\nචාලි ඔස්ටින් (ජූලි 2004)",
    "Sanjeeva Ranatunga": "ඔහුගේ සුප්රසිද්ධ වැඩිමහල් සහෝදරයා මෙන් නොව සංජීවා රණතුංග කිසි විටෙකත් ජාත්යන්තර මට්ටමින් උසස් උසකට නොගැලපෙන නමුත් ඔහු දක්ෂ වාමාංශික පිතිකරුවෙකු දේශීය මට්ටමින් විය. පාසලේ මට්ටමින් ඔහු දැඩි ලෙස ලකුණු ලබා ගැනීමෙන් පසුව ඔහු 1994 දී පාකිස්තානයට එරෙහි නිවාස මාලාව සඳහා නායකයා ලෙස නායකත්වය දුන්නේය. ඔහුගේ දෙවන තරගය, නමුත් ඔහුගේ ස්වරූපය 1996 ජනවාරියේදී ඔහුගේ එක්දින තරගයේදී ඔහුගේ එක්දින තරගයේදී ක්රීඩා කළේය. 59.71 - පාකිස්තානය, පාකිස්තානය සහ ඕස්ට්රේලියාව නවසීලන්තය සංචාරය කිරීමට අවස්ථාව ලබා දෙන ලදී. කෙසේ වෙතත්, ජාත්යන්තර ක්රිකට් ක්රීඩාව දුෂ්කර බාධකයක් වන අතර රණතුංග පැත්තෙන් අතහැර දමා ඇත. ශ්රී ලංකාවේ බටහිර ඉන්දීය කොදෙව් පිල වෙනුවෙන් ශ්රී ලංකාවේ සංචාරය සඳහා 1997 ජුනි මාසයේදී තරමක් මතභේදාත්මක මතකයක් ඇති වූ නමුත් රංගතුංගගේ ජාත්යන්තර ජීවිතය අවසන් කිරීම සඳහා එක් දුප්පත් තරගයක් විය.\nක්රික්ෆෝ කාර්ය මණ්ඩලය",
    "Chaminda Vaas": "චමින්ද වාස් පහසුවෙන් ශ්රී ලංකාවේ වඩාත්ම විනිවිද යන හා සාර්ථක නව බෝටු පන්දු යවන්නාට පහසුවෙන් සිදුවී ඇති අතර ඔහු තම රටට හොඳින් සේවය කර ඇත. ඔහු පන්දුව නිපුණතාවයෙන් පෙළෙන අතර, ඔහුගේ වෙළඳ ලකුණ අභාවප්රාප්ත දර්ශකය වීම. කෙසේ වෙතත්, ඔහු පරිස්සමින් වෙස්වළාගත් ඕෆ්කුටරයක් ​​ද පාරවල් කරන අතර මෑතකදී ඔහුගේ අවි ගබඩාවට මෑතකදී ප්රතිලෝම ලෙස මාරු වී ඇති අතර, ඔහුගේ අවි ගබඩාවට, ඔහු ස්ථාවර කඩුලු ලබා ගන්නා කුසලතාවන්ගෙන් යුත් තට්ටුවක් ගත් කුසලතාවන් දරා ඇත. ඔහු නේපාලයේ හරිත තත්වයන් යටතේ හරිත තත්වයන් යටතේ නවසීලන්තයේ නාවිකයින් බලහත්කාරයෙන් විදේශ පරීක්ෂණයක් සඳහා ශ්රී ලංකාවට ලබා දුන්නේය. 2001-02 දී ඔහු බටහිර ඉන්දීය කොදෙව් පිල 3-0 කොදෙව් පිල කීය කඩුලු 10 ක් දවා ගත් අතර, එක්සත් අන්න සර්රාන්ට් හි පැවති තරඟයකදී කඩුලු 14 ක් දවා ගත් දෙවන වේග පන්දු යවන්නා වන අතර එය දෙවන වේග පන්දු යවන්නා වන අතර එය කඩුලු 14 ක් දවා ගත්තේය. පසුව ඔහු පළමුවන එක්දින තරගය අටෙන් අටක්, පිස්සුවට එරෙහිව, හැට්ට්රික් ඇතුළත් විය. 2003 ලෝක කුසලානයේදී බංග්ලාදේශයට එරෙහි පළමු පන්දු තුන සමඟ තොප්පි උපක්රමයක් ද ඔහු කියා සිටියේය. 2005-06 දී ඉන්දියාවට එරෙහි ටෙස්ට් තරගවල කඩුලු 300 ක සන්ධිස්ථානයක් වන වාස් එක්ස්බාවබ්වේ සංචාරයේදී සමත් වූ අතර එය සමත් විය. සමාරම්භක අයිසීසී සම්මාන උළෙලේදී 2004 දී ඔහු සිය දක්ෂතා සඳහා කල් ඉකුත් වූ පිළිගැනීමක් ලබා ගත්තේය. වාස් පහසුවෙන් ශ්රී ලංකාවේ දෙවන - වඩාත්ම සාර්ථක පන්දු යවන්නා - මුත්තයියා මුරලිදරන් - ක්රීඩාවේ ආකාරවලින්. ඔහුගේ පිතිකරණයට ඔහුගේ ප්රවේශය සමානව අවංක වන අතර මෑත වසරවලදී ඔහු ක්රමයෙන් ප්රයෝජනවත් තුන් ඉරියව් ක්රීඩකයෙකු ලෙස සැලකිය යුතු ලෙස හඳුනාගෙන තිබේ. ඔහු සිය මංගල ශතවර්ෂයේ, බංග්ලාදේශයට එරෙහිව පරීක්ෂණ 97 ක් බලා සිටි අතර වැඩි කල් නොගොස් පරීක්ෂණ 100 ක් හෝ ඊට වැඩි කාලයක් ක්රීඩා කළ තුන්වන ශ්රී ලාංකිකයා බවට පත්විය.2008 අගෝස්තු මාසයේදී වාස් තවත් සන්ධිස්ථානයක් ඔහුගේ 400 වන එක්දින එක්දින කඩුල්ල ලබා ගැනීම සඳහා කොළඹ තාරාවෙකු සඳහා හසු වූ විට, සුවිශේෂී ලකුණට ළඟා වූ සිව්වන පන්දු යවන්නා බවට පත්වේ.2009 ජූලි මාසයේදී වාස් විශ්රාම යන නිවේදනයකින් නිවේදනය කළ නමුත් 2011 ලෝක කුසලානය තෙක් තමා එක්දින තරග කරුවන් සහ විස්සයි 20 ක රටක් ක්රීඩා කරන බව පැවසීය.",
    "Chamara Dunusinghe": "1994-95 නවසීලන්තයට 1994-95 සංචාරය සඳහා ශ්රී ලංකා ටෙස්ට් පාර්ශවය තුළ ශ්රී ලංකා ටෙස්ට් පාර්ශවය තුළ සාර්ථක ප්රේරණයක් නාස්ති කිරීම සිදු කළේය.නාලියර් හි ඔහුගේ ටෙස්ට් තරගයේදී ඔහුට නිවසින් පිරි හතුම් හතක් සම්පූර්ණ කර දෙවන ඉනිමේදී 91 ක් රැස් කළ අතර පසුව දෙවන ඉනිමේදී 91 ක් රැස් කළේය.ආරක්ෂිත අත් යුගලයක් සමඟ, කඩුලුම් දැරූ තනතුර පිරවිය හැකි ක්රීඩකයෙකු සොයාගෙන ඇති බවක් පෙනෙන්නට තිබුණි, මෙතරම් කාලයක් පැති දුර්වල ලක්ෂ්යය විය.කෙසේ වෙතත්, පසුව පාකිස්තානයේ සංචාරය කරන විට, වේගවත් පන්දු යවන්නන් ඔහුගේ පිතිකරණ encies නතාවයන් හෙළි කළහ.එසේ තිබියදීත්, කඩුල්ල පිටුපස ඔහුගේ රංගනයන්.සංචාරයට තෝරාගෙන ඇත\nඕස්ට්රේලියාව, රොමේෂ් කළුවිටාරණ ජාත්යන්තර තරඟ සඳහා කැමති විය.දුනුසිංහ උසස් පාලකයා වූ බව පිළිගත් නමුත් තේරීම් කාරක සභාව අපේක්ෂකයාට වඩා ශක්තිමත් පිතිකරුවන් සමඟ විවෘත කළ අතර, වසර දෙකක් ඇතුළත ඩූසිංහ මහතා දේශීය ක්රිකට් ක්රීඩාවෙන් පවා මැකී ගොස් ඇත.\nජොහාන් පී ජයසේකර",
    "Jayantha Silva": "වමතින් දඟ පන්දු යවන්නා, ජයන්ත සිල්වාගේ ටෙස්ට් වෘත්තීය ජීවිතය වෙනස් කොටස් දෙකකට බෙදී ගියේය.සිම්බාබ්වේ ගොදුර සේවය කරන අතර ඔහු මාරාන්තික වූ අතර ඔහු ඔවුන්ට එරෙහි පරීක්ෂණ තුනකින් ඔහු 1996-97 දී කොළඹට තරග ජය ගැනීමේ රංගනයන් කිහිපයක් ඇතුළුව කඩුලු 16 ක් දවා ගත්තේය.එහෙත් ඉන්දියාව, ඕස්ට්රේලියාව සහ පාකිස්තානය එරෙහි පරීක්ෂණ හතරකදී සිල්වාට ලැබුණේ ලකුණු 121.25 ක සාමාන්ය 121.25 කදී කඩුලු 4 ක් පමණි.ගෘහස්ථ කවයන්හි වාමාංශික අවි ගබඩාවල ප්රක්ෂේපණය කිරීමත් සමඟ සිල්වාගේ කාලය ගෙවී ගොස් ඇති අතර ඔහු වයස අවුරුදු 28 ට පෙර පළමු පන්තියේ ක්රීඩාවෙන් අතුරුදහන් විය.\nමාටින් විලස්සන්",
    "Nuwan Zoysa": "තාර කල්පලක්, රිද්මයානුකූල ධාවන පථයක් සහ ක්රියාව සහිත වම් අත මැහුම් පන්දු යවන්නෙකු, සොයිසා පොරොන්දුවක් ලබා දී ඇති නමුත් ඔහුගේ වෘත්තිය මෙතෙක් තුවාල වලින් පීඩා වින්දා.2002 දී එංගලන්තයට බලාපොරොත්තු සුන් වූ චාරිකාවකින් පසුව ඔහු ඉවතලන ලද නමුත් ඔහු වෙහෙස මහන්සි වී නැවත ඇසුරු කළේය.වැදගත්ම දෙය නම්, ඔහු නැවත දකුණු පසින්, තමාට වඩා ප්රබල බලවේගයක් වන ආයුධයක් වන ආයුධය තුළට ගෙන යන දරු ප්රසූතිය සමඟ ආපසු පැමිණියේය.පන්දුවෙහි ස්වාභාවික වැඩ වර්ජකයෙකු වන ඔහු ද ප්රයෝජනවත් පහත් පෙළේ ආ roke ාතනයක් ලෙස ඉස්මතු වී තිබේ.2003 දී කෙන්යාවේ සංචාරයක් අතරතුර, ඔහු 2003-04 දී ඕස්ට්රේලියාවට එරෙහි එක්දින තරගාවලියේදී ජාත්යන්තර ක්රිකට් ක්රීඩාවට පැමිණෙමින් සිටි අතර, 2003-04 දී ඕස්ට්රේලියාවේ එදිනම එක්දින තරගාවලියේදී සිය ජාත්යන්තර ක්රිකට් ක්රීඩාවට පැමිණීම ෂියාසා ඔහුගේ පිතිකරණ විභවය තවදුරටත් අවධාරනය කළේයඅවසාන තරඟයේදී 47 නොබි.ඔහුගේ පන්දු යැවීම ආරම්භ වූයේ 2004-05 දින එක්දින තරගාවලියේදී දකුණු අප්රිකාවට එරෙහිව කඩුලු පහක කඩුලු පහක කඩුලු පහක කඩුලු පහක වැතිරීමයි.කොළඹ පිහිටි එස්එස්සී හි එස්එස්සී සමඟ සම්බන්ධ වීමට ඔහුට ධෛර්යමත් කළ අර්ජුන රණතුංග විසින් පළමුවෙන්ම පැල්ලම් ලැබූ ඔහු 1996-97 නවසීලන්තයේ සංචාරයේදී සිය මංගල්යය සිදු කළේය.1999-2000 සිට හරාරේහි සිම්බාබ්වේට එරෙහිව තොප්පි ට්රේට් හර්ක්රික් එකක් ලබා ගැනීමේ දුර්ලභ කාර්යභාරය සොයිසා සිය අටවන ටෙස්ට් තරගයේදී සොයිසා ලබා ගත්තේය.ඔහුගේ ගොදුරු වූවන්ට එරෙහිව ඉහළ පෙළේ පිතිකරුවන් ද සිදු කර ඇත - ට්රෙවර් ග්රිපර්, මරේ ගුඩ්වින් සහ නීල් ජොන්සන්.\nචාලි ඔස්ටින් (2004 සැප්තැම්බර්)",
    "Sajeewa de Silva": "සජීවා ද සිල්වා ඔහුගේ තේරීමෙන් උපරිම ප්රයෝජන ගත්තේය\nටෙස්ට් මාලාවේ ආදර්ශවත් කාර්ය සාධනයක් සහිත ජාතික පැත්ත\nකොළඹ පාකිස්තානයට එදිරිව.එහෙත්, ඔහු විසින් එකක් නිපදවා නැත\nඑතැන් සිට ඔහු තවමත් ඉතා කැපී පෙනෙන පරීක්ෂණ දායකත්වය තවමත් පවතී\nප්රයෝජනවත් එක් දින ක්රිකට් ක්රීඩකයෙක්.පරීක්ෂණ ප්රමිතීන්ට අනුව ඉක්මන් නොවේ,\nසජීවා තව දුරටත් ස්විං සහ විශිෂ්ට රේඛාවක් පවත්වාගෙන යයි\nසහ දිග.ඔහු එක්දින තරගයේදී වාර්තා කරමින් විශිෂ්ට කඩුල්ලක් තිබේ\nමෙම උපක්රමය බොහෝ විට පිතිකරුවන් චින්තනය සඳහා ගල්නයි\nඔවුන්ට ඔහුව ලකුණු ලබා ගත හැකිය.(ට්රෙස්ෂාඩ් සෝසා, 1997 නොවැම්බර්)",
    "Russel Arnold": "ඔහුගේ ක්රීඩාව තත්වයට අනුවර්තනය වීමට ආර්නෝල්ඩ්ට ඇති හැකියාව නිසා ඔහු සීමිත ඕවර ක්රිකට් ක්රීඩාවේ කදිම අංක 6 ක් වන අතර පරාර්ථකාමී ප්රවේශයක් මගින් ඔහු කණ්ඩායමේ සාමාජිකයින් විසින් රඳවාගෙන සිටින උචිත ආශ්රය පැහැදිලි කරයි.පීඩනය යටතේ සිසිල් හිසක් හඹා යාමේ යෙදෙන විට උපකාරී වන අතර ඔහු ආරක්ෂිත දෑතින් යුගලයක් සහිත ක්ෂේත්රයේ විශාල වටිනාකමක් එක් කරයි.ඔහුට ප්රයෝජනවත් ඕෆ්බ්රීක්ස් ද පන්දු යැවිය හැකිය.උස, කෝණික වාමාංශික වාමාංශිකයෙකු සහ රෝගියෙකු සමුච්චය වන ආර්නෝල්ඩ් ආරම්භක පිතිකරු ලෙස සිය ටෙස්ට් ජීවිතය ආරම්භ කළ නමුත් වසර දෙකකට පසුව, ඔහු සනත් ජයසූරියගේ සහකරු ලෙස මර්වන් අටපට්ටුට සිහිපත් කළේය. 2000 අග භාගය වන විට ලකුණු අඩු වූ ඔහු පහළ මැද ඇණවුමට වැටුණි. 2002 දී එක්සූරියගේ ස්වරූපය හා විශ්වාසය නැති වූ විට 2002 දී මෙම නියෝගයේ ඉහළින්ම ආර්නොල්ඩ් තවත් අවස්ථාවක් ලබා දුන් ඔහු ඕල්ඩ් ට්රැෆර්ඩ් හි එඩිතර මුදුනක ලකුණු 62 ක් සහ 109 ක් රැස් කළේය. 2003 ලෝක කුසලානයෙන් පසු දීර් long කාලයක් තිස්සේ පැවති සමගිය සඳහා ඇති වූ පසෙකින් ඔහු අසමත් වූ නමුත් ආර්නෝල්ඩ් ඕස්ට්රේලියාවට එරෙහි නිවාස මාලාවේ නැවත කණ්ඩායමට පිවිසියේය. සිම්බාබ්වේට එරෙහිව සිය අවසන් එක්දින තරගයේදී ලකුණු 51 ක් ලබා සිටියදී, ආර්නෝල්ඩ් 2004 ජූලි මාසයේදී එක්දින තරග සහ ටෙස්ට් කණ්ඩායම් වලින් ඉවත් කරන ලදී. නව දක්ෂතා සහ ආර්නෝල්ඩ්ගේ අනාගතය ටික කලකට අඳුරු විය. නමුත් ඔහු දැල්වල තම ක්රීඩාවේදී වෙහෙස මහන්සි වී වැඩ කළ අතර දේශීය ක්රිකට් ක්රීඩාවේ දැඩි ලෙස ලකුණු ලබා ගැනීමට පටන් ගත්තේය. අවසානයේදී, ඔහුගේ ප්රතිස්ථාපනය අප වෙනුවට ආකර්ෂණය වීමට අප ආදේශ කිරීම 2004 දෙසැම්බරයේ නවසීලන්ත සංචාරය සඳහා පසුබසිනු ඇත. කෙසේ වෙතත්, තිලකරත්න දිල්ෂාන්ගේ කැමැත්ත - ඔහු තම ස්ථානය වෙනුවෙන් සටන් කළේය. ඔහුගේ පරීක්ෂණ භූමිකාව පළමුවෙන්ම සිදු වූ නමුත්, 2006 දී එංගලන්තයේ දුර්වල සංචාරයකින් පසුව (ඕස්ට්රේලියාවට පොරොන්දු වූ උත්සාහයන් සමහරක්), ඔහු ඉවත දැමීය. නමුත් අත්දැකීම් කිසි විටෙකත් ප්රධාන තරඟාවලි වල වට්ටම් ලබා දිය නොහැකි අතර 2007 ලෝක කුසලාන සංචිතයේ ඔහු ස්ථානයක් සොයා ගත්තේය.ආර්නෝල්ඩ් ලෝක කුසලාන අවසන් තරඟයෙන් පසු විශ්රාම ගොස් නිල නොවන ඉන්දීය ක්රිකට් ලීගයට සම්බන්ධ වූ අතර චෙන්නායි සුපර්ස්ටාර් සහ අයිසී ලෝක XI.2008 සැප්තැම්බර් මාසයේදී ඔහු සහ තවත් ශ්රී ලාංකිකයන් සිව්දෙනෙකු පිළිබඳ තහනමක් ඔසවා ඇති අතර, ආර්නෝල්ඩ්ට දේශීය ක්රිකට් පිටරට ආපසු ගෙදර යාමට නිදහස තිබේ.ඔහු ගුවන්විදුලි විවරණයේ ද හිමි විය.\nචාලි ඔස්ටින් 2008 සැප්තැම්බර්",
    "Mahela Jayawardene": "ලකුණු සඳහා විශාල ආහාර රුචියක් සහ සන්සුන් නමුත් බලයලත් කපිතාන් එකක් සහිත අලංකාර, අලංකාර සහ මුළුමනින්ම ක්ලැසික් පිතිකරුවෙකි. ඒවා මහේල ජයවර්ධන වඩාත් හොඳින් විස්තර කරන ගුණාංග වේ.පිතිකරුවෙකු ලෙස ඔහුගේ ගුණාත්මකභාවය හුදෙක් ජාත්යන්තර දර්ශනයට ඇතුළු වූ විට පවා කිසි විටෙකත් සැකයක් නොගත්තේයත්, ජයවර්ධන වෙනුවෙන්, විශාලතම අභියෝගය වන්නේ මුල් කාලීන අතිශයෝක්තිය සාධාරණීකරණය කිරීමයි.ටෙස්ට් තරගවල සහ එක්දින තරග දෙකෙහිම ලකුණු 10,000 කට වඩා වැඩි සංඛ්යාවක් සහ ලෝක කුසලාන අවසන් පෙනුම ඇතුළත් නායකත්වයකින් යුත් නායකත්වයකින් - එය ප්රමාණවත් ලෙස වඩා වැඩි අභියෝගයක් බව ආරක්ෂිතව පැවසිය හැකිය.විශිෂ්ට අත් සම්බන්ධීකරණයක් සහ කදිම තාක්ෂණයකින් ආශීර්වාද ලත්, ජයවර්ධන කඩුල්ල වටා සිය ලකුණු රැස් කළේය.ඔහුගේ ප්රියතම ආ ro ාතයන් අතර තිස්සේ පැවැත්මේ පාදක ධාවකයයි - බොහෝ විට අවම අඩිපාරක් හෝ නිරවද්ය ස්ථානගත කිරීම සහ කාලානුරූපී, නමුත් ඔහු එකම කුළුණු ඉවත් කරයි, නමුත් තවත් කිහිපයක් ඔහු සමාන කුළුණක් ඇත.වඩාත්ම අමතක නොවන දේ, බොහෝ දුරට දඟ පන්දු යවන්නන්, වැඩි වශයෙන් දඟ පන්දු යවන්නන්, පන්දු යැවීමෙන් පන්දු යැවීම, පන්දුව සමඟ පන්දුව සමඟ සම්බන්ධතා ඇති කර ගන්නා විට, ඉක්මන් පන්දු යැවීමට එරෙහිව ද රඟපෑමේ දිදුලයි.ඔහුගේ කලාත්මකත්වය හැරුණු විට, ඔහුගේ පිතිකරණය ගැන ඔහුගේ කුසගින්නෙන් පෙනී සිටින්නේ විශාල ලකුණු 624 ක් වූ අතර, කුමාර් සංගක්කාර සමඟ ලකුණු 624 ක හවුල්කාරිත්වයක් ඇති වන අතර, කුමාර් සංගක්කාර සමඟ එක්ව හවුල්කාරිත්වය, නමුත් ඔහු ද නිතිපතා පරීක්ෂණය දෙවරක් උන් වහන්සේගේ සියගස්කම් ඉදිරිපත් කරයි.සහ 2010 දී ලෝක විස්සයි 20 තරගාවලියේදී සිම්බාබ්වේට එරෙහිව ඔහුගේ සියවසය නව ආකෘතියකින් සාර්ථක වන සාම්ප්රදායික ක්රමවල දීප්තිමත් උදාහරණයකි.ජයවර්ධන තම පරම්පරාවේ වඩාත්ම අලංකාර පිතිකරුවෙකු වන නමුත් ඔහුගේ වෘත්තියේ ප්රධානතම අඩුපාඩුව වන්නේ විදේශීය තත්වයන් තුළ ඔහුගේ සාපේක්ෂව අඩු වීමයි.ඕස්ට්රේලියාවේ ඕස්ට්රේලියාවේ, දකුණු අප්රිකාවේ සහ නවසීලන්තය යන හා නවසීලන්තය යන රටවල සාමාන්යය 35 ට වඩා අඩු නමුත් නිවසේදී ඔහු 60 ට වඩා සාමාන්යය.තම වෘත්තීය ජීවිතයේ දෙවන භාගයේදී ජයවර්ධන ගමනක් යන අතර තරගය හොඳින් කියවන අතර අවදානම් ගැනීමට බිය නොවීය.ඔහු යටතේ, එංගලන්තයේ සහ නවසීලන්තයේ පරීක්ෂණ ජය ගනිමින් ශ්රී ලංකාව ඔවුන්ගේ විසරණය කිරීමේ ප්රවේශය වැගිරෙව්වේය.ඔහු 2009 පෙබරවාරියේ නායකත්වය අත්හැර දමා, 19 වන දින දකුණු අප්රිකාවේ සංචාරයෙන් පසු තිලකරත්න දිල්ෂාන් සිට 2011-12 දක්වා දකුණු අප්රිකාවේ සංචාරයෙන් පසුව, ලණුව ඇන්ජලෝ මැතිව්ස් වෙත භාර දුන්නේය.ඔහුගේ සීමිත ඕවර පිතිකරණය වයස සමඟ වැඩිවන අතර, වැඩිවන ආ roke ාත ප්රර් on යක් මෙම කඩුල්ලේ නවෝත්පාදකවරයෙකු ලෙස පෙනෙන්නට තිබේ.2011 ලෝක කුසලාන අවසන් මහා තරගයේදී පන්දු 88 කදී නොදැවී ලකුණු 103 ක් ඔහුගේ සීමිත ඕවර සමකාලීනයම පැහැදිලි කර ඇති අතර, මීට වසර හතරකට පෙර එම තරඟාවලියේ අවසන් තරඟයේදී දැනටමත් සිය ශතවර්ෂයේ දී සිය ශතවර්ෂයක් බවට පත්ව ඇත.\nඑස් රාජේෂ් සහ එස්පීක්රිකින්ෆෝ කාර්ය මණ්ඩලය",
    "Lanka de Silva": "රොමේෂ් කළුවිටාරණ වෙනුවට ශ්රී ලංකාවේ ලංකා ද සිල්වා ශ්රී ලංකා පැත්තට පැමිණියේ පටු උරහිස් මත දැඩි බලාපොරොත්තුවේ ය.ඔහු අතේ ඇති කර්තව්යයට මෙන්ම විශිෂ්ට කඩුලු රකින්නෙකු ලෙස ඔප්පු කළ අතර, ඔහු පිතිකරණය සමඟ නිෆ්ටි ස්පර්ශයක් පෙන්වීය.නමුත් කඩුලු රකින්නාගේ ස්ථානය සඳහා තරඟකාරිත්වය දැඩි වූ අතර කලුවිතරණ ආපසු පැමිණි විට ද සිල්වාට තම ස්ථානය අහිමි වූ අතර එතැන් සිට තවත් අවස්ථාවක් නොලැබුණි.\nTreshad sosa",
    "Malinga Bandara": "මාලිංග බන්ඩාරා මහත් විභවයන්ගේ කකුලේ සිට කුඩා කල සිටම වෙන් කර ඇත. ඔහුගේ පාසල් ප්රසංගවල පදනම මත 1997 දී දකුණු අප්රිකාවේ 197 ලෝක කුසලානය සහ ශ්රී ලංකාව 1999 දී ඉන්දියාවට යන විට ඉන්දියාවේ සංචාරය සඳහා තෝරා ගන්නා ලදී. අතර ඔහු සිය පරීක්ෂණ ආරම්භ කළේය 1998-99 දී නවසීලන්තයට එරෙහිව නමුත් බලාපොරොත්තු සුන් කරවන සංදර්ශනයකින් මුහුදේ සැවොම මුහුදේ තබා ඇති අතර එය පසුව සලකා බැලුවේ නැත. එහෙත් 2005 මාර්තු මාසයේදී එංගලන්තයට එරෙහිව ලකුණු 11 කට කඩුලු 116 කට ලකුණු 116 ක් ලබා ගත් අතර, උපුල් චන්දනා වෙනුවට ආදේශකයක් සොයන විට ග්ලූස්ටර්ෂයර්ගේ අවධානයට ලක්විය හැකි විය. චන්දනා වැනි බන්ඩාරා ද ප්රයෝජනවත් පහළ පෙළේ පිතිකරුවෙකි. එක්දින සැකසීමේදී ස්ථිර ස්ථානයක් නියත වශයෙන්ම නියත ස්ථානයක් බවට පත් කිරීමට ඔහුට නොහැකි වූ නමුත් මුත්තයියා මුරලිදරන් සඳහා වටිනා සහයෝගයක් ලබා දී ඇත. චන්දනාට පෙර කැරිබියන් සඳහා ලෝක කුසලාන ස්ථානයක් දිනාගත් ඔහුගේ සියලු වටලපතාවයි. ඔහු එක් ක්රීඩාවක් පමණක් ක්රීඩා කළ අතර එතැන් සිට පෙළගැස්වීමේ ස්ථානයක් සොයා ගැනීමට අරගල කර ඇත. කෙසේ වෙතත්, ඔහු චැම්පියන්ස් කුසලානය සඳහා කළ හැකි ය.",
    "Niroshan Bandaratilleke": "බණ්ඩරතිලෙක් සිය මංගල තරඟාවලියට එරෙහිව ක්ෂණික බලපෑමක් කළේය\nනවසීලන්තය නිවසේදී.ඔහුගේ වම් අත ඕතඩොක්ස් මන්දගාමී පන්දු යැවීම සපයා ඇත\nමුත්තියා මුරලිදරන් සඳහා පරිපූර්ණ සහයෝගය.බන්ඩටතිලකේ\nපන්දුව හරහා තල්ලු කර කඩුල්ලට තදින් පහර දුන්නා.ඔහු ගත්තා\nතරඟ රූප ග්රහණය කර ගැනීම සඳහා දුප්පත් ගාල් කඩුල්ලක වාසිය\n9/82 ක් වූයේ ඔහුගේ දෙවන ටෙස්ට් තරගය පමණි.සියලුම බණ්ඩරතිලකේ\nමාලාවේ කඩුලු 16 ක් අල්ලා ගත්තේය.කෙසේ වෙතත්, ඔහුට බාල වයස්කරුවෙකු සිටියේය\nසංචාර දෙකක් පමණක් ක්රීඩා කරමින් පහත දැක්වෙන සංචාරයට එංගලන්තයට බලපානය\nතරග.ශ්රී ලංකාවේ දෙවන ආසියානු ටෙස්ට් තරගය සඳහා නැවත සේවයේ පිහිටුවන ලදි\nපාකිස්තානයේ සිට ගඩාෆි ක්රීඩාංගණයේදී ඔහු ශූරතාව\nඩ්රේට් පරීක්ෂණයේදී කඩුලු 3 ක් දැම්මා.තරමක්\nBankaaratillecke සිට තේරීම්කරුවන් විසින් පුදුමයට ලක් කරන ලදී\nනිවාස මාලාව සඳහා ආරම්භක සංචිතයේ තෝරාගෙන නොමැත\nඕස්ට්රේලියානු පැත්ත.(ජොහාන් ජයසේකර, බෙන්ජ්@ප්රිමස්.කොම්.ඒ.ඒ.ඒ.ඒ.",
    "Suresh Perera": "සුරේෂ් පෙරේරා එක් කාලයක දී ශ්රී ලංකාවේ ස්වාභාවිකවම දක්ෂ ලෙස කරන ලද තුන් ඉරියව් ක්රීඩකයා ලෙස සැලකුවේ කොඩ් ඩේ ඩිවෝර් තම අමු විභවය සපුරාලීමට දීර් ulus අවස්ථාවක් ලබා දෙන ලෙසයි. දකුණු-හස්තයේ මධ්යම-වේග පන්දු යවන්නා, ඔහුගේ පැත්තෙන් කයිප්පි ක්රියාවෙන් ඔහුට පන්දුව පැද්දීමට ඉඩ දුන්නේය. බෝලයක් සඳහා ඔහුගේ කැපී පෙනෙන ඇස ඔහුට නිදහසේ ධාවනය කිරීමට ඉඩ දුන්නේය. 1998 දී ටෙස්ට් තරගයේදී ඔහුගේ ටෙස්ට් තරගයේදී එංගලන්තයට එරෙහිව කටයුතු කිරීමට තෝරාගත් විට ඔහු එංගලන්තයට එරෙහිව ශ්රී ලංකාවේ සංචාරය කිරීමට තෝරාගත් විට ප්රසිද්ධියේ නැගී සිටියේය. . පසුපසට ආතතිය අස්ථි බිඳීමක් සමඟ ක්රීඩාවෙන් වසරකට අධික කාලයක් තිස්සේ මෙය සිදු විය. 2000-01 කන්නයේ දී ඔහු සිය සමාජ ශාලාව වන සිංහල ක්රීඩා සමාජය සඳහා නැවත පැමිණි අතර පසුව ශ්රී ලංකාවේ (2001 ජූලි 2001) කොකාකෝලා කෝපය සහ ඉන්දියාවට එරෙහි කොකාකෝලා කුසලානය සඳහා නිරාහාරව සිටියේය ( 2001 අගෝස්තු). නවසීලන්තයට එරෙහිව ශ්රී ලංකාවට එරෙහිව ශ්රී ලංකාවේ නිවසට මඟ පෙන්වීම සඳහා ඔහු නොදැවී ලකුණු 56 ක් රැස් කළ නමුත් පන්දුව සමඟ මිල අධික බව ඔප්පු විය. ගාල්ලේ පළමු ටෙස්ට් තරගයෙන් පසු සැක සහිත ස්ටීව් බක්නර් සහ මහනුවරට මීළඟ ටෙස්ට් තරගය සම්බන්ධයෙන් සැක සහිත ක්රියාමාර්ගයක් ගැනීම සඳහා ඔහු විනිසුරු ස්ටීව් බක්රය විසින් වාර්තා කරන ලදී. අන්තර්ජාතික ක්රිකට් කවුන්සිලය විසින් ඉවත් කරන ලද ඔහු ශ්රී ලංකා සංචිතයේ මායිම් මත රැඳී සිටියේය.",
    "Ruchira Perera": "රුචිරා පෙරේරා යනු සජීවී හා දැඩි වැඩ කරන වාමාංශික පන්දු යවන්නාකි\nපන්දුව නැවත දකුණු අතට පැද්දීමට ඇති හැකියාව. ඔහු ස්වරූපය හා විශ්වාසය නැති විය\nශ්රී ලංකාවේ මුල් කන්නයේ සංචාරයේදී ඔහුගේ ක්රියාමාර්ගය ලේබල් කරන ලදී\nඑංගලන්තය 2002 දී. ඩ්රැල් ෆොස්ටර්ගේ උපදෙස් වලින් පසුව, පන්දු යැවීමේ පුහුණුකරුවෙකු සහ\nබටහිර ඕස්ට්රේලියාවේ විශ්ව විද්යාලයේ ජෛව යාන්ත්රික විශේෂ expert යා සිය වෙනස් කළේය\nබෙදා හැරීමේ ස්ථානයට මොහොතකට පෙර මැණික් කටුව\nඔහුගේ වැලමිට සමඟ ශ්රී ලංකා බලධාරීන්ගේ තෘප්තියට ඇති ගැටලුව. ඒත්\nඔහු දකුණට එරෙහිව 2002 අගභාගයේදී ජාත්යන්තර රාජකාරියට නැවත පැමිණියද\nඅප්රිකාව, ඔහුගේ ආත්ම විශ්වාසය සන්සුන් වූ අතර ඔහුට .ලදායීතාවය නැති විය. තුළ\nඊළඟ අවුරුදු දෙක ඔහු දැඩි ලෙස සටන් කළ නමුත් ක්රමයෙන් කලකිරීමට පත්විය\nමෑත පළාත් තරගාවලියට ලීග් ක්රීඩා කිරීම ගැන සලකා බැලීමේදී\nක්රිකට් එංගලන්තයේ ක්රිකට්. කෙසේ වෙතත්, ඔහු පළාත් සමයේදී ආකෘති පත්රය නැවත ලබා ගත්තේය\nතරඟාවලිය සහ තේරීම් කරුවන්ගේ අවධානය හසු වූ අතර 2006 එංගලන්ත සංචාරය සඳහා තෝරා ගන්නා ලදී. ඔහු සාමාන්යයෙන් කණ්ඩායම් හැඟීම සඳහා හොඳයි, කණ්නාඩි කාමරයට විශාල හාස්යයක් ගෙන ආ අතර, පන්දුව සමඟ පන්දුව සමඟ ඇති වූ කැපවීම නිසා ගෞරවයට පාත්ර වේ. සැප්තැම්බර් 2006",
    "Eric Upashantha": "එරික් කඩුල්ලට කරකවන ප්රවේශයක් සහිත ව්යාප්ති වේගවත් මධ්යම පන්දු යවන්නෙක්\nඋපශාන්ත ශ්රී ලංකා කණ්ඩායමේ මායාකාරියන් ගණනාවක් සඳහා වී තිබේ\nasons තු, නමුත් නොගැලපෙන රංගනයන් ඔහුව සිමෙන්ති සිට නතර කර ඇත\nස්ථිර තනතුර ශ්රී ලංකාවේ වේග පන්දු යවන්නන්ගේ හිඟය නොතකා. ඔහු ඔහුගේ හැදුවා\nසංචිතය සෑදීමෙන් පසු 1995//96 දී ශ්රී ලංකාවේ පාකිස්තානයේ සංචාරය පිළිබඳ එක්දින තරගයක්\nඕස්ට්රේලියාවේ ඉදිරියට යන සංචාරයේදී, නමුත් බලපෑමක් කිරීමට අපොහොසත් විය\nපින්තූරයෙන් ඉවත් කළා. ආසියානු ටෙස්ට් ශූරතාවලිය සඳහා සිහිපත් විය\n1999, එංගලන්තයේ පැවැත්වෙන ලෝක කුසලානයට ටික කලකට පෙර ඔහු තම එකම පරීක්ෂණයට ක්රීඩා කළේය\nඑස්එස්සී හි ඉන්දියාවට එරෙහිව දිනය. පළමු ඉනිමේදී ඔහු අරගල කළේය - මෙන්\nවෙනත් නාවිකයින් - දෙවැන්නෙහි දැඩි අක්ෂර වින්යාසයක්, 2-41 අල්ලා ගැනීම. තුළ\nපහත දැක්වෙන පෙප්සි කුසලානය අහෝසි කිරීම සඳහා ප්රමාණවත් ලෙස ආකර්ෂණය කර ගැනීමට ඔහු සමත් විය\nලෝක කුසලාන සංචිතයේ පිහිටීම. සාමාන්යයෙන් කැමති තත්වයන්ට\nමැහුම් පන්දු යවන්නන් ඔහුගේ රංගනය බලාපොරොත්තු සුන් කර ගත්හ. A සමඟ භාර දීමට අපොහොසත් වීම\nස්ථාවර ක්රියාමාර්ග ඔහු බෝලය පාලනය කිරීමට වෙහෙස මහන්සි වී නොගැලපෙන පන්දු යැවීම\nදිග සහ පන්දුව ඉසීම. නැවතත් ඔහු වාසිදායක, නැවත ක්රීඩා කිරීමට ආපසු ගියේය\nදේශීය තරඟයේ කෝල්ට්ස් ක්රිකට් සමාජය සඳහා. එතැන් සිට ඔහු පෙනී සිටියේය\n2001 පෙබරවාරි මාසයේදී ශ්රී ලංකාවේ නවසීලන්තයේ එක්දින තරගයේදී කෙටියෙන්\nතුවාල ලැබූ දිල්හාර සඳහා ආවරණයක් ලෙස එංගලන්තය සඳහා සංචිතයට කැඳවනු ලැබේ\nප්රනාන්දු (30.04.2002)",
    "Avishka Gunawardene": "සනත් ජයසූරිය, ගුණවර්ධනගේ අච්චුවේ පුපුරණ ද්රව්ය වාමාංශික වාරයකින් වල් පැත්තේ ජීවත් වේ. අර්ධ වශයෙන් අවසන් පූර්ව අප්රිකාවේ අර්ධ වශයෙන් පරාජයේ දී ඔහු 1998 දී පොදුරාජ්ය මණ්ඩලීය ක්රීඩා උළෙලේ සිරස්තල බවට පත් කළේය. මාස කිහිපයකට පසු, ජයසූරිය වෙනුවෙන් මුදල් ලබා ගැනීම, ඕස්ට්රේලියාවට එරෙහිව මෙල්බර්න්හිදී ලකුණු 311 ක් රැස් කිරීමට ධුවිතරණ ලකුණු 145 ක් රැස් කළේය. ඔහු 2000 දී අයිසීසී නොක්කු ඔස්සේ බටහිර ඉන් සීනීස් වලට එරෙහිව වෘත්තීය-හොඳම 132 ක් ලබා ගත්තේය. එහෙත් අපැහැදිලි කැක්කුම සහ නොගැලපීම සාමාන්ය නැංගුරමකට ගොදුරු වීම වළක්වා ගත්තේය. කෙසේ වෙතත්, 2004 දී නව තේරීම් කමිටුවක් පත් කිරීම ඔහුගේ සිහිපත් කිරීම සඳහා මග පෑදීය. ඔහු වෙනත් වාදක ක්රීඩකයින්ට වඩා ඉදිරියෙන් සිටී. අටපට්ටු ආසියා කුසලානයේ විවේක ගත් අවස්ථාවේ දී, අටපට්ටු විවේක ගත් අවස්ථාවේ දී ඔහු වැදගත් අර්ධ ශතකයක් ලබා ගත් අවස්ථාව ලැබුණි. ගුණවර්ධන 2005 නොවැම්බරයේදී ශ්රී ලංකාවේ ටෙස්ට් සංචිතය ඉන්දියාවට කැඳවනු ලැබූ නමුත් ඔහු භාර දුන් තරග දෙක තුළ කිසිදු නෝට්ටුවක් නොවීය. ඔහු එක්දින සංචිතය නවසීලන්තයට නවසීලන්තයට ගොස් ඇති නමුත් ඔහු ක්රීඩා කළ එක් ක්රීඩාවේදී එය අසාර්ථක විය. 2007 සැප්තැම්බර් මාසයේදී ගුණවර්ධන නිල නොවන ඉන්දීය ක්රිකට් ලීගයට සම්බන්ධ වූ අතර ඔහුගේ ජාත්යන්තර ජීවිතය effectively ලදායී ලෙස අවසන් කළේය. 2008 සැප්තැම්බරයේ ඔහු සහ තවත් ශ්රී ලාංකිකයන් සිව්දෙනෙකු සහ තවත් ශ්රී ලාංකිකයන් සිව් දෙනෙකුගෙන් යුත් තහනමක් ඔසවන ලද අතර ගුණවර්ධනට දේශීය ක්රිකට් පිටරට ගෙදර යාමට නිදහස තිබුණි.\nචාලි ඔස්ටින් (2008 සැප්තැම්බර්)",
    "Upul Chandana": "උපුල් චන්දනාගේ වෘත්තීය ජීවිතය 2002 දී මල මල් පිපීමට පටන් ගත්තේ 2002 දී කෙන්යාවට එරෙහිව ශ්රී ලංකා කපිතාන් කපිතාන්වරයාගෙන් ඉල්ලා සිටින විටය. ඔහුගේ පිතිකරණය නව අධිකාරියක් සහ ඔහුගේ පන්දු යැවීම වඩා වැඩි විභවයක් ලබා ගත් අතර, එම නිල නොවන ටෙස්ට් තරගාවලියේදී පන්දුවට පහර දීම සහ පන්දුවට යාම යන දෙකම නැගිටින විට. තරගයට පෙරළීමේදී සහ සිස්ලිං වායු බෝවන වායු බෝවන වායු බෝවන පන්දුවට පහර දෙන පුදුමාකාර අතිරේක ක්ෂේත්රයක්, ඔහු 2003 මැද භාගයේ එක්දින කණ්ඩායමේ ඇඳුමෙන් වසර ගණනාවක් තිස්සේ දහවල් ගණනාවකට පෙර පැවැත්වූ අතර එක්දින සංචිත දෙකෙන්ම විය බ්රිජෙට් ටවුන් හි පැවති ඉනිමකින් පසු ජයග්රාහී ඉනිමකින් පසුව. මැද පෙළෙහි ඔහුගේ පුපුරන සුලු ගුණාංග නිසා ඔහු සීමිත ඕවර ක්රීඩාවේ වත්කමක් බවට පත් කළේය. නමුත් ඔහුගේ පන්දු යැවීම ද අඛණ්ඩව වැඩිදියුණු වී ඇති අතර, ඔහු පරීක්ෂණ සඳහාද වඩා හොඳ ඔට්ටුවක් බවට පත් කරයි. 2004 දී මුරලිගේ මුදල් ආපසු ගැනීම 2004 දී ඕස්ට්රේලියාවට ආපසු ගැනීම ඔහු සම්බන්ධයෙන් අමතර වගකීමක් ඇති කළ අතර ඔහු හොඳින් ප්රතිචාර දැක්වීය. වර්ෂය තරම් දියුණු වූ විට, ඔහුගේ කකුල් ගණය, සාම්ප්රදායිකව පුපුරන සුලු දේවලට වඩා ප්රබෝධය ලබා දුන්නේය. වැදගත්ම දෙය නම්, ඔහුගේ රේඛාව සහ දිග තද කර ඇත. 2004 දී ආසියානු කුසලානය අවසන් වන විට ඔහු එක්දින කණ්ඩායමේ වැදගත් කඩුලුකරන්නෙකු බවට පත්විය, නමුත් ඔහුගේ ස්වරූපය පහව ගොස් 2005 ජූලි මාසයේදී එක් වරක් එක්දින පෙනුමක් ලබා ගත් බව 2007 ජූලි මාසයේදී විශ්රාම ගියේය ඉක්මනින්ම. පසුව චන්දනා කොල්කටා කොටින් සහ අයිසීඑල් ලෝක XI සඳහා වන නිල නොවන ඉන්දීය ක්රිකට් ලීගයට බැඳුණි. 2008 සැප්තැම්බර් මාසයේදී ඔහු සහ තවත් ශ්රී ලාංකිකයන් සිව්දෙනෙකු සහ තවත් ශ්රී ලාංකිකයන් සිව්දෙනෙකු එල්ල කළ බව චන්දනාට දේශීය ක්රිකට් පිටරට ගෙදර සෙල්ලම් කිරීමට නිදහස තිබුණි.\nචාලි ඔස්ටින් 2008 සැප්තැම්බර්",
    "Rangana Herath": "රංගන හේරත් යනු ඕතඩොක්ස් වමේ මුත්රිතරන් මහතාගෙන් ටෙස්ට් තරගවලදී ශ්රී ලංකාවේ ප්රධාන කඩුලු ලබා ගැනීමේ පන්දු යවන්නා ලෙස පවරා ඇති ඕතඩොක්ස් වමතින් දඟ පන්දු යවමින්.වමතින් දඟ පන්දු යවන්නෙකු ලෙස, ඔහුගේ ශක්තීන් ඔහුගේ නිරවද්යතාවය සහ දිගු අක්ෂර වින්යාසය පන්දු යැවීමේ ඔහුගේ නිරවද්යතාවය වන නමුත් ඔහු 'අභිරහස්' බෝලයක් එකතු කර ඇති අතර, එය ඉක්මණින් සහ දකුණු පසින් නැවත අකාර්යක්ෂමතාවක් ලබා දී ඇත.ඔහුගේ මුල් කාලයේ ඔහු මුරලිදරන් සඳහා ආධාරක ක්රියාවක් ලෙස පෙනී සිටියේය.නමුත් එම කාලය තුළ ඔහුගේ කාර්යභාරය දිගු අක්ෂර වින්යාසය අවහිර කිරීම සහ මුරලිට තම මැජික් එකේ මැජික් වැඩ කිරීමට ඉඩ සලසයි.මුරලිගේ විශ්රාම යාමෙන් පසු හේරත් ශ්රී ලංකාවේ පන්දු යවන්නා වන අතර එය ශ්රී ලංකාවේ පන්දු යවන්නා විය.ඔහුගේ බියජනක නිරවද්යතාවය සහ ඔහුගේ වේගය හා ගුවන් ගමන වඩාත් වෙනස් කිරීමට ඔහුට ඇති හැකියාව නිසා ඔහු විදේශයන්හි පවා ප්රබල බලවේගයක් කර ඇති අතර එහිදී කොන්දේසි නිතරම භ්රමණය නොනැසී පවතී.2011-12 දී ශ්රී ලංකාවේ දකුණු අප්රිකාවේ දකුණු අප්රිකාවේ සංචාරය කරන විට, හේරත්ගේ තරගය ලකුණු 128 කට ලකුණු 9 කට කඩුලු 98 ක් ලබා ගත්තේය.ඊළඟ කන්නයේ දී ඔහුට ඕස්ට්රේලියාවේ ආකර්ෂණීය චාරිකාවක්, කඩුලු ගනිමින්, වේගයෙන් පන්දු යවන්නන් යම් ආකාරයක පාලනයක් සඳහා වෙහෙස මහන්සි වී වැඩ කළ විට ලකුණු ලබා ගත්හ.ඔහු 2012 දී ටෙස්ට් තරගාවලියේ ප්රධාන කඩුලු 6.61 ක් වූ ඔහු වූ අතර, එමගින් මුරලිගේ සෙවණැල්ලෙන් 60.61 ක්ම පවසා ඇති අතර, හොඳම වම් පන්දු යවන්නන් අතර වේ",
    "Indika de Saram": "1999-2000 අතර සිම්බාබ්වේ සංචාරයේදී ඉන්දිකා ද සාරම් ශබ්ද තාක්ෂණයක් ඇති නමුත් හොඳ තාක්ෂණයක් වන ඉන්දිකා ද සාරම් ජාතික පැත්තට කඩා වැදුණි.කෙසේ වෙතත්, ඔහු අංක හය හෝ හතකින් ඇණවුමේ රැඳී සිටි අතර කිසි විටෙකත් තම පූර්ණ හැකියාවන් ප්රකාශ කිරීමට අවස්ථාවක් ලබා නොදුනි.ඔහු මාතාරාහි ශාන්ත තෝමස් විද්යාලයේ අධ්යාපනය ලැබූ අතර, ඔහු ද කඩුලු තබාගෙන රටේ වඩාත්ම ස්ථාවර ලාභදායකයෙකු බවට පත්විය.ඔහුගේ පාසල් දිවියේ විශේෂත්වය වූයේ පන්දු 149 කදී පන්දු 149 කදී ලකුණු 304 ක් රැස් කිරීමයි.ජාතික කණ්ඩායමට කඩා වැදීමට පෙර ඔහු කණ්ඩායමක නිතිපතා විය.ඔහු 2001 දී, සංචාරක ඉන්දියානුවන්ට එරෙහි විස්සයි විස්ස සංචිතයට සහ පසුව එංගලන්තයේ පැවති අයිසීසී ලෝක විස්සයි 20 ට එරෙහිව විස්සයි විස්ස සංචිතයට ඇතුළත් වූ අවස්ථාවේදී ඔහු අතහැර දමා නැවත පැමිණියේය.",
    "Tillakaratne Dilshan": "ඔහුගේ නිර්දය ආක්රමණශීලී වීම, ශක්තිමත් මැණික් කටුව සහ ස්වාභාවික කාලපරිච්ඡේදය, තිලකරත්න ඩිල්ෂාන් අද ක්රීඩාවේ වඩාත්ම සිත් ඇදගන්නා පිතිකරුවෙකි.ඔහු තාක්ෂණික වශයෙන් යහපත් වන නමුත්, කල්ෙන්ඩර් සෙවාග් වැනි බොහෝ සෙයින්, ඔහු ආරක්ෂක විකල්පය භාවිතා කරයි, ඔහු ආරක්ෂක විකල්පය භාවිතා කරන්නේ අවසාන පියවරක් ලෙසයි.ඔහු කාමරයක් සාදා පන්දුව හරහා පන්දුව තුරන් කිරීමට ප්රිය කරන නමුත් 2009 අයිසීසී ලෝක විස්සයි විස්ස තරගාවලියට වඩා ඔහුගේ අත්සනින් පහර දෙන ආ roke ාතය, එනම් \"ඩිල්කොප්\" නම්, ඔහුගේ හිසට වෙඩි තැබීම, එය ව්යාකූල වියපන්දු යවන්නන් සහ විශේෂ experts යින් එකසේ.ඇත්ත වශයෙන්ම, 2009, 2009 ඔහුගේ වෘත්තීය ජීවිතයේ දියුණු වසරක් වූ අතර ක්රීඩාවේ ආකාර තුනෙන්ම ඉනිම විවෘත කිරීම සඳහා ඔහුගේ පිතිකරණ නියෝගයක් ඔහු විසින් සිදු කරන ලදී.එය ඔහුගේ සෑදීම සනාථ වූ අතර, ඔහු පහර දීම ක්ෂේත්ර උපයෝගී කර ගත් අතර, සියලු ආකෘතීන් තුළ විශාල ලකුණු රැස් කළේය: ඔහු වසරේදී ජාත්යන්තර 11 ක් ලබා ගත් අතර ලෝක විස්සයි 202020 තරගාවලියේදී තරගාවලියේ ත්යාගය දිනා ගත්තේය.දිල්ෂාන්ගේ බහුල දක්ෂතා ඔහු සිය මංගල සංවිධානය බවට පත් කළ මොහොතේ සිට කිසි විටෙකත් පසුබට නොවීය, නමුත් විශේෂයෙන් ඔහු 2001 සිට 2003 දක්වා හෙළා දමන විට.නූතන යුගයේ වඩාත්ම විනාශකාරී විවෘත කරන්නෙකු ලෙස තම ස්ථානය සිතා කර ඇති තෙක් 1999 නොවැම්බරයේදී දිල්ෂාන්ගේ වෘත්තිය බොහෝ දුරට ඉටු නොවීය.ඔහුගේ විද්යුත් ක්ෂේත්රය එක් කරන්න, විශේෂයෙන් පසුගාමී ස්ථානයක, සහ ඔහුගේ අවතක්සේරු කළ ඕවර්ස්පින් සහ දිල්ෂාන් ගුණාත්මක පැකේජයක්.කුමාර් සංගක්කාරගේ ඉල්ලා අස්වීමෙන් පසු 2011 දී ඔහු ශ්රී ලංකාවේ නායකයා ලෙස නම් කරන ලද නමුත් ඔහුගේ පාලනය වසරකටත් අඩු කාලයක් පැවතුනද, 2011-12 දී ශ්රී ලංකාවේ දකුණු අප්රිකාවේ සංචාරයෙන් පසුව මහේල ජයවර්ධන ඔහු වෙනුවට ආදේශ කළේය.ඔහුගේ කණ්ඩායම මෙන් දිල්ෂාන් කපිතාන්ව සිටියදී දුප්පත් ස්වරූපයක් ගත් නමුත්, විශේෂයෙන් එක්දින ක්රිකට් ක්රීඩාවේදී, ඔහු 2012 දෙවන හෙවියේදී ලකුණු 1119 ක් ලබා සිටියදී පුනර්ජීවනයක් ලැබීය.\nජේමි වෙනස් කරන්න",
    "Indika Gallage": "ඉන්දිකා ගැලගේ යනු කෙට්ටු දකුණු අත වේගවත් මධ්යම පන්දු යවන්නා වන අතර ඔහු ජාතික පැත්තේ වාඩිලාගෙන සිටී.උස මිනිසෙක්, ඔහු ඉහළ ක්රියාමාර්ගයකින් යුක්ත වන අතර මුහුදේ පන්දුව ගොඩබෑමට ඉඩ සලසයි.ඔහුට ද පැතිරීමට ද හැකි වේ.1976 නොවැම්බර් 22 වන දින ඉන්දිකා ඉපදුර උපත ලැබීය. ඔහු දකුණු කලාපයේ පනාදුර හි ශ්රී සුමංගලහිදී අධ්යාපනය ලැබූ අතර ඔහු U13 මට්ටමේ සිට අධ්යාපනය ලැබුවේ ඔහු පාසල නියෝජනය කළේය.ඔහු 1998 දී එංගලන්තයට එංගලන්තයට ශ්රී ලංකා පැත්තෙන් සංචාරය කළ අතර, ක්වාලාලම්පූර්හි පැවති පොදුරාජ්ය මණ්ඩලීය ක්රීඩා උළෙලේ රට නියෝජනය කළේය.1999 ඔහුගේ ක්රිකට් දිවියේ හොඳම වසර විය.ඔහුව ඕස්ට්රේලියාවේ කාල්ටන් සහ එක්සත් ශ්රේණිය සඳහා සාජා හි කොකා කෝලා කුසලානය සඳහා තෝරාගෙන ඇති අතර පසුව, 5 වන තරගයේ වී සිම්බාබ්වේ හි එක්දින තරගයේදී ඔහු සිය රට වෙනුවෙන් මංගල සංවිධානය ආරම්භ කළ අතර පළමු ටෙස්ට් තරගයේදී ඔහුගේ ටෙස්ට් තරගය ආරම්භ කළේයඑදිරිව සිම්බාබ්වේ බාලවේයි හි.",
    "Dilhara Fernando": "ප්රනාන්දු තරුණ හා අමු ජාත්යන්තර තලයේ පැවති ජාත්යන්තර තලයේ සිටින විට, ඔහු වේගයෙන් චමින්ද වාස් සඳහා වේගයෙන් කපන අද්දර දිගු කාලීනව ආදේශ කරනු ඇතැයි යන බලාපොරොත්තුවෙන් වැඩි කල් නොගනී. ඔහුට ස්වභාවික වේගයක් ඇත - ඔහු මංගල්යයෙන් මාස හයකට පසු ඔහු ඩුර්බන් හි පැයට සැතපුම් 91.9 ක කාලයක් ගත කර ඇත. තාරිට තදින් පහර දී පන්දුව මැහුම් වලින් ඉවතට ගෙන යයි. මුල් අවදියේදී ඔහු සිය නොගැලපෙන රේඛාව හා දිග සඳහා ගෙවූ නමුත් පසුව වේගයෙන් පන්දු යැවීමේ ඒකකයේ රූමේෂ් රත්නායක සමඟ වෙහෙස මහන්සි වී වැඩ කළ අතර වඩාත් විශ්වාසදායක විය. ඔහු ප්රතිලෝමව ප්රතිලෝමව පැද්දීම ඉගෙන ගත් අතර වෙස්වළාගත් මන්දගාමී පන්දුවක් වර්ධනය කළේය. ඔහුගේ වෘත්තිය තුවාලයෙන් පීඩා වින්දා. 2004 ජනවාරියේදී මාස 12 ක් තුළ ඔහු පිටුපස දෙවන ආතති බිඳවැටීමක් ඇති වූ අතර ඕස්ට්රේලියාවට එරෙහි මුළු නිවාස මාලාවම මග හැරුණි. කෙසේ වෙතත්, ඔහු දැන් නැවත පූර්ණ යෝග්යතාවයට ගොස් ශ්රී ලංකාව වෙනුවෙන් නවසීලන්තයේ සේවය කිරීමෙන් පසු නැවත සාප්පුවකට සාත්තු කර ඇත. 2005 දී ඔහු නිතිපතා ස්ථානගත ස්ථානයක් දැරූ අතර 2005 දී යළිත් තුවාලයක් ඇති විය. කෙසේ වෙතත්, ඔහු 2005 දී තුවාල ලබා ඇත. කෙසේ වෙතත්, ඔහු එංගලන්තයේ සංචාරයේ එක් දින කකුලක් සඳහා ආපසු ගියේය තරුණ නළරවල ඔහුගේ උරහිසට ඉහළින් 2007 ලෝක කුසලාන සංචිතයේ ස්ථානයක් සඳහා නුවන් සොයිසාගේ අවධානයට ලක්විය. නමුත් ඔහු වල් කාඩ්පතක් ලෙස සලකනු ලබන අතර එය එක් අක්ෂර වින්යාසයකදී ජයග්රහණයක් හෝ තරඟයක් අහිමි විය හැකිය. කෙසේ වෙතත්, 2008 දී ඔවුන්ගේ ශූරතා ව්යාපාරයේ අවසාන සති කිහිපය සඳහා ඔහු ඔහුට අත්සන් කළ විට, ඔහු ජයග්රාහකයෙකු ලෙස කම්පෙස්ටර්ෂයර් සිතූහ.\nචාලි ඔස්ටින් 2008 සැප්තැම්බර්",
    "Prasanna Jayawardene": "එංගලන්තයට ගිය පසු ප්රසන්න ජයවර්ධන දිගු වෘත්තියක් සඳහා දිගු වෘත්තියක් සෙවීය\n19 හැවිරිදි 19 හැවිරිදි නමුත් රොකට්-ඉන්ධන වලින් ආන්තික කර ඇත\n2000 දී කුමාර් සංගක්කාරගේ පැමිණීම. ඇත්ත වශයෙන්ම, තිබුනේ පසෙකින් බලා සිටීම\nදැනටමත් ජයවර්ධනගේ වෘත්තීය ජීවිතයේ අංගයක් දැනටමත් විය. ඔහු සිය ටෙස්ට් තරගයට පාකිස්තානයට එරෙහිව 2000 ජුනි 2 වන දින මහනුවරදී ආරම්භ කළ නමුත් එය සීමා විය\nවැසි ගන්ධව සිටියදී පසුගිය දින තුන තුළ පසුගිය දින තුන තුළ ශ්රී ලංකාව පන්දුවට පහරදුන් දී කණ්නාඩි-කාමරය පුරාණ කාමරය. රොමේෂ් කළුවිතරණ පුනර්ජීවනය පරාජිත පිළිවෙලට තල්ලු කරන ලෙසත්, ඔහුගේ පිතිකරණයේ දී ඔහුගේ පිතිකරණයේ ඇත\n2004 අප්රියෙල් මාසයේදී සිම්බාබ්වේ සංචාරය සඳහා වූ ටෙස්ට් සංචිතයට ජයවර්ධන ටෙස්ට් සංචිතයට ය. කෙසේ වෙතත්, ජයවර්ධන 2004 අප්රියෙල් හි ටෙස්ට් සංචිතයට සිහිපත් කරන ලදී. කෙසේ වෙතත්, 2006 දී නවසීලන්තයේ සංචාරය කරන තෙක් ජයවර්ධන -07 ඔහු ටෙස්ට් පැත්තේ ස්ථාපිත වූ විට, සංගක්කාර විශේෂ පිතිකරුවෙකු ලෙස ක්රීඩා කිරීමට සංගක්කාරට ඉඩ දීම. ජයවර්ධන පන්දුවට පහර දීම ආරම්භ කළේ බංග්ලාදේශයට එරෙහිව ඔහුගේ මංගල ශතවර්ෂය ලකුණු ලබා ගනිමිනි. සංගක්කාර සීමිත ඕවර ක්රිකට් ක්රීඩාවේ පළමු තේරීම් භාරකරු ලෙස සලකන නමුත් ජයවර්ධන ශූරයන් කුසලානෙහි නම් කළ විට ඔහුගේ ස්ථානය නැවත ලබා ගැනීමට අවස්ථාවක් ලබා දෙන ලදී.",
    "Kumar Sangakkara": "වයස අවුරුදු 22 දී ඔහු පැත්තට කඩා වැදුණු විගසම, නීති ශිෂ්යයෙකු වන අතර කුමාර් සංගක්කාර පිතිකරණයට වඩා පිතිකරණයට වඩා වැඩි යමක් ඉල්ලා සිටින බව පෙනේ.අර්ජුන රණතුංග සහ අසංකා ගුරුසිංහ, අශුනක ගුරුෂිනි වැනි වමට හසුරුවන්නන් අර්ජුන රණතුගා ගුරුෂිනි, නමුත් සංගක්කාර වඩාත් සුන්දර රෙද්දකින් කපා, 'අනෙකාගේ අත සමඟ සෙල්ලම් කරන අලංකාරය සමඟ ආ ro ාත දැනීම.කප්පාදුව සහ අදින්න ස්වාභාවිකවම ඔහුට හා වැඩෙන විශ්වාසයෙන් යුතුව වැඩි සහතිකයක් ලබා දුන්නේය.රණතුංග මේ වන විට ශ්රී ලාංකිකයින්ගේ මිථ්යාවේ මිථ්යාව පුපුරුවා හැර ඇති නමුත් සංගක්කාර හිව්වා විය හැකි මොළයක් දැරූ නමුත් සංගක්කාර, බාහිරව කපන ලද සුළි සුළඟක් සමච්චලයට ලක් කර කඩුල්ල පිටුපසින් තල්ලු කර ඇත.මුලදී, ඔහුගේ අත්වැසුම් වැඩ කිරීම පාරිභාරුම සඳහා නොවේ, නමුත් ඔහුගේ පිතිකරණ හැකියාව වූයේ ෂී වෙතින් ඔහුව අවවාද කිරීම ගැන කිසිදු ප්රශ්නයක් නොමැති බවයි.පිතිකරුවෙකු ලෙස ඔහු ක්රමයෙන් පරිණත වූ අතර, 2006 දී කොළඹ පුරාණ සිංහල ක්රීඩා සමාජ භූමිය, කැප්ටන් සහ කිට්ටු මිතුරෙකු වන ඩේල් ස්ටේන් සහ කනස්සල්ලට එරෙහිව 624 ක් එකතු කරන ලදී.මක්කයා නට්ටිනි.සංගක්කාර 287 පරිත්යාග කළ අතර වසරකට පසුව ඔහු හොබාර්ට් වෙත ගිය විට 192 ට පසුව 192 ක් කරකැවිල්ලක් ලබා දුන්නේය.ඒ වන විට ඔහු ඒ වන විට ලෝක කුසලානයක අවසන් මහා තරගයේදී ඔහුගේ නමට අඩ සියවසක සහ ජයවර්ධන නායකත්වය අත්හැරීමට බොහෝ කලකට පෙර සංගක්කාර අභිෂේක ලත් තැනැත්තා වනු ඇති බව වටහා ගත හැකි විය.ඔහු එක්දින වේදිකාවේ බොහෝ දුරට නොසන්සුන් වූ අතර, බොහෝ විට ඉන්දියානු ප්රිමියර් ලීග් තරගාවලියේදී ඔහුගේ කඩුල්ල ඉවත දමා ඔහුගේ කඩුල්ල ඉවත දැමීය.කපිතාන්ගේ බර ඔහුගේ උරහිස් මත, ඔහු තවදුරටත් ටෙස්ට් තරගවල තබා නොගනී, නමුත් කඩුල්ල පිටුපස සිට ස්මාර්ට්-ඇලෙක් ස්මාර්ට්-ale.නායකත්වය පිතිකරුවෙකු ලෙස ඔහුගෙන් හොඳම දේ ලබා ගත්තද, ඔහු දරුණු නැත.2011 දී මෙම විධිවිධාන දුරු කර තිබියදීත්, 2012 දී ශ්රී සංගක්කාර 2011 දී අයිසීසී සම්මාන උළෙලේදී ඉහළම ත්යාගය දිනා ගත් අතර දෙවන වසර සඳහා මහජන තේරීම් සම්මානය.එම වසරේදී ඔහු පිතිකරණයේ නවීන ශ්රේෂ් s ශ්රේෂ් s ශ්රේෂ් s ශ්රේෂ් s ශ්රේෂ් s ශ්රේෂ් s ශ්රේෂ් with යින් අතර, ටෙස්ට් තරග 10,000 ක් දක්වා ලකුණු 10,000 ක් රැස් කරමින් ශ්රී ලංකාව මෙල්බර්න් ක්රිකට් ක්රීඩාංගණයේදී ප්රේක්ෂකයින් වෙනුවෙන් ක්රීඩා කර තිබේ.. ඩීලිලිප් ප්රේමකන්ද්රංන් සහ එස්පීඑන්කිරින්ෆෝ කාර්ය මණ්ඩලය",
    "Dinuka Hettiarachchi": "වමතින් දඟ පන්දු යවන්නා සහ දක්ෂ පිතිකරුවෙකු වන දිනනුකා හෙට්ටියාරච්චි සෑම මට්ටමකම ක්රිකට් පිටියට ලක්වූවන් 19 සිට 19 දක්වා ක්රිකට් ක්රීඩාවේ ක්රීඩා කළ අතර ගෘහස්ථ තරඟවල කොළඹ කෝල්ට්ස් සමඟ වැඩිදුර බැබළුණි.1996-97 දී එංගලන්තයට සහ ඊළඟ වසරේදී එංගලන්තයට සහ 1999 දී අබුඩාබියේ නිල නොවන ත්රිත්ව තරගාවලියකට එංගලන්තයට එරෙහිව ඔහුට එරෙහිව අවස්ථාවක් ලැබුණි.2000 දී ඔහු සිම්බාබ්වේට එරෙහිව ක්රීඩා කරමින්, හොඳ රංගනයන්ගේ පිටුපස පරීක්ෂණ පැත්තට ඇමතුමක් ලබා ගනිමින් ෂී හි ස්ථානයක් සොයා ගැනීමට ඔහු අසමත් විය.ඔහු අවසානයේදී 2000-01 කින් එංගලන්තයට එරෙහි පැත්තට කඩා වැදුණු නමුත් සාධාරණ මංගලතනයක් අතහැර දැමීමෙන් පසුවය.\nක්රික්ෆෝ කාර්ය මණ්ඩලය",
    "Thilan Samaraweera": "තිලාන් සමරාවීරගේ පිතිකරණයට ක්රීඩාංගනයක් පුරවන්නේ නැත.එහෙත්, දිලිසෙන ආ roke ාතකයන්ගේ පිතිකරුවෙකු තුළ, ඔහුගේ ඉවසීම සහ ශක්තිමත් භාවය වැදගත් සමබර සාධකයක් ඉදිරිපත් කරයි.ඔහුගේ දෙවන අවතාරය තුළ ඔහු තම පිතිකරණය වඩාත් හොඳින් වටකුරු බවට පත් කිරීම සඳහා තවත් පහරවල් එකතු කර ඇති නමුත් සමරාවිරා හොඳම දේ කරන්නේ රෝගියා තුළින් පන්දු යැවීම් සහ නිර්දය සමුච්චය වීමෙනි.ඔහුගේ පිතිකරණය ඔරොත්තු දීමේ සංචිත, අධිෂ් and ානය සහ කම්පනය පිළිබඳ කම්පනය මඟහරවා ගැනීම සඳහා ඔවුන් සියල්ලන්ටම ඇද ගැනීමට සිදු වූ අතර ක්රිකට් ක්රීඩාවේ අඳුරුතම පැය ගණන - ලාහෝර් හි ත්රස්තවාදී ප්රහාරය.උණ්ඩ තුවාලයක් ඔහුගේ ජාත්යන්තර ජීවිතය අවසන් කිරීමට ඉඩ නොදීම ගැන සමරාවිරා සදහටම සිහිපත් කරනු ඇත.2009 මාර්තු මාසයේදී ඔහුගේ කණ්ඩායම් බස් රථය ගින්නකට ලක් වූ විට ඔහු සිය හොඳම ස්වරූපයෙන් පාකිස්තානයේ අඛණ්ඩව ද්විත්ව ශතක දෙකක් ලබා ගත් අතර උණ්ඩයක් අඟල් 12 ක් වම් කලවා තුළට විනිවිද ගියේය.ඔහුට ශල්යකර්මයක් අවශ්ය වූ අතර ඔහුගේ දුෂ්කරතා පිළිබඳ ශාරීරික හා මානසික තුවාල සමඟ මාස තුනක් ගත කළේය.සමරාවිරා ජූලි මාසයේදී සිය 50 වන ටෙස්ට් තරගයට පැමිණි ආපසු පැමිණි බව ඔහුගේ චරිතයේ ශක්තියේ ජයග්රහණයකි.ඔහුගේ නැවත පැමිණීම දෙවන ස්ථානයට පත්වීම දෙවන සිදුවීම 2001 දී ඉන්දියාවට එරෙහි සිය වෘත්තීය ජීවිතය ආරම්භ කිරීමෙන් පසුවය. අරවින්ද ද සිල්වා සහ හෂාන් තිලකරත්න සමරවීරට මැදපෙළිකත්වය ලබා දුන් නමුත් 2006 2006 හි උදාසීන ස්වරූපය ඔහු අතහැර දැමීමට හේතු විය.ඔහු මාස 18 කට පසු, වඩාත් ආක්රමණශීලී, දක්ෂ පිතිකරුවෙකු වන නමුත් 2008 ජූලි මාසයේදී ඉන්දියාවට එරෙහිව සියවසක් සමඟ සියවසක් ලබා දුන්නේය. එය දම් පැහැති පැච් එකක ආරම්භයයිතුවක්කුකරුවන් සමඟ.සියලු ලකුණු තිබියදී සමරාවිරා ලකුණු රැස් කළ අතර, ඔහුගේ සාපේක්ෂ සාර්ථකත්වයේ lack නතාව හේතුවෙන් ප්රශ්න ලකුණු ඉතිරිව තිබේ.ඊටත් වඩා භයානක දෙය නම් 2011 දී ඕස්ට්රේලියාවට එරෙහිව පූර්ව වටයේ දී පිසින ලද කමිටුවකට පසුවය. පසුව එක්සත් අරාබි එමීර් රාජ්යයේ පාකිස්තානයට එරෙහි පරීක්ෂණ සඳහා ඔහුව පසුව දකුණු අප්රිකානු සංචාරය සඳහා ඔහුව සිහිපත් කරන ලෙස බලහත්කාරයෙන් පරාජය කරන ලදී.සමරාවිරා සියවස් දෙකක කාලයක් ශතවර්ෂයේ ප්රතිචාර දැක්වූයේ ඔහුගේ වඩාත් කීර්තිමත් කණ්ඩායමේ සමහර කණ්ඩායමේ සමහර කණ්ඩායමේ පන්දුවට පහර දීමට පොරබදමින් ය.දකුණු අප්රිකාවේ ඩර්බන් හි සිය ශතකය ශ්රී ලංකාව භාර දුන් විට සමරාවිරාගේ හොඳම වේලාව පැමිණියේය.ඔහු 2012 දී තරමක් සාර්ථක වසරක් වුවද, ශ්රී ලංකාවේ අවුරුදු අන්තයේ ඕස්ට්රේලියාවේ සංචාරයේදී වඩාත්ම කැපී පෙනෙන ලෙස බැඳී ඇති පිතිකරණය සමරාවීර.ඉන්පසු දේශීය කාල පරිච්ඡේදයේදී දිවා කාලයේ ලකුණු ලබා ගත් පසු, බංග්ලාදේශයට එරෙහි ගෘහස්ථ ටෙස්ට් තරගමාලාව සඳහා ශ්රී ලංකාවේ සංචිතයේ ස්ථානයක් ඔහු සොයා ගත්තේ නැත.මාස කිහිපයක් තිස්සේ ශ්රී ලංකාව සඳහා අර්ථවත් ටෙස්ට් ක්රිකට් ක්රිකට් ක්රිකට් ක්රිකට් එකක් නොමැතිව සමරාවිරා 2013 මාර්තු මාසයේදී සියළුම ජාත්යන්තර ක්රිකට් ක්රීඩාවෙන් විශ්රාම යන බව නිවේදනය කළේය. බොරජ් බිනෝයි",
    "Michael Vandort": "කොළඹ ක්රිකට් සමාජයේ සහ ශ්රී ලංකාවේ ශ්රී ලංකා ඒ. ප්රමාද වූ සංවර්ධකයෙකු වන මයිකල් වැන්ඩෝර්ට් ජාතික තලයට පැමිණියහ. ඉක්මනින් හැඟීමක් ඇති කළේය. පසුව ඔහු 2001 අගෝස්තු මාසයේදී ඉන්දියාවට එරෙහිව XI පැත්තකට XI පැත්තකට තෝරාගෙන ඇති අතර සිත් ඇදගන්නා සියවස 16 කදී ශ්රී ලංකාවේ 16-මෑන් ටෙස්ට් සංචිතයේ නැංගුරමකටම වෙන් කරන ලදී. ඔහු තරගාවලියේදී පසෙකින් වාඩි වූ නමුත් 2001 දී බංග්ලාදේශයට එරෙහිව 2001 දී බංග්ලාදේශයට එරෙහිව ජ්යෙෂ් players ක්රීඩකයින් විවේක ගත් අවස්ථාවේදී අවසානයේදී බංග්ලාදේශයට එරෙහිව අවස්ථාවක් ලබා දෙන ලදී. කෙසේ වෙතත්, දෙවන ටෙස්ට් තරගයේදී ශතවර්ෂයක් ලකුණු ලබා ගත්තද, ඔහු ජාතික සංචිතයේ ස්ථානයක් නැවත ලබා ගැනීමට පෙර වසර තුනහමාරක් බලා සිටියේය. පිහිටුවන ලද ජයසූරිය-අටපට්ටු සංයෝජනය හේතුවෙන් අවස්ථා සීමා කරන ලද නමුත්, ඔහු බොහෝ තර්ක කරන්නේ ඔහුව කෙසේ වෙතත්, තේරීම් කමිටුව විසින් අසාධාරණ ලෙස නොසලකා හැර ඇති බවයි. සනත් ජයසූරියට තුවාල වීම 2006 පෙබරවාරි මාසයේදී ඕස්ට්රේලියාවට එරෙහිව ඕස්ට්රේලියාවට එල්ල වූ එක්දින තරගයට මග පෑදීය. ඔහු ඉහළට සාමකාමී නමුත් මන්දගාමීව ලකුණු 48 ක් ලබා ගත් නමුත් පසුව ඔහුගේ ශ්රේණියේ ඉතිරි කොටස සඳහා අතහැර දමා ඇත. ඔහු බංග්ලාදේශ ජදරයේ ටෙස්ට් තරග දෙකක් ක්රීඩා කළේය ස්ලිප් ක්ෂේත්රයක් ලෙස ඉහළින් ශ්රේණිගත කර ඇති නමුත් ක්ෂේත්රයේ මන්දගාමී වන අතර, සීමිත ඕවර ක්රීඩාවේ ඔහුගේ අවස්ථාවන් සීමා කරන දුර්වලතාවයක් අඛණ්ඩව පවතී.",
    "Charitha Buddhika": "විස්ඩන් දළ විශ්ලේෂණයකෙටි හා ස්කීඩි, චරිතා බුද්ධිකා (හෝ බුද්ධිකා ප්රනාන්දු) සජීවීව ජනනය කරයි\nදඟකාර රාමුවකින් වේගයෙන් හා හුරුබුහුටි චලනය.ඔහු ජයග්රාහී එක්දින තරගයක් කළේය\nසාජා හි සිම්බාබ්වේට එරෙහිව 2001 ඔක්තෝම්බර් මාසයේ ආරම්භයක්ම.පන්දු දෙකකින් ඔහුගේ ගිණුම විවෘත කිරීමෙන් පසු ඔහු සිය පළමු නීත්යානුකූලව කඩුල්ලක් ගත්තේය\nබෙදා හැරීම.තවත් හතර දෙනෙකු ද, ඔහු ලකුණු 67 කට ලකුණු 67 ක් රැස් කළේය\nඑක්දින තරගයේදී ශ්රී ලාංකිකයෙකු විසින් සංඛ්යා ලේඛන සහ සිව්වන හොඳම කාලය.ඔහු\n2002 දී ටෙස්ට් කණ්ඩායමේ ස්ථානයක් ලබාගෙන එංගලන්තය සංචාරය කළේය. නමුත් පසුව\nපරීක්ෂණ නවයක් (කඩුලු 18 ක් @ 44) සහ එක්දින තරග 17 ක්, ඔහු පසු\nනොගැලපෙන රංගනයන්.මර්දනය මත ඉතිරිව ඇති නමුත් වර්ධනය විය හැකිය\nපළමු පන්තියේ පනස් ගණන් සත්යාපනයන් සිව්දෙනා සමඟ ප්රයෝජනවත් පහළ ඇණවුම් තුන් ඉරියව්වකට\nනම. (චාලි ඔස්ටින්)",
    "Sujeewa de Silva": "කන්නයේ දකුණු රිසෝට් රිසෝට් පන්දු යවන්නා වන සුජීවා ද සිල්වා 2000 දී 23000 දී අග්රාමාත්යවරයාගේ ප්රමුඛස්ථානයට වෙඩි තබා ඇත.පන්දුව ප්රමාද වී පන්දුව පන්දුවට පහර දීම ප්රමාද වූ නමුත් ශ්රී ලංකාවේ එංගලන්ත සංචාරය ආරම්භ කරන විට, බංග්ලාදේශයට එරෙහිව ටෙස්ට් තරග දෙකක් වාදනය කරන තෙක් ඔහු ඇසූ ලද ඇස අල්ලා ගැනීමට ඔහු අසමත් විය.බංග්ලාදේශයට විරුද්ධව අහම්බෙන් ඔහුගේ මීළඟ ටෙස්ට් තරගයට යාමට ඔහුට වසර පහකට ආසන්න කාලයක් බලා සිටීමට සිදුවිය.පසුව ඔහු එය චැම්පියන්ස් කුසලානය සඳහා වූ සංචිතයට ගෙන ගියේය.",
    "Chamila Gamage": "",
    "Jehan Mubarak": "අලංකාර වාමාංශික වමතින්, ජෙහාන් මුබාරක් ක්රීඩාව ඔහුගේ උප්පැන්න අයිතිය මෙන් සහ ඔහුගේ රට අවුරුදු 15 න් පහළ U-17 සහ U-19 මට්ටමේ දී නිරූපණය කරයි.ගෞරවනීය විද්යා ist යෙකුගේ පුත් වොෂිංටන් ඩීසී හි උපත ලැබූ මුබාරක් කොළඹ රාජකීය විද්යාලයට පැමිණීම සඳහා නැවත ශ්රී ලංකාවට පැමිණියේය.ඔහු 2002 දී බංග්ලාදේශයට එරෙහිව මිදී ලබා දුන් අතර දකුණු අප්රිකාවේ මුල් අප්රිකාවේ ක්ලැසික් 48 සමඟ ආදේශ කිරීමකින් මිදුණු නමුත් දුර්වල එක්දින තරගයක් (ඉනිම 7 කදී ලකුණු 68 ක්) එතැන් සිට සීමිත අවස්ථාවන් ඇත.ඔහු ප්රයෝජනවත් දෝලනයක, විශිෂ්ට පන්දු රකින්නෙකු වන විස්ල් පිතිකරුවෙකු වන අතර එය ප්රයෝජනවත් විස්සයි විස්ස පිතිකරුවෙකු සහ ජාතික පිහිනුම් ශූරයා වේ.\nඇන්ඩ rew මිලර් මාර්තු 2008",
    "Naveed Nawaz": "නවාස් සිය සමාජ ශාලාව, නාමකරණයන්, අංක සඳහා නිරන්තරයෙන් ලකුණු කර තිබේ\nවසර ගණනාවකට, සාමාන්ය මිල 40 ක් වන නමුත් ජාත්යන්තර අවස්ථා තිබේ\nසීමිත: එංගලන්තයේ වීවර්ස්ට් තරගාවලිය සඳහා ඔහුගේ පුදුමය සිහිපත් කරන තුරු\n2002, ඔහු සිම්බාබ්වේට එරෙහිව හුදෙකලා එක් දින පෙනුමක් ලබා දුන්නේය\n1997-98.එම අවස්ථාවේදී, ඔහු වටේ සීරීමට අංක 3 හි ආකර්ෂණය කර ගැනීමට අපොහොසත් විය\nපන්දු 23 ක දුරක් සඳහා 5. ඔහුගේ පරීක්ෂණය බංග්ලාදේශයට එරෙහිව පහත සඳහන් කරුණු වලින් මිදුණි\nකණ්ඩායම නැවත කණ්ඩායමට ලිස්සා යාමට පෙර මාලාව.\nචාලි ඔස්ටින්",
    "Hasantha Fernando": "ශ්රී ලංකාවේ එක්දින කණ්ඩායමට හසන්ත ප්රනාන්දු වේගවත්ව සිටි අතර, ඔවුන්ගේ තේරීම් කමිටු 2003 ලෝක කුසලානය සඳහා වේගවත් පන්දු යැවීමේ තුන් ඉරියව් ක්රීඩකයෙකු සොයා ගත්තේය.සෙබස්තියන්ට් ක්රීඩා සමාජය සමඟ එක් පූර්ණ පළමු පන්තියේ සමය යටතේ, සෙබස්ටියන්වරුන්ගේ ක්රීඩා සමාජය යටතේ ඔහු ආකර්ෂණීය ගෘහස්ථ රංගනයන් සමඟ ඇසට හසු වූ අතර ඔහුගේ සමාජ ශාලාව සඳහා ශතවර්ෂ තුන්දරදයක් ලබා දුන්නේය.පන්දුව සමඟ ඔහු ද නිතිපතා දායක වූ අතර කඩුලු 61 ක් කඩුලු 61 ක් ලබා ගත්තේය.ඔහු 2002 අගෝස්තු මාසයේදී බංග්ලාදේශයට එරෙහිව සිය එක්දින තරගයක් බවට පත් කළේය. අංක 7 හි පන්දුවට පහර දීම අවස්ථා නොමැති නිසා ඔහුගේ වටිනාකම ඔප්පු කිරීමට ඔහුට නොහැකි වූ නමුත් ඔහු වේගයෙන් නොහැකි වුවද විචල්යතාවයක් පෙන්නුම් කරයි.ඔහු එම වර්ෂයේ අග භාගයේ දකුණු අප්රිකාවේ සංචාරය කළ අතර ජොහැන්නස්බර්ග්හි ඔහුගේ ටෙස්ට් තරගය ඔහු යුගලයක් සඳහා සේවයෙන් පහ කිරීම සඳහා අමතක කළ හැකිය.ඔහු තුන් අවුරුදු විරාමයකින් පසුව බංග්ලාදේශයේ සංචාරය සඳහා තුන් වසර විරාමයක් ලබා ගත් අතර පසුව දකුණු අප්රිකාවේ විස්සයි 20 ලෝක ශූරතාවලිය සඳහා පසුව සිහිපත් කරන ලදී.\nක්රික්ෂෝ කාර්ය මණ්ඩලය 2007 අගෝස්තු",
    "Kaushal Lokuarachchi": "ලූකරක්චි අවාසනාවන්තයි. ඔහු දෙදෙනෙකු සිටින යුගයකට අයත් බව අවාසනාවකි\nජාතික කණ්ඩායමේ නැංගුරමකට තවත් දකුණු අත කකුල් කකුල් ද වෙන් වේ.උපුල් චන්දනා සහ මාලිංග බන්ඩාරාගේ පැමිණීම යන්නෙන් අදහස් කළේ 'ලොකු', ඔහු කණ්ඩායම් සහකරු හෝ සහකාරිය විසින් හඳුන්වන පරිදි ජාතික කණ්ඩායමේ කිසිදු ස්ථානයක් නොතිබූ බවයි\nඩොම්පිනර් මුත්තියා මුරලිදරන්.ජාතික කණ්ඩායමේ සෙල්ලම් කිරීමට ලැබීමට ඇති හොඳම අවස්ථාව ලොකුවේ කෙටි අනුවාදයේ ඇති බව ලොකු තරමක් තීරණය වී ඇති බව පෙනේ.ඔහු පවසන්නේ එක්දින ක්රිකට් ක්රීඩාවට සහ ඔහුගේ පන්දු යැවීමේ ශෛලිය හා පිතිකරණයේ ශෛලිය එයට ගැලපෙන බවයි.\"තීව්රතාවය විශිෂ්ට බැවින් ටෙස්ට් ක්රිකට් ක්රීඩාවට වඩා එක්දින ක්රිකට් ක්රීඩාවට වඩා එක්දින ක්රිකට් ක්රීඩාවක් කිරීම දුෂ්කර ය. මම අභියෝගයට කැමතියි,\" ලොකු පැවසීය.ඔහු විශ්වාස කරන්නේ කකුල් කරුවෙකු ලෙස තමාට ඉගෙන ගැනීමට බොහෝ දේ ඇති බවය, නමුත් ඔහු තම රට වෙනුවෙන් රත් කරන සෑම අවස්ථාවකම අත්දැකීම් ලබා ගැනීම පිළිගනී.ඔහු පළමු පන්තියේ ශතවර්ෂ දෙකකින් සහ පිතිකරණ සාමාන්ය 27 ක් සමඟ මෙම නියෝගයට පහළින් ප්රයෝජනවත් පිතිකරුවෙකි.ඔහු ශාන්ත පීතර විද්යාලයේ කැපී පෙනෙන වෘත්තියක් පැවති අතර එහිදී හොඳම පන්දු යවන්නාගේ ත්යාගය දිනාගත් අතර වසරේ පාසල් ක්රිකට් ක්රීඩකයාට ඡන්දය ප්රකාශ කළේය.පසුව ලොකු 1999 දී බ්ලූම්ෆීල්ඩ් සමඟ එකතු වී කෝල්ට්ස් වලට එරෙහිව ප්රිමියර් ලීග් අවසන් පූර්ව පූර්ව වටයට කඩුලු 14 ක් දවාගෙන ඔවුන් සිය වෘත්තීය ජීවිතයේ හොඳම ක්රියාකාරිත්වය වන එස්එස්සී වෙත ගියේයදුර.ශ්රී ලංකාවේ හිටපු ශ්රී ලංකා ඕපොස්සිනර් රුවන් කල්පගේ මහතාගේ ප්රධානත්වයෙන් යුත් ශ්රී ලංකා භේදය ඇකඩමියට සහභාගී වීමෙන් සහ ශ්රී ලංකා ඒ කාණ්ඩයේ පුහුණුකරු චන්දිකා හතුසිංහ මහතාගෙන් ලැබුණු ශ්රී ලංකා භේදය ඇකඩමියට සහභාගී වී තිබේ.\n සාඩි තව්ෆෙරිකෙක් 2007 ජූලි",
    "Prabath Nissanka": "විස්ඩන් දළ විශ්ලේෂණයඅමු හා වේගවත්, ප්රභාත් නිසාන්කා ඔහු කෙරෙහි හැඟීමක් ඇති කළේය\nකැප්ටන්, සනත් ජයසූරිය, හිස් වැස්මෙහි ඔහුව ගැටගැසීමෙන්\nශුද්ධ සැසියකදී.අව්යාජ වේගයේ හැකියාව, ඔහුට තිබේ\nඅවංක, සංකීර්ණ නොවන නමුත් පන්දුව ඉසීමට නැඹුරු වේ\nඅවට.ඔක්තෝම්බර් මාසයේදී සාජා හි දක්ෂ කතාවකින් පසුව\n2001, එහිදී ඔහු ලාභ කඩුලු දෙකක් සුවපහසු ලෙස ලබා ගත්තේය\nපාකිස්තානයට එරෙහිව ජයග්රහණය, ඔහු දෙදෙනෙකුගේ වැරදි කෙළවරේ\nඊළඟට නව්ඩ් ලයිෆ් සහ ඉමාමාම්-උල්-හක් වෙතින් සැඟවී ඇත\nකණ්ඩායම් හමු වූ කාලය.තුවාල, විශේෂයෙන් ඔහුගේ දණහිසට, ඇත\nඔහුගේ දියුණුව මන්දගාමී කළ නමුත් ඔහු ශ්රී ලංකාවට හොරෙන් යන්නට සමත් විය\nසාමාන්ය වීබී ශ්රේණි තිබියදීත් ලංකා ලෝක කුසලාන සංචිතය\nඕස්ට්රේලියාව.(ඇන්ඩ rew මිලර්)",
    "Thilan Thushara": "තුෂාරා යනු අන්තිම දෙකේ ඉස්මතු වීමට වේගවත් වේගවත් පන්දු යැවීමේ අපේක්ෂාවකි\nඅවුරුදු. වෙරළබඩ නගරයේ බාලපිටිය සිට ඔහු සිය පළමු පන්තියේ ආරම්භය බවට පත් කළේය\n1998-99. වසර කිහිපයක ස්ථාවර වැඩිදියුණු වීමෙන් පසුව, අක්ෂර වින්යාසයක් ඇතුළුව\nබී.සී.සී.එස්.එල්. හි වේගවත් පන්දු යැවීමේ ඒකකය, ඔහු තේරීම් කරුවන්ගේ ඇසට හසු වූ අතර එය විය\n2002 දී ශ්රී ලංකාවේ දකුණු අප්රිකාවේ සංචාරය සඳහා ඇතුළත් විය. ඔහු සිය පරීක්ෂණ ආරම්භ කළේය\n2003 දී බටහිර ඉන්දීය කොදෙව්වන්ට එරෙහිව, නමුත් පරීක්ෂණය හෝ එක්දින සංචිතය සෑදීමට අපොහොසත් විය\nඅවුරුද්දේ පසුව එංගලන්ත සංචාරය. පිතිකරුවා සමඟ හාවෙකු නැත, ඔහු අ\nපන්දුව දැඩි ලෙස පහර දෙන අතර පළමු පන්තියේ අර්ධ ශතක දෙකක් දක්වා\nඔහුගේ නම. කන්දුරාටා 2008 දී වූ අන්තර් පළාත් සීමිත ඕවර මංගල ශූරයන් ලෙස අවසන් වූ තරග කඩුල්ලේ ඒකාබද්ධ කඩුලු 11 ක් දවා ගනිමින් ඔහු කන්දුරාටා හි වැදගත් කාර්යභාරයක් ඉටු කළේය. එය බටහිර ඉන්දීය කොදෙව් පිල කඩුල්ල සඳහා වූ ටෙස්ට් සංචිතයට නැවත කැඳවීමක් ලබා දුන් අතර ඔහු ටෙස්ට් තරග දෙකකදී කඩුලු 8 ක් දවා ගත්තේය. ඔහු පසුව චැම්පියන්ස් කුසලානය සඳහා 30 දෙනෙකුගෙන් 30 දෙනෙකු ඇතුළත් විය. ඔහු ශ්රී ලාංකික තණතීස්වල effective ලදායී වී ඇති අතර ඒවා නුවන් කුලසේකර සමඟ සාර්ථක හවුල්කාරිත්වයක් ඇති කර ගත්තේය.\nචාලි ඔස්ටින් සහ ක්රික්ෂෝ කාර්ය මණ්ඩලය ඔක්තෝබර් 2009",
    "Dinusha Fernando": "ප්රනාන්දු, උස මධ්යම-වේගයෙන් පැද්දීමේ පන්දු යවන්නා සහ ප්රයෝජනවත් පහළ ඇණවුම් පිතිකරුවා,\nපළමුවන කාලය තුළ මයික්හි මයික් අතට්ටන් සෑදීමෙන් ඔහුගේ දක්ෂතාවය මුලින්ම ප්රකාශ කළේය\n2001 ටෙස්ට් තරගාවලිය දක්වා පෙරීමට හේතු වූ උණුසුම් තරඟ.එහෙත්, ආකර්ෂණීය වුවත්\nඔහුගේ සමාජ ශාලාව, සෙබස්තියලියන් සහ කණ්ඩායමක් සඳහා වන කාර්ය සාධනය, ඔහු උපාධිය ලබා ගත්තේය\n2003 නොවැම්බර් මාසයේදී ජාතික කණ්ඩායමට. ඔහු කන්ඩායම් කරමින් ක්ෂණික හැඟීමක් ඇති කළේය\n2 එංගලන්තයට එරෙහිව දම්බුල්ල ප්රදේශයේදී.පළමු පරීක්ෂණ දෙකේදී ද ඔහු ක්රීඩා කළේය,\nනමුත් ඕවර 21 ක් පමණක් පන්දු යැවූ අතර අතහැර දමා ඇත. (චාලි ඔස්ටින්)",
    "Farveez Maharoof": "ෆර්වීස් මහරුෆ් යනු අවංක, විවෘත පපුව සහිත ක්රියාවකින් සජීවී නාවිකයින් පලවා හරින වේගවත් පන්දු යැවීමේ ඉරියව්කරුවෙකි.19 න් පහළ කප්ටන් 19 න් පහළ කේන්ද්රීය රංගනයලින් කල්පනා කරමින් ශ්රී ලංකාවේ තේරීම් කමිටුව 2004 අප්රියෙල් -1 මැයි මාසයේදී සිම්බාබ්වේ සංචාරය සඳහා ජාතික සංචිතයට සිය සිත් ඇදගන්නා සුළු ප්රමාණයක් වේගයෙන් නිරීක්ෂණය කළේය.දුර්වල විරුද්ධවාදිකම්වලට මුහුණ දෙමින් මහරූෆ් කඩුලු පොකුරක් තෝරා ගත් නමුත් ආසියානු කුසලාන තරගාවලියේදී වඩා හොඳ තරඟකරුවන්ට එරෙහිව පැමිණියේය.ඔහු සාධාරණව හොඳින් කළ අතර දකුණු අප්රිකාව නැරඹීමට පැමිණෙන විට ඔහුගේ පැද්දීමේ පන්දු යැවීමත් සමඟ මාක් කර තිබේ.ඔහු වයස අවුරුදු 17 න් පහළ සහ 19 න් පහළ වයස අවුරුදු 17 න් පහළ, 19 න් පහළ කණ්ඩායම සඳහා වන ශ්රී ලංකාව වෙනුවෙන් පෙනී සිටි නියෝජිත ශ්රේණිගත කිරීම් හරහා යමින් 19 න් පහළ කණ්ඩායම 2004 බංග්ලාදේශයේ තරුණ විය.ඔහු වෙස්ලි විද්යාලය සඳහා වැඩිම පාසල් වෘත්තියක් භුක්ති වින්දා.2004 දී එංගලන්තයේ අයිසීසී චැම්පියන්ස් කුසලානය තුළ මධ්යන්ය සංදර්ශකයෙක්, ගිම්හාන තත්වයන් අවසන් වන විට, ශ්රී ලංකාව නාවික හිතකාමී තත්වයන් යටතේ ක්රීඩා කරන විට ඔහු විශේෂයෙන් ප්රයෝජනවත් විය හැකි බව පෙන්නුම් කරයි.2006 මුල් භාගයේදී පාකිස්තානයට එරෙහිව පිතිකරුවෙකු හා බෝලයක් සහිත ප්රයෝජනවත් ශ්රේණියක් ඔහු තල්ලු කිරීමට සූදානම්ව සිටියද, ඔහුගේ පන්දු යැවීම එංගලන්ත සංචාරය පිළිබඳ කඩුලු 2 ක් පමණක් ලබා ගැනීමට අසමත් විය.ඉන්දියාවේ චැම්පියන්ස් කුසලානය 80 ක් සඳහා ඔහුගේ වයස අවුරුදු 14 ක් සඳහා විශ්මය ජනක සංදර්ශනයක් පැමිණියේය. අයි.පී.එල්.මහරුෆ් 2012 වන තෙක් ශ්රී ලංකාවේ සංචිතයේ සිට 2012 දක්වා බංග්ලාදේශයේ ආසියානු කුසලානය පසුපස හඹා ගිය අවස්ථාවේදීය.ඔහු 2016 දී පුදුමයට පත්වූයේ, ඔවුන්ගේ සංචාරයේ සීමිත ඕවර කකුල අයර්ලන්තයට සහ එංගලන්ත ඔස්ටින් සහ ඊඑස්පීඑන්කිකින්ෆෝ කාර්ය මණ්ඩලය සඳහා තේරීම් කමිටු ඔහුව සිහිපත් කළ විට",
    "Lasith Malinga": "ලසිත් මාලිංගගේ විශිෂ්ට පන්දු යවන්නන්ගෙන් එක් අයෙක් ලසිත් මාලිංග, තදින් සැරසුණු යෝග්යයන් වටකුරු ආතතියකින් විනාශකාරී ලෙස විනාශකාරී ලෙස විනාශකාරී ලෙස ලබා දීම ගැන කීර්තියක් ලබා ඇත.එම යෝර්කර්, රැවටිලිකාර සන්ධි බෝලයක් සහ විශිෂ්ට පන්දුවක මාලිංගගේ උවදුරගේ දේහය පිහිටුවා ඇති අතර, ක්රියාව නිසා ඔහුගේ පන්දු යැවීම දුෂ්කර විය.වීදි ස්මාර්ට් මගින් ඒ සියලු හැකියාව ද පිට විය.මාලිංග සැලසුම් මාරු කිරීම සඳහා කලාතුරකින් ලැජ්ජාශීලී, සහ නැවත සකස් කරන ක්ෂේත්ර නැවත සකස් කිරීමකි.පිතිකරුවන් පැමිණීමට යන දේ දන්නා බව පිතිකරුවන් සිතුවා වුවද, මාලිංග පුදුම කිරීමේ හැකියාව රඳවා ගත්තේය.ගාල්ලේ උතුරින් රත්ගාමා වෙරළ තීරයේ දී මාලිංගගේ මෘදු-බෝල් ක්රිකට් ක්රීඩාවේදී මවුලිගා විසින් අවිධිමත් ශ්රී ලාංකික පුහුණු පද්ධතිය සහ සාම්ප්රදායික නොවන පන්දු යවන්නන්ගේ සන්නද්ධව සිටින එක් පෝස්ටර් පිරිමි ළමයෙකු බවට පත්විය.මාලිංග සිය සාර්ථකත්වය වෙනුවෙන් චම්පාකා රාමනායකට නැවත නැවතත් ගෞරවයට පාත්ර වී තිබේ.මුලින් තමා ගැන උනන්දුවක් දැක්වූ රාමනායක, ඔහුගේ වෘත්තීය ජීවිතයේ අත්තිවාරම බවට පත්වූ යෝර්කර් විසින් ඔහු දියත් කළ රාමනායක ය.පුහුණුකරු විසින් පොඟවා ගැනීම අසල සපත්තු යුගලයක් මැලියම් කරයි.මාලිංග ඔවුන්ට පන්දු යැවීම සඳහා පැය ගණනක් ගත කරනු ඇත.මුලින් තෝරාගනු ලැබුවේ 2004 දී ශ්රී ලංකා කණ්ඩායම සමඟ මාලිංග සංචාරය කරන ලෙස මාලිමා සංචාරය කර ඔහුගේ ටෙස්ට් තරගය සඳහා ඔහු කියා සිටි බවයි - ඔහු ඩොරන් හි ඩැරන් ලෙමින් සහ ආදම් ගිල්ක් ක්රිස්ට් එකසේ.ඊළඟ වසරේදී නවසීලන්තයේ ආකර්ෂණීය චාරිකාවකදී, ඔහුගේ අඩු Sunch ූ දකින්නේ නවසීලන්ත පිතිකරුවන් පන්දුව නැති වී යන විට ඔවුන්ගේ කලිසමෙහි වර්ණය වෙනස් කරන ලෙස ද ජම්පර්ගෙන් ඉල්ලා සිටියේය.නමුත් එය දෛවයේ අද්දර මාලිංගට මැනිං කෑගැසීමෙහි විය.2007 ලෝක කුසලාන තරගාවලියේදී ශ්රී ලංකාව දකුණු අප්රිකාවට එරෙහිව ජයග්රහණයේ අද්දරට කඩුලු 4 ක් ලබා ගනිමින් පන්දු 4 කදී කඩුලු 4 ක් කඩුලු 4 ක් ලබා ගනිමින් පළමු ස්ථානයත් ඔහු පන්දු 4 ක් ලබා ගත්තේය.ඔහුට තවත් එක්දින තොප්පි දෙකක් තිබේ - ඕස්ට්රේලියාව සහ කෙන්යාවට එරෙහිව - ඔහු ඉක්මනින් ශ්රී ලංකාවේ සීමිත ඕවර ශීර්ෂයක් ලෙස තමන් විසින්ම ස්ථාපිත කළේය.මහේලා ජයවර්ධන, කුමාර් සංගක්කාර සහ තිලකරත්න දිල්ෂාන් ද වැදගත් කාර්යභාරයක් ඉටු කළද මාලිංග 2007-2014 සිට ගෝලීය තරඟාවලි වලදී ශ්රී ලංකාවේ විශිෂ්ට ධාවන තරඟයේ තනි වැදගත්ම ක්රීඩිකාව ලෙස මාලිංග ද වැදගත් කාර්යභාරයක් විය.ටෙස්ට් තරගයේදී ඔහුගේ පූර්ණ හැකියාවන් නොතිබූ යැයි මල්ලිංග කිසි විටෙකත් ඔහුගේ පූර්ණ හැකියාවන් නොදැන හැඟෙන බව හැඟී යයි.ඔහු ශ්රී ලංකාව සඳහා ටෙස්ට් කඩුලු 100 ක් කරා ළඟා වීමට තුන්වන ක්රීඩකයා පමණක් වූ නමුත් 2008 දී දණහිසේ ආබාධයක් ඔහුට වසර දෙකකට අඩු විය.මුත්තයියා මුරලිදරන්ගේ සමුගැනීමේ මාලාව සඳහා ඔහුව නැවත ලබා ගත් නමුත් නැවතත් මාස කිහිපයක් තිස්සේ තුවාල ලැබීය.2011 අපේ්රල් මාසයේ දී, වයස අවුරුදු 27 දී මාලිංග සිය \"නිදන්ගත දණහිසේ ආබාධය\" කළමනාකරණය කිරීමට ඇති ආශාව උපුටා දක්වමින් සිය පරීක්ෂණ විශ්රාම ගැනීම නිවේදනය කළේය.ඔහුගේ සුවිශේෂී පන්දු යැවීමේ ක්රියාව ඔහුගේ ඉණ සහ කකුල් වල සන්ධි මත සැලකිය යුතු බරක් තබයි කියා සිතුවාය.කෙසේ වෙතත්, අයි.පී.එල්.එළඹෙන වර්ෂාව තුළ මාලිංග ශ්රී ලාංකික පංකා සහ මාධ්ය සමඟ සංකීර්ණ සම්බන්ධතාවයක් ඇති කර ගනු ඇත.ඒ කාලේ ඔහු මුම්බායි නියෝජනය කරමින් අයි.පී.එල්.මාලිංගගේ හොඳම මොහොත ඇති වූයේ 2014 ලෝක විස්සයි විස්ස තරගාවලියේදී, ඔහු නාමිකව පිළිමළුම් ගෙවීම තුළින් පැත්තේ පැත්තකින් වියළී ගිය නමුත්, වඩා වැදගත් දෙය නම්, ඉන්දියානු මැද පෙළට මුලපිටීම සඳහා සායනික අවසන් අක්ෂර වින්යාසයක් ලබා දුන්නේය.එම මාතෘකාව ජය ගැනීම සඳහා ශ්රී ලංකාව කටයුතු කරනු ඇති නමුත් වැඩි කල් යන්නට මලිංගගේ වෘත්තිය යෝග්යතා ගැටළු නිසා - ස්වේච්ඡාවෙන් හා ස්වයංපෝෂිත වේ.2014 අගභාගයේදී දිගුකාලීන වළලුකර පැමිණිල්ලක් එයට ශල්යකර්මයක් අවශ්ය තාක් දුරට පිරිහී ගියේය.මාලිංග 2015 ලෝක කුසලානය හරහා හීන වී ඇති බලවේගයක් වූ අතර ඔහුගේ පසු කාලීනව සැලකිය යුතු ලෙස මන්දගාමී වූ අතර, ඔහු ද බර තැබුවේය.ශ්රී ලංකාවේ 2016 ලෝක විස්සයි විස්ස ව්යාපාරයට වඩා විස්සයි 20 කපිතාන්වරයෙකු ලෙස ඔහු නැවතත් ඔහුගේ වම් කකුලේදී යළිත් වරක් විස්සයි 20 කේන්ද්රය ඉදිරියෙන් සිටියේය.මෙම තුවාල හේතුවෙන් ඔහුගේ වෘත්තිය සමතුලිතතාවයේ රැඳී සිටින ලෙස ඔහු සමහර අවස්ථාවලදී යෝජනා කර තිබේ.තවත් සමහරු ඔහු පවසා ඇත්තේ ඔහු තවත් වසර කිහිපයක ක්රීඩා කිරීමට කැමති බවයි.ඇන්ඩ rew ෆිදෙල් ප්රනාන්දු",
    "Nuwan Kulasekara": "සාපේක්ෂ අපැහැදිලි තත්වයෙන් තෝරා ගැනීමෙන් පසු 2003 නොවැම්බර් මාසයේදී දම්බුල්ල ප්රදේශයේදී එංගලන්තයට එරෙහිව කුලසේකර සිය පළමු එක්දින තරගයේ ක්ෂණික හැඟීමක් ඇති කළේය. අවුල්සහගත දිගේ දුවන හා විප් ඇප්රීය ක්රියාවකින් ඔහු සජීවී වේගයක් ජනනය කරයි, පන්දුව මැහුම් වලින් ඉවතට ගෙන පන්දුව නැවත ප්රතිලෝම කර දැමිය හැකිය. වැදගත්ම දෙය නම්, ඔහුට තද රේඛාවක් හා දිගක් පවත්වා ගත හැකිය. ඔහු සිය වෘත්තිය ආරම්භ කළේ සොෆ්ට්බෝල් ලෝලීන් ක්රිකට් ක්රීඩාවට මාරුවීමට පෙර, නුගෙගොඩ ක්රිකට් සමාජයට හා පසුව ගාලේ ක්රිකට් සමාජය සමඟ සම්බන්ධ වීමෙනි. ඔහු 2002-03 දේශීය තරඟයේදී හොඳම පන්දු යවන්නාගේ සම්මානය ද දිනා ගත්තේය. 2006 දී එංගලන්තයට එරෙහිව මංගල පරීක්ෂණයක් පනස්දෙනෙකු පහළ පිළිවෙලට ඔහුගේ ස්වාභාවික පිතිකරණ හැකියාවන් පෙන්නුම් කළහ. නමුත් ඔහුගේ පන්දු යැවීම එම චාරිකාව අතරතුර එම චාරිකාව අතරතුර විනිවිද යාමක් නොමැති අතර ඔහු මාස ​​අටක් සංචිතයෙන් ඉවත් කළේය. කෙසේ වෙතත්, ඔහුගේ ක්රියාව සඳහා වෙහෙස මහන්සි වී වැඩ කිරීමෙන් අමතර අංගයක් ලබා ගත් ඔහු ශ්රී ලංකාවේ ලෝක කුසලාන සංචිතයේ ස්ථානයක් ලබා ගත්තේය. ඔහු ශ්රී ලංකාවේ වැඩ වර්ජන පන්දු යවන්නන්ගෙන් කෙනෙකු වීමට නැගී සිටි අතර 2008 අප්රියෙල් මාසයේ සිට මාස 11 ක කාලයක් තුළ ඔහු කඩුලු 47 ක් දවා ගත්තේය. එය ඊළඟ පා ගමනේ අයිසීසී එක්දින ශ්රේණිගත කිරීම්වල ඉහළින්ම පැනීමට ඔහුට හැකි විය.\nචාලි ඔස්ටින් මාර්තු 2009",
    "Shantha Kalavitigoda": "ශාන්ත කලවිටිගොඩ ශ්රී ලංකාවේ කල් දැමූ සංචාරයටම පුදුමයක් විය\n2004-05 දී නවසීලන්තයට.නමුත් දකුණත් ආරම්භක පිතිකරුවෙකු වන කලවනිගොඩ මෑත වසරවලදී නිහ ly ව දොරට තට්ටු කර තිබේ.තරුණ පිතිකරුවන්ට පැතලි වීමට හා අසමත් වීමට නැවත නැවතත් අවස්ථා ලබා දී ඇති අතර කලවිටිගොඩ පිහිටා ඇත\nපළමු පන්තියේ ලකුණු සමුච්චය කිරීම, සෘතු දෙකේ අටගන් අටසිය අටසිය අටසිය අටසිය අටසිය අටක.2003-04 දී ඔහු අග්රාමාත්ය ලීගයේ හොඳම පිතිකරුවා ලෙස සම්මාන ලැබූ අතර 2004-05 දී ඔහු කොළඹ කෝල්ට්ස් සහ වයඹ පළාත සඳහා ලකුණු 800 කට ආසන්න පිරිසක් රැස් කළේය.ඔහු 2005 මාර්තු මාසයේදී එංගලන්තයට එරෙහිව තෝරා ගැනීමක් දිනා ගැනීමට ප්රමාණවත් විය. දෙවන ටෙස්ට් තරගයේදී පන්දු 177 කදී ලකුණු 83 ක් ලබා ගනිමින් ඔහු ඉනිමකින් ලකුණු 83 ක් ලබා ගත්තේය.කණ්ඩායම.වෙලින්ටන්හි දෙවන ටෙස්ට් තරගයේදී එම අවස්ථාව ලැබුණු විට ඔහු නුහුරු අංක 7 ස්ථානයකට මිදුණු අතර ඉනිම දෙකෙහිම අසමත් විය.කලවිිතිගොඩගේ ජාත්යන්තර ක්රිකට් ක්රීඩාවේ පළමු රසය 1994 මැලේසියාවේ 1994 පැවති ලෝක කුසලානයේදී 17 න් පහළ කණ්ඩායම සමඟ ය.ඔහු තම පාසල වන නාලන්දා විද්යාලය සඳහා දක්ෂ ලකුණු ලාභියා වූ අතර වරක් මහේලා ජයවර්ධන සමඟ ලකුණු 380 ක සබඳතාවක් බෙදා ගත්තේ මහේල ජයවර්ධන සමඟ මහේල ජයවර්ධන සමඟ එස්එස්සී, ඔහුගේ පළමු සමාජය වන එස්එස්සී, යටි මතුවෙමිනි.",
    "Gayan Wijekoon": "ගයාන් විජෙකූන් සැලකිය යුතු දක්ෂතා සහිත තුන් ඉරියව් ක්රීඩකයෙකි.කෙසේ වෙතත්, ජාතික කණ්ඩායමේ ස්ථානයක් මෙතෙක් මග හැරුණු අතර, තේරීම් කාරකයන් බොහෝ විට විජෙකූන්ට වඩා අඩු ප්රසංගවලින් අන් අයව තෝරා ගනී.ඔහු තෝරාගනු ලැබූ ළඟම පැමිණි ළඟම පැමිණි විට 2004-05 දී නවසීලන්තයට ටෙස්ට් සංචිතයේ කොටසක් විය.සජීවී වම් අතක්\n2003-04 දී චිලව් මේරියන්ස් සීසී එක්වීමට පෙර මධ්යම-කුසශ්ර සහ වමතින් පිතිකරුවෙකු සහ වමතින් පිතිකරුවෙකු සහ දෙමළ සංගමය සඳහා පන්දු යැවීම යන දෙකම දිදුලයි.උපුල් චන්දනා සහ මහේලා ජයවර්ධන මේ වන විට විජේකූන්ගේ වෘත්තීය ජීවිතයේ ප්රධාන බලපෑම් වී තිබේ.2005 ජුලි මාසයේදී බටහිර ඉන්දීය කොදෙව් පිලට එරෙහිව පිහිටි ගෘහස්ථ ටෙස්ට් තරගාවලියේදී ඔහු සිය ජාත්යන්තර මංගල්යය කඩුලු 2 ක් දවා ගනිමින්.වසර දෙකක කන්සියුලස් සහ ඊළඟ වසරේදී දකුණු අප්රිකාවේ පැවති විස්සයි විස්ස ලෝක ශූරතාව සඳහා සහ ඊළඟ වසරේදී එය චැම්පියන්ස් කුසලානය සඳහා වූ සංචිතයට ඔහු විසින් සිහිපත් කරන ලදී.",
    "Upul Tharanga": "සමාන මිනුමකින් කලකිරීමට හා සතුටට පත්වූ පිතිකරුවෙක්.ඔහුගේ ටෙස්ට් ජීවිතය කිසි විටෙකත් අක්රිය කර නැතත් - ඔහුගේ ටෙස්ට් ශතවර්ෂ දෙක වසර 10 කට වඩා වැඩි විය.2017 වන විට, මහේලා ජයවර්ධන, තිලකරත්න දිල්ලාරත්න, තිලකරත්න දිල්ෂාන්, කුමාර් සංගක්කාර සහ සනත් ජයසූරිය තරංගගේ එක්දින සියවස් 13 ට වඩා වැඩි ලකුණු රැස් කළහ2005 ජුලි මාසයේදී ශ්රී ලංකා එක්දින සංචිතය දක්වා තරංගගේ ඇමතුම ආසියානු සුනාමි විසින් කරන ලද වසරක් දීප්තිමත් කළ අතර එය බටහිර වෙරළ තීරයේ ධීවර නගරයක් වන අම්බලංගොඩයේ සෝදා ගත්තේය.කුඩා කල සිටම ඔහු විශාල වේලාවට සායර් ලීග් ක්රිකට් තරගය සඳහා සිරස්තල ලීග් ක්රිකට් තරගාවලියේ යෙදුණු අතර වයස අවුරුදු 15 න් පහළ හා 19 න් පහළ සංවර්ධන කණ්ඩායම් හරහා ශ්රී ලංකාව හරහා බාධාවකින් තොරව හා සාර්ථකව සමත් විය.ඔහු 2004 දී වයස අවුරුදු 19 දී 19 වන ලෝක කුසලාන තරගාවලියේදී ඇසට හසු වූයේ ඔහු දකුණු අප්රිකාවට එරෙහිව 117 ක් (දකුණු අප්රිකාවට එරෙහිව ලකුණු 117 ක් ලබා ගනිමිනි.19 න් පහළ කණ්ඩායම පාකිස්තානයට 19 න් පහළ කණ්ඩායම පාකිස්තානයට සහ එක්දින තරග දෙකක අර්ධ ශතක රැස් කළ පසු, ශ්රී ලංකා මණ්ඩලය ඔහුට ලීග් ක්රිකට් ක්රීඩාවට යවා ඔහු එහිදී ය.පෙනවීමේ ක්රිකට් සමාජය සඳහා තරු.ඔහු ඉක්මනින්ම කණ්ඩායමකට උපාධිය ලබා ඇති අතර බටහිර ඉන්දීය කොදෙව් පිලට එරෙහිව සිදුකරන ලද රංගනයෙන් පසුව ඔහු සතියකට පසුව ජාතික සංචිතයට තෝරා ගන්නා ලදී.කෙසේ වෙතත්, 2006 එංගලන්තයේ සංචාරය වන එංගලන්තයේ, විශේෂයෙන් එක්දින තරගයේදී, ශ්රී ලංකාවේ වයිට් වොෂ් 5-0 අතර වූ පළමු තරඟයේදී ලෝඩ්ස් හි විශිෂ්ට ශතවර්ෂයක් සහ තවත් ශතකයඔහු සහ ජයසූරිය පන්දුවාර 32 කදී ලකුණු 286 ක ආරම්භක ස්ථාවරයක් දැවී ගියහ.චැම්පියන්ස් කුසලානය තුළ පසුපසට ගොස් ඔහු ජයසූරිය සමඟ විනාශකාරී හවුල්කාරිත්වයක් ඇති කළේය.කෙසේ වෙතත්, චැම්පියන්ස් කුසලානයෙන් පසුව, එය ඔහුගේ ඊළඟ සියවස වන තෙක් තවත් වසර තුනක් වනු ඇත.එංගලන්තයට එරෙහි අර්ධ අවසන් පූර්ව වටයේදී සිම්බාබ්වේට සහ නොදැවී ලකුණු 102 ක් රැස් කරමින් 2011 ලෝක කුසලාන තරගාවලියේදී ඔහු සමෘධිමත් විය.2013 දී, කැරිබියානු ජාතිකයන්හි ත්රිත්ව තරගාවලියක් අතරතුරදී ඔහු ජැමෙයිකාවේ ඉන්දියාවට එරෙහිව නොදැවී ලකුණු 174 ක් රැස් කළ නමුත් ඉනිම 18 ක් සඳහා ඔහුගේ අවසන් පනස් ලකුණු පනස් ලකුණු වනු ඇත. ඔහු කණ්ඩායමෙන් පිටත සැලකිය යුතු කාලයක් ගත කළේය.ඔහු 2015 ලෝක කුසලාන තරගාවලියේදී තුවාල ලබා ඇති බව කෙටියෙන් ආපසු පැමිණි නමුත් ඔහුගේ 2016 නැවත පැමිණීම තරමක් දීප්තිමත් ලෙස වැඩි වැඩියෙන් පරාජයක් ලබා දුන් අතර සිම්බාබ්වේ හි ත්රිත්ව තරගාවලිය සඳහා නායකයා ලෙස නම් කරන ලද අතර, ඇන්ජලෝ මැතිව්ස් 2017 න්දකුණු අප්රිකාවේ මාලාව.\nජනවාරි 2017",
    "Chamara Kapugedera": "මෑත වසරවලදී ශ්රී ලංකාව නියෝජනය කළ වඩාත් කලකිරවන ක්රීඩකයන් අතර, චමාරා කපුගෙදර 2006 සිට 2012 දක්වා ඉහළ මට්ටමේ ඉහළ මට්ටමේ පැවති නමුත් ස්ථානයක් නියපොතු කිරීමට සමත් නොවීය.ඔහු දුර්ලභ දක්ෂතාවයක් බව කිසි විටෙකත් සැකයක් නැත, නමුත් ජාත්යන්තර ක්රිකට් ක්රීඩාවේදී අමු ery ල, සාමාන්යයෙන් ලකුණු වලට පරිවර්තනය වී නොමැත.සමහර විට ඔහුගේ රසිකයන් තර්ක කරනු ඇත්තේ සීමිත ඕවර ක්රිකට් ක්රීඩාවේදී ක්රීඩාවට විශාල බලපෑමක් ඇති කිරීම සඳහා තමාට බැරෑරුම් ලෙස පෝෂණය කිරීමට ඉල්ලා සිටින බවයි.එසේ වුවද, ඔහුගේ ප්රතිලාභ නිහතමානී වූ අතර, ඔහුගේ ස්ථානය අවම වශයෙන් අවම වශයෙන් විය නොහැකි විය.කෙසේ වෙතත්, කපුගෙදර විස්සයි 20 ක්රිකට් ක්රීඩාවේදී පුනරුංකයේ පුනරුදයක් 2015 දී භුක්ති වින්දා.දශකයකට වැඩි කාලයක් තිස්සේ ඉහළ මට්ටමේ ක්රිකට් ක්රීඩා කර ඇති ඔහු තවමත් තරුණ ය. ඔහු තවමත් ස්ථාවර ක්රීඩකයෙකු ලෙස යහපත ලබා ගත හැකිය.ස්වාභාවිකවම ආක්රමණශීලී වන අතර, මායිම ඉවත් කිරීමේ හැකියාව, කපුගෙදර ශ්රී ලංකාවේ වයස අවුරුදු 19 න් පහළ සකස් කිරීම් වලින් සොයාගත් අව්යාජව විශ්මය ජනක පිතිකරුවන් කිහිප දෙනාගෙන් එකකි.වයස අවුරුදු 11 සිට, ඔහු මහනුවර මහනුවර ධර්මරාජා විද්යාලය සඳහා මුලින්ම ආරම්භ වූ විට කපුග්ගෙදෙරා ඉණිමඟ තල්ලු කිරීමට අවස්ථාවක් අහිමි වී තිබුණි.ඔහු U-13 සිට පළමු XI දක්වා සියලු කනිෂ් School පාසල් පැතිවලින් වැසී ගියේය.2003-04 කන්නයකින් පසුව, ඔහු ලකුණු 1000 කට වඩා වැඩි ප්රමාණයක් රැස් කළ පසු, ඊළඟ වසරේදී U-19 පාකිස්තානයට පිවිසෙන අතර, ලෝක ශූරයින්ට එරෙහි එක්දින තරගාවලියේදී 131 ක විශිෂ්ට තට්ටු 131 ක් රැස් කළේය.2005 දී ශක්තිමත් නවසීලන්තයට එරෙහිව ශ්රී ලංකාව වෙනුවෙන් ශ්රී ලංකාව වෙනුවෙන් ශ්රී ලංකාව වෙනුවෙන් පළමු තරඟයේදී ඔහු 70 දෙනෙකුට 70 ක්ම පරිභෝජනය කළ ඉනිමක් විය. තේරීම් කරුවන්, නව දක්ෂතා සොයා ගැනීමට මංමුලා සහගතයසංවර්ධන පුහුණුකරුවන්ගේ දිලිසෙන වාර්තා කිහිපයකට පසු මුල් ප්රවර්ධනය හා ඔහුගේ සංචිතයට මුල් ප්රවර්ධනය සහ වේගයෙන් ඔහු සොයා ගත්තේය.කපුගෙඩෙරාගේ පියා, හිටපු ධර්මරාජා ක්රිකට් ක්රීඩකයෙකු ද මුල් පුහුණුකරු සහ ඔහු සංවර්ධනය කිරීමට අවශ්ය සියලු දිරිගැන්වීම් ලබා දුන්නේය.ද ඩේවිඩ් කරුණාරත්න (ඔහුගේ පළමු පුහුණුකරු) සහ සුමිරා වර්නකුලසූරිය (ඔහුගේ U-CORDAY) කපුගෙඩෙරාගේ වෘත්තිය හැඩගැස්වීමේ වැදගත් කාර්යභාරයක් ද ඉටු විය.ඔහු ප්රථම වරට නොවැම්බරයේ ඉන්දියාවට එරෙහි ජාතික සංචිතයේ දී තෝරාගත් නමුත් තුවාලයක් ඇතිව සංචාරයෙන් ඉවත් විය.කෙසේ වෙතත්, ඔහු 2006 දී පර්ත් ඕස්ට්රේලියාවට එරෙහිව ඕස්ට්රේලියාවට එරෙහිව සිය එක්දින තරගයේදී ඕස්ට්රේලියාවට එරෙහිව තරග විය.\n\nEspncricinfo කාර්ය මණ්ඩලය",
    "Chamara Silva": "චමාරා සිල්වා මහතා මුලින්ම එම ස්ථානයට පැමිණියේ 19 හැවිරිදි 19 හැවිරිදි 19 හැවිරිදි සිසිලනූ තරුණ ප්රතිපත්තියේ ප්රතිලාභියෙකු ලෙස, එම අවස්ථාවේ තේරීම් කමිටු සභාපති සිදත් තෙත්මුනි විසින් අනුගමනය කරන ලද තරුණ ප්රතිපත්තියේ ප්රතිලාභයකි. ඔහු ඕස්ට්රේලියාවට එරෙහි එක්දින තරගයේ 54 ක් ලබා දුන්නේය. පන්දුවට පහර දෙන අතරතුර ඔහුගේ හැසිරීම් - විශේෂයෙන් දුනු කකුල් සහිත ස්ථාවරය සහ ෆ්ලේසින් ආවරණ ඩ්රයිව් - මහා අරවින්ද ද සිල්වා සමඟ සැසඳීම් ආකර්ෂණය කර ගත්තේය. එහෙත්, දරුණු ලෙස දක්ෂ වුවත්, චාරිකා (1999), සිම්බාබ්වේ (1999), පාකිස්තානය (2000) සහ එංගලන්තය (2002) සහ එංගලන්තය (2002) සහ එංගලන්තය (2002) ට චාරිකා වලදී නිත්ය ස්ථානයක් ලබා ගැනීමට ඔහු අසමත් විය. එංගලන්ත සංචාරයෙන් පසු ඔහු තේරීම් කරුවන්ගේ රේඩාර් වෙතින් ඉවත් වී නැවත දේශීය ක්රිකට් ක්රීඩාවට පැමිණියේ පනාදුර ක්රිකට් සමාජ ශාලාවට ය. ඉදිරි වසර හතර තුළ ඔහු දක්ෂ ලකුණු ලාභියෙකු වූ අතර, විශේෂයෙන් 2004-05 කන්නය සඳහා සෙබස්තියන්වරුන්ගේ පියවරක් වූ පසු. අවසානයේදී ඔහු ටෝම් මනෝභාවයේ ඇස අල්ලා ගත් අතර, ඔහු ජාතික සංචිතයේ නොසිටියේ මන්දැයි තේරුම් ගත නොහැකි විය. ශ්රී ලංකා ශ්රී ලංකා ආයතනයට වේගයෙන් උසස්වීමක් සහ ඉන්දියාවට සාර්ථක සංචාරයකින් පසුව ඔහු දී ඉන්දියාවට සාර්ථක සංචාරයකින් පසුව ඔහු දිගු කල් ඉකුත් වූ ජාත්යන්තර සිහිපත් කළේය. තවමත් 27 ක් වන අතර, ඔහු නවසීලන්ත සංචාරය සඳහා පුදුමයට පත්වූ අතර ඔහුගේ මංගල තොප්පිය ක්රයිස්ට්චර්ච් හි පැවති පළමු ටෙස්ට් තරගයේදී ඔහුගේ මංගල තොප්පිය භාර දෙන ලදී. ඔහු යුගලයක් ලබා ගත් අතර ශ්රී ලංකාවට කඩුලු 5 කින් පරාජයට පත්වීමත් සමඟම ආරම්භ වූ ආරම්භයකි. කෙසේවෙතත්, ශ්රී ලංකාවේ කණ්ඩායම් කළමනාකාරිත්වය වෙලින්ටන්හි දෙවන ටෙස්ට් තරගය ගැන විශ්වාසය තබා ගත් අතර, පළමු ඉනිමේදී ලකුණු 61 ක් ලබා ගනිමින් දෙවන ඉනිමේදී ලකුණු 152 ක් රැස් කළේය. ඔහුගේ මංගල කන්යා සොහොයුරිය එක්දින ශතවර්ෂයේ ඉන්දියාවේ ලෝක කුසලානයට සති තුනකට පෙර ඉන්දියාවේදී ඉන්දියාවේ ය.\nචාලි ඔස්ටින් 2007 පෙබරවාරි",
    "Malinda Warnapura": "ඔහුගේ ක්රිකට් පරම්පරාව තිබියදීත්, මාලින්ද වර්න්පුර සිය නඩුව ජාතික පිළිගැනීම සඳහා ඉදිරිපත් කිරීමට එබීමට කාලය ගෙන තිබේ.1998-99 දී ඔහුගේ පළමු පන්තියේ වෘත්තිය ආරම්භ කළ ඔහු 2006 වන තෙක් ඔහු ඇත්තටම ඔහුගේ සලකුණ ඇති කළේය.දුලෙප් කුසලාන කුසලානය සඳහා සහභාගී වීම සඳහා ශ්රී ලංකාව A ඉන්දියාවේ සංචාරය කිරීම මෙම අලංකාර වම් අතේ මැද පෙළ පිතිකරු මල දුටුවේය.ඔහු තරග තුනේ තරගාවලිය අවසන් කළේ 102.25 කදී ලකුණු 421 ක් රැස් කරමින්, ඉන්ඩන් උද්යානයේදී පරාජිත සියවස් ගණනක් ඇතුළත් වූ ලකුණු 421 ක්.නොදැවී ලකුණු 111 ක් තම කණ්ඩායම තරගාවලියේ අවසන් තරඟාවට ගෙන ගියේය.අවසානයේදී ඔහු විසින් නෝර්ත් කලාපය, අවසානයේ ජයග්රාහකයින්ට එරෙහිව අවසන් තරඟයේදී ලකුණු 149 ක් රැස් කළේය.පිළිගැනීම වහාම අනුගමනය කළේ නැත.ඉන් පසුව නවසීලන්තයේ සංචාරය සඳහා ඔහු නොසලකා හරින ලද නමුත් ශ්රී ලංකාව වෙනුවෙන් ලකුණු රැස් කළේය. ඒ.පසුව බංග්ලාදේශයට එරෙහි ශ්රේණි එම අයකිරීමකි.ඔහු කෝල්ට්ස් හි පිහිටි ඔහුගේ නිවසේ පළමු නිල නොවන ටෙස්ට් තරගයේදී ඔහු කෙල්ට්ස් හි පිහිටි පළමු නිල නොවන ටෙස්ට් තරගයේදී ලකුණු 243 ක් රැස් කළ අතර දෙවන නිල නොවන එක්දින තරගයේදී නොදැවී ලකුණු 104 ක් රැස් කළේය.ඔහුගේ පළමු පියවර ටෙස්ට් ක්රිකට් ආයතනයට - 2007 දී බංග්ලාදේශයට එරෙහි පියවරු මාලාව තුළ - ඔහුගේ පළමු පන්දුව නෙරපා දැමූ බැවින්, ඔහු තම පළමු පන්දුව නෙරපා දැමීය.ඔහුගේ දෙවන ටෙස්ට් තරගයේදී ඔහු සිය දෙවන ටෙස්ට් තරගයේදී ප්රශංසා කළේය.",
    "Chanaka Welegedara": "වෙලේගෙදර ක්රිකට් ක්රීඩාවට ප්රමාද ආරම්භයක් විය. වයස අවුරුදු 17 දී මාතලේ ශාන්ත තෝමස් විද්යාලයේ ක්රීඩාව සඳහා ක්රීඩාව කිරීමට ඔහු ඉගෙන ගත් නමුත් පළාත් තරඟවල ඔහු වේගවත් ප්රගතියක් ලබා ගත්තේය. ඔහු කොළඹට පැමිණි විට ශ්රී ලංකා වේග පන්දු යවන්නාගේ ප්රධානත්වයෙන් යුත් ශ්රී ලංකා වේග පන්දු යවන්නා වන රූමේෂ් රත්නායකගේ ප්රධානත්වයෙන් යුත් ශ්රී ලංකා වේග පන්දු ඇකඩමිය විසින් ඔහු විසින් තෝරා ගන්නා ලදී. චෙන්නායි හි ඇකඩමිය ඔහුගේ කුසලතා තවදුරටත් වර්ධනය කර ගැනීම සඳහා. 2002 සිට මුවර්ස් ශ්රේෂ් SC ාධිකරණය සඳහා ක්රීඩා කිරීම 2002 සිට ඔහු සිය සමාජ ශාලාව 2002-03 දී ප්රිමියර් ලීග් ශූරතාවට පන්දු යැවීය. නමුත් ඔහුගේ වෘත්තීය-හොඳම කාර්ය සාධනය පැමිණියේ ඊළඟ කන්නයේ දී ඔහු කොළඹ ක්රිකට් සමාජයට එරෙහිව කඩුලු 9 ක් දවා ගනිමින් කඩුලු 9 ක් දවාලීය. ඔහු සිය කඩුලු වලින් බහුතරයක් පන්දු යැවීම සහ පිතිකරුවන්ගේ කකුල මීට පෙර රැගෙන ගියේය. වෙලේගෙෙරා ශ්රී ලංකා ඇකඩමිය පැත්තෙන් සාජා සංචාරය කළ අතර එමඟින් එක්සත් අරාබි එමීර් නුවරට එරෙහිව කඩු 3 ක් ද ලබා ගත් අතර එය ශ්රී ලංකාවට තෝරාගනු ලැබීය. නමුත් ඔහු වළලුකර ආබාධයකට මුහුණ දුන් අතර ඕස්ට්රේලියාවේ ක්රියාත්මක විය. තුවාලය වසර 1 ක කාලයක් තුළ ක්රිකට් පිටියෙන් kinge තුවක්කු වූ නමුත් ඔහුගේ ටෙස්ට් තරගය 2007-08 තරගාවලියේදී එංගලන්තයට එරෙහිව ගාල් කිහිපයකට එරෙහිව පැමිණියේය.බොහෝ විට වේස් ප්රහාරයේ නායකයා ලෙස, ලසිත් මාලිංග නැවත ටෙස්ට් තරගාවලියට නොපැමිණීම බව පෙනේ. වෙලේගේදරට ඉහළ මට්ටමේ මිශ්ර කාලයක් ගත වී ඇති බව පෙනේ.ඔහු 2011 දී සැලකිය යුතු ලෙස වැඩිදියුණු කළ අතර, පළමු ඉනිමේදී ලකුණු 52 කට කඩුලු 5 ක් දවාගනිමින්, දකුණු අප්රිකාවේ ශ්රී ලංකාවේ මංගල ටෙස්ට් ජයග්රහණය ආරම්භ කිරීමට ඔහු කඩුලු 5 ක් දවා ගනිමින් ඔහු කඩුලු 5 ක් දවා ගත්තේය.එතැන් සිට ඔහු විවිධ තුවාල වලින් පීඩා විඳි අතර ඔහුගේ නොපැහැදිලි අය පසුගිය වසරේදී වේගයෙන් පෙරසුනල පෙරසුළු භූමිකාව සඳහා හිමිකම් පෑමක් කර තිබේ.සාඩි තව්ෆීක් සහ එස්පීක්රිකින්ෆෝ කාර්ය මණ්ඩලය 2008 ජූලි",
    "Ishara Amerasinghe": "අඩි හයක උස වේගවත් පන්දු යවන්නෙකු වන ඉෂාරා අමරසිංහට වේගයෙන් ජනනය කිරීමේ හැකියාව ඇත, නමුත් ඔහුගේ වෘත්තීන්හි වැඩි කාලයක් සඳහා ඔහු නිරවද්යතාවයේ lack නතාවයෙන් පීඩා වින්දා. ඔහු 1999 සිට ශ්රී ලංකාවේ නිත්ය සාමාජිකයෙකු වූ අතර, ඔහු කැපී පෙනෙන සුප්රාන් අයගේ කන්නයේ කන්නයේ දී කොළඹ කෝල්ට්ස් සඳහා ප්රිමියර් ලීග් තරගාවලියේදී කඩුලු 5 ක් ලබා ගත්තේය. එම කාර්ය සාධනය දකුණු අප්රිකාවේ දකුණු අප්රිකාවේ සංචාරය කිරීමේ කවුළුවක්, කණ්ඩායමක් සමඟ සහ පසුව එංගලන්තය සමඟ සංචාරය කළේය. ජාතික වේගවත් පන්දු යැවීමේ පුහුණුකරු චම්පක රාමනායක සහ කණ්ඩායම් පුහුණුකරු චම්පක රාමනායක සමඟ දැල්වල සමහර වෙහෙස මහන්සි වී වැඩ කරන අතර, එහි ප්රති ulted ලයක් ලෙස වැඩිදියුණු කළ රේඛාවක් සහ දිගක් සිදුවිය. 2007 ලෝක කුසලානයෙන් පසු අබුඩාබියේ පාකිස්තානයට එරෙහිව එක්දින තරගාවලියට පෙර පැවති තුවාලයක් හේතුවෙන් තවත් වසර පහක සංචාරයක් හේතුවෙන් ඔහු එක්දින තරගාවලියට බලා සිටියේය. ඔහු 2008 මුල් භාගයේදී දිල්හාරා ප්රනාන්දු වෙනුවට දිල්හාරා ප්රනාන්දු වෙනුවට ආදේශකයක් ලෙස සංචාරය කළ අතර කන්නයේ කන්නයේ ආදේශකයක් ලෙසත්, එක් කන්නයකත්, නමුත් ඔහුගේ ස්ථානය ජාතික කණ්ඩායමේ තබා ගැනීමටත් ප්රමාණවත් නොවීය.\nසාඩි තව්ෆීක් ඔක්තෝබර් 2009",
    "Ajantha Mendis": "වීඩියෝ විශ්ලේෂක සහ සුපිරි මන්දගාමී ප්රතිස්ථාපන යුගයේ භ්රමණය වන අජන්තා මෙන්ඩිස් විසින් අභිරහස නැවත හඳුන්වා දෙන ලදී.මුල් අභිරහස් දඟ පන්දු යවන්නා, ජැක් ඉවර්ස්සන් සහ \"ඉවර්ස්සන්\", ජෝන් ග්ලීසන්, මෙන්ඩිස් තම ඇඟිල්ලේ සවි කර ඇති ලොව පුරා ලෝකය මවිතයට පත් කළහ.ඔහුගේ බිම් දරුවන් පැමිණියේ \"කැරම් බෝලය\" යන නව නමක් සමඟිනි.ඔහුගේ පළමු, වඩාත්ම ප්රචලිත හා වඩාත් සවිස්තරාත්මක වින්දිතයින් ඔහුගේ කාලයේ වඩාත්ම මධ්ය පරි re ු ගණනක් විය: රාහුල් ඩ්රාවිඩ්, සචින් තෙන්ඩුල්කාර්, වී.වී.එස්. ලක්ෂ්මන් සහ සෞන්ගර්මන් සහ සබ්රාව් ගංගුල.ඉන්දියාවේ එක්දින පාර්ශවයට එරෙහි ආසියානු කුසලාන අවසන් මහා තරගයේදී හයකෑමේ හයෙන් හය දෙනෙකු කෙරෙහි සමීපව අනුගමනය කරමින් මෙන්ඩිස් සංවේදී පරීක්ෂණ ආරම්භයක් කළේය.ඔහු සිය පළමු ටෙස්ට් තරගයේදී කඩුලු 8 ක් ද, ඔහුගේ පළමු තරගාවලියේදී 26 දෙනෙකු ද 26 දෙනෙකු ඔහුගේ පළමු තරගාවලියේදී ලකුණු 3 ක ආරම්භක මාලාවක් සඳහා වූ ඇලෙක් බෙඩර්ගේ වාර්තාවට වඩා වැඩි ය.මුල් සාර්ථකත්වය ඔහුගේ විචල්යතාවයන්හි වැඩි ප්රමාණයක් ඉදිකරන ලදි - ඕෆ්බ්රීක්ස්, ටොප්ෆිලයින්, කැරම් බෝල, ගොග්ලි, මුත්තියා මුරලිදරන් සමාගමේ සමාගමක් ලෙස.අභිරහස පැළඳ සිටි නිසා, ලෝකය ඔහු සමඟ හිරසන් හා ග්ලීසන් සමඟ බොහෝ සෙයින් ඔහු සමඟ හසු වූ අතර, මුල් පොරොන්දුවට අනුව ජීවත් වීමට මෙන්ඩිස් අසමත් විය.මුරලිගි විශ්රාම යන විට, ප්රමුඛතම ශ්රී ලාංකික දඟ පන්දු යවන්නා ලෙස මෙන්ඩිස් විසින් ලෝකයේ ප්රමුඛතම දඟ පන්දු යවන්නා ලෙස ඉස්මතු කිරීමට ඉඩ තිබූ විට විශාල වෙනසක් සිදු නොවීය.ටෙන්ඩිස් අඛණ්ඩව be ෂධීය දඟ පන්දු යවමින් කෙටි ආකෘති වලදී පිතිකරුවන්ට හැඩගැසීමට වැඩි කාලයක් නොමැති වීම.ඔහු විස්සයි 20 අයි ඉනිමක හොඳම සංඛ්යාලේඛන සඳහා වාර්තාව දරයි, නමුත් දිගු ආකෘති සඳහා ශ්රී ලංකා පැත්තේ නිත්ය ස්ථානයක් සොයා ගැනීමට අපොහොසත් වේ.ඔහුගේ වෘත්තීය ජීවිතයේ ඉතිරි කාලය සාර්ථකත්වය නැවත සොයා ගැනීමට උත්සාහ කිරීමේදී ව්යායාමයක් වනු ඇත, මෙවර හොඳ භ්රමණය වන දෙදර්ත් මොංගා වීම නිසා",
    "Dhammika Prasad": "2006 දී බංග්ලාදේශයට එරෙහි එක්දින තරගයේදී ධම්මිකා ප්රසාද් පන්දුවක කඩුලු 2 ක් දවාගත් විට ජාතික කණ්ඩායම සමඟ හොඳ වෘත්තියක් බැලුවායඑය ඔහු මාස හයක් ක්රීඩාවෙන් ඉවත් කළේය.සුවය ලැබූ පසු, 2007 දී ශ්රී ලංකාව එංගලන්ත සංචාරයක් සඳහා ඔහු තෝරා ගනු ලැබූ අතර එහිදී ඔහු හොඳින් ක්රීඩා කිරීමට හා ජාතික කණ්ඩායමේ එම ස්ථානය නැවත ලබා ගැනීමට බලාපොරොත්තු විය.මෙම ගවේෂණයේදී ඔහුට උපකාර කළ දෙය නම් එක්දින තරගයේදී මරණයට පත්කිරීමේ හැකියාව නිසා හොඳ යෝර්කර් ඇතුළු සියුම් වෙනස්කම් වර්ධනය කිරීමට වෙහෙස මහන්සි වී වැඩ කිරීමයි.දේශීය පෙරමුණේ නිරන්තර ප්රසංග 2008 අගෝස්තු මාසයේදී ඉන්දියාවට එරෙහිව පළමු ටෙස්ට් කැප් රථයක් ශ්රී ලංකාව ඔවුන්ගේ ප්රහාරයට වේගයක් එක් කිරීමට උත්සාහ කිරීමත් සමඟම ඉන්දියාවට එරෙහිව පළමු ටෙස්ට් තොප්පියකි.ඉනිමේ දී ඉන්දියාවේ හොඳම පිතිකරුවා වන විරේන්ද්ර සෙවාග්ගේ කඩුල්ල ඇතුළු කඩුලු 5 ක් දවා ගනිමින් ඔහු කතුහටික විය.අංක 3 පිතිකරු ලෙස කන්දනා හි ඩි මැසෙනෝඩ් විද්යාලයේ දී ප්රසාද් සිය ක්රිකට් ආරම්භ කිරීම සිත්ගන්නා කරුණකි.ඔහු මාරු වීමට බල කරන විට 17 වන තෙක් ඔහු මෙම තනතුරේ පැවැත්වීය\nනව පන්දුව සමඟ පාත්ර වීමට සුදුසු කිසිවෙකු පාසලට සොයාගත නොහැකි වූ නිසා වේගයෙන් පන්දු යැවීමට පෙර.ඔහු 2002 දී වයස අවුරුදු 19 න් පහළ ලෝක කුසලානය සඳහා තෝරා ගනු ලැබූ අතර එංගලන්තයේ ක්රීඩා කිරීම සඳහා මාස හයක ශිෂ්යත්වයක් දිනා ගැනීමේදී ඔහුගේ රංගනය ගෙවා ඇත.ප්රසාද්ගේ හොඳම පන්දු යැවීමේ උත්සාහය දැන් අක්රියව පළාත් තරගාවලියේදී දකුණු පළාත සඳහා කඩුලු 6 ක් (තරග බෑග් දහයක්) 2008 දී va ව පළාතට එරෙහිව කඩුලු 10 ක් දවා ගනිමින් කඩුලු 10 ක්)",
    "Tharanga Paranavitana": "තරංග පරණවිටාන 2003 දී ශ්රී ලංකාවේ නැගී එන කණ්ඩායම් කුසලානය තුළ ප්රමුඛ පෙළේ ආරම්භක පිතිකරුවෙකි. දේශීය දර්ශනය පිළිබඳ අඛණ්ඩ ලකුණු ලබාගෙන ඇති නමුත්, නමුත් එය සිංහල එස්.සී.2007-08 ප්රිමියර් ලීග් ටයර් යන මාතෘකාවක් ජාත්යන්තර මට්ටමින් වර්ධනය කළ මාතෘකාවකි.එස්එස්සී හි සාර්ථක උද් campaign ෝෂනයේදී ඔහු එස්එස්සී හි සාර්ථක උද් campaign ෝෂනයේදී තුන් ලද ලකුණු තුන්සියයක් බවට පත් කළ අතර මෙම කන්නය සඳහා ප්රමුඛ පෙළේ ධාවන ක්රීඩකයා ලෙස ලකුණු 74.41 කට ලකුණු 893 ක් රැස් කළේය.\nශ්රී ලංකාව දකුණු අප්රිකාවේ පැවති නිල නොවන පරීක්ෂණවලදී සියවසක් සහ අර්ධ ශතක දෙකකින් පසුව පැවැත්විණි.ශ්රී ලංකාවේ අනාගත අපේක්ෂාවක් ලෙස පුහුණුකරු චන්දිකා හතුසිංහ මහතාගේ සංචාරයෙන් පසුව නම් කරන ලද පරණවිටාන 2009 මුල් භාගයේදී පාකිස්තානයේ මංගල ටෙස්ට් කැප් එකක් උපයා ගත්තේය.\nක්රික්ෆෝ කාර්ය මණ්ඩලය 2009 ජූලි",
    "Angelo Mathews": "ශක්තිමත් පිතිකරණ තාක්ෂණය, පන්දුව සමඟ නොපැහැදිලි පිතිකරණය, පන්දුව සමඟ නොනවතින, ක්ෂේත්රයේ ඇති මලල මලලෙටික්ස්, එංග්රෝ මැතිව්ස් ශ්රී ලංකාවේ වඩාත්ම වටිනා වත්කම සහ කණ්ඩායම බොහෝ බලාපොරොත්තු එල්ලයි.2009 ලෝක විස්සයි විස්ස 00 තුාවේදී ඇක්රිබ්ටික් සුරකින්න සමඟ පුළුල් ලෙස ප්රශංසා කරමින් ඔහු ඉක්මනින් නැගී සිටින අතර, 2013 පෙබරවාරි මාසයේදී ශ්රී ලංකාවේ බාලගේ ටෙස්ට් කපිතාන්වරය 25 ක් විය.සීමිත ඕවර් ක්රිකට් ක්රීඩාවේ මැතිව්ස්ගේ සමස්ත වටකුරු කුසලතා බෙහෙවින් අඩු ය.2011 දී ලෝක කුසලාන අවසන් පූර්ව පූර්ව තරගයේදී ඔහු ක්වාඩ් එකක් ඇද ගත් විට, ඔහු අවසන් මහා තරගාවලියේදී ලබා දුන් XI හි වෙනස්කම් තුනක් වෙතට බල කළේය.ඔහු සිය ජාත්යන්තර ජීවිතය අව්යාජ තුන් ඉරියව් ක්රීඩකයෙකු වීමේ අභිලාෂයන් සමඟ ආරම්භ කළ නමුත් එතැන් සිට ඔහුගේ පිතිකරණයට ප්රමුඛතාවය ලබා දී ඇති අතර ටෙස්ට් පැත්තේ විශේෂ special ශාස්ත්රාවක් ලෙස .ලදායී ලෙස ක්රියා කරයි.බොහෝ විට අංක 6 හි ඇති වූ කඩුල්ලට පැමිණෙන විට, මැතිව්ස් පහළ මැද පෙළට ildide තිහාසිකත්වය සපයයි. එය ඔහුගේ පැමිණීමට පෙර ශ්රී ලංකාවේ දුර්වලතාවයකි.එක්දින තරගවලදී ඔහු විසින් අනුමත කළ නොහැකි නිමාවන් දෙකක් ලබා දී ඇත - 2010 දී ඕස්ට්රේලියාවට එරෙහිව සහ 2012 දී පාකිස්තානය - ජයග්රහණයන් සමඟ ජයග්රහණය, තිරිසන් පහරදීම්, නමුත් ඔහුගේ හොඳම කෘතිය පරීක්ෂණ ආකෘතියෙන් පැමිණ ඇත.77.33 සාමාන්යයෙන් ලකුණු 77.33 ක් ලෙස ඔහු ලකුණු 1160 ක් රැස් කළ අතර, මැතිව්ස්ගේ හොඳම මොහොත 160 වන හෙලමින්ලි හි දී ශ්රී ලංකාව එංගලන්තයේ පළමු ටෙස්ට් තරගමාලාව දිනා ගන්නා ලදී1998 දී පරීක්ෂණය).මැතිව්ස්ගේ නායකත්වයට පත්වීම ශ්රී ලංකා තේරීම් කමිටුව විසින් තරුණ හා සංවර්ධනය කෙරෙහි නව අවධානයක් යොමු කර තිබේ.වරක් ශාන්ත ජෝශප් විද්යාලයේ සාර්ථක නායකයෙකු සහ 19 න් පහළ කණ්ඩායමේ සාර්ථක නායකයෙකු වූ මැතිව්ස් ශ්රී ලංකා ක්රිකට් නව යුගයක එක්සත් වීම සම්බන්ධයෙන් චෝදනා එල්ල වී තිබේ. කොන්දේ ෆිදෙල් ප්රනාන්දු",
    "Suraj Randiv": "මෘදු ක්රියාමාර්ගයක් ඇති උස බැහැරව, සුරාජ් රන්දිව්ව ගුප්ත බෝල අතහැර දමා ගොස් ඇති අතර ඒ වෙනුවට ගුවන් ගමන, ඩිප් සහ වැදගත් ලෙස, ගිලී යාම, ගිල්වීම සහ වැදගත් ය.ටොප්පින්නර් සහ අත් බෝලය ඔහුගේ එකම විචල්යතා වන අතර ඔහුගේ ඕෆ්බෝරැක් පවා අධික වාරයක් ලබා නොදේ.ඔහු සිය පාසල වයස අවුරුදු 15 ට අඩු පැත්තේ දඟ පන්දු යවන බව සොයා ගන්නා තෙක් දකුණු-හස්ත වේග පන්දු යවන්නෙකු ලෙස සිය වෘත්තීය ජීවිතය ආරම්භ කර ඇති අතර, හිස්වැසුම් පිරවීම සඳහා ඔහුව කැණීමට කැඳවනු ලැබීය.අර්ධකාලීන පන්දු යවන්නෙකු ලෙස ආරම්භ වන ඔහු ඉක්මනින් කඩුලු ලබා ගනිමින් සිටියදී පාසැලේ සිටියදී මාතර එස්.සී.2003-04 තරගාවලියේ තරඟාවලියේ තරග 4 කදී කඩුලු 25 ක් දවා ගනිමින් 2003-04 දින මර්වන් අටපට්ටු සහ මහේලා ජයවර්ධන විසින් ඔහුව එස්එස්සී වෙත ගෙන ආවේය.අටපට්ටු සහ ජයවර්ධන මහතා ඉදිරියේදී ඔහු ඉමහත් ප්රයෝජන ගනිමින්, පීඩනය හා විවිධ ක්ෂේත්රවලට යට පන්දු යැවිය යුතු ආකාරය ඉගෙන ගත්තේය.ඔහු 2005-06 දී පළමු පන්තියේ කඩුලු 55 ක් ලබා ගත් නමුත් ඊළඟ asons තු තුනේ දී පහව ගියේය.කෙසේ වෙතත්, ඔහු 2008-08 දින නැවත ආකෘතියට කඩුලු 43 ක් හා තුවාලයක් ඇති වූ අතර, පාකිස්තානයේ ගැලී ටෙස්ට් තරගය ජාතික ඇමතුමකට තුඩු දී ටෙස්ට් පා the යේ දෙවන තේරීම් දඟ පන්දු යවන්නා බවට පත්විය.අපූරු පන්දු යවන්නෙකු සහ හැස්ඩි ඇණවුම් පිතිකරුවෙකු වුවද, සීමිත ඕවර පාර්ශවයේ ස්ථානයක් නිමා කිරීමට රන්දිව්ව නොහැකි වුවද, සමහර විට වෙනත් මන්දගාමී පන්දු යවන්නන් වඩාත් ඉහළ වටිනාකමක් ලබා ඇතකෙටි ආකෘති.ටෙස්ට් පැත්තේ ඔහුගේ ස්ථාවරය මිරින්දු කෞෂාල් විසින් මෙහෙයවන ලද දඟ පන්දු යවන්නන්ගේ දක්ෂ පිරිසකගේ කණ්ඩායමක්ගෙන් මෑතකදී පීඩනය එල්ල වී තිබේ.\nසාඩි තව්ෆෙයිව් සහ එස්පීක්රිකින්ෆෝ කාර්ය මණ්ඩලය",
    "Suranga Lakmal": "දකුණු-හස්ත වේග පන්දු යවන්නා වන සුරංග ලක්මාල් ප්රථම වරට ශ්රී ලංකා ක්රිකට් ක්රීඩාවේ වේගවත් පන්දු යැවීමේ පුහුණුකරුවන් විසින් මුලින්ම දුටුවේය.ඔවුන් තම ප්රගතිය රිච්මන්ඩ් විද්යාලයට සහ පසුව දේශීය ක්රිකට් ක්රීඩාවේ නියෝජනය කරන දෙමළ යූනියන් කණ්ඩායමට සමීපව නිරීක්ෂණය කළහ.ලක්මාල් ගැන වූ පුහුණුකරුවන්ගේ උසම වූයේ ඔහුගේ උස හා මුදුනකින් ලබා ගැනීමට සහ මුදු මොළොක් වයසේදී පැද්දීමයි.ස්වාභාවික හැකියාව තිබියදීත්, ලක්මාල්ට එක් විශාල iency නතාවයක් සිටියේ දිගු අක්ෂර වින්යාසය සහ ඔහු කළ අවස්ථාවලදී ඔහු තමන්ට ශක්තිය නොමැති වීම සහ ඔහු කළ අවස්ථාවන්හිදී නිතිපතා අසනීප විය.පෝෂණය නොමැතිකම කොළඹින් පිටත සිට සහ ලක්මාල් ඇකඩමියට ඇතුළත් කළ විගසම වඩාත් සුලභ පිපිරීමකි, පුහුණුකරුවන් ඔහුගේ ශක්තිය දියුණු කිරීම සඳහා කටයුතු කළහ.ශ්රී ලංකාව සමඟ හොඳ රංගනයන් ඔහු දුටුවේ ඔහු ජාතික එක්දින පැත්තට කැඩී යයි.ඔහු අනාගතය වෙනුවෙන් සලකුණු කළ ක්රීඩකයන් තිදෙනාගෙන් එක් අයෙකි 2008 දී ඔහු පැත්තක් පුහුණු කළ විට චන්දිකා හතුරුසිංහ මහතා විසිනි.සාඩි තව්ෆෙරිකෙක් 2010 ජනවාරි",
    "Thisara Perera": "අවුල්සහගත දකුණු සෝදය සහ වාමාංශික හිටර්ටර්, තිසර පෙරේටර් 2010 සිට ශ්රී ලංකාවේ කෙටි ආකෘති පාර්ශවයේ සිට ඇත. පන්දු යැවීම පෙරේරාගේ ප්රධාන කුසලතාව වන නමුත් බොහෝ විට පහළ මැද පිළිවෙලට යොදවා ඇතඉනිමකට කෝපාවිෂ් make ජු ලබා දීම.පෙරේරා විශේෂයෙන් දරුණු ලෙස දරුණු වන අතර, එය මධ්යම ඕවර හරහා ඇඹුල් හෙන්ටර් ලෙස භාවිතා කිරීමට හේතු වී ඇති නමුත් සමහර අවස්ථාවලදී ගුණාත්මක වේග වේග පන්දු යැවීම සඳහාද ඔහු දුර්වල වී ඇත.එක් විනයක ස්වරූපය සාමාන්යයෙන් අනෙක් විනයක ස්වරූපය ඇති කරන ක්රීඩකයා ඔහුය.2014 ජූලි මාසයේදී දකුණු අප්රිකාවට එරෙහිව සීමිත ඕවර මාලාවක් සඳහා අතහැර දමා ඇති නමුත් පාකිස්තානයට එරෙහි පහත දැක්වෙන එක්දින තරගාවලියේදී ඔහුගේ පන්දු යැවීම සහ ඔහුගේ ඉඩම පිළිවෙලට ගොරවන ලදී.ඔහු ලකුණු 169.56 ක ලකුණු 78 ක් රැස් කළ අතර සාමාන්ය කඩුලු 966 ක් ලෙස පරාජයක් කළේය.පෙරේරා පෙර පෙරේරා ඕස්ට්රේලියාවට පන්දුවට පහර දී පන්දුව ඕස්ට්රේලියාවට ද ලබා ඇති අතර බොහෝ විට ඉන්දියාවට එරෙහිව ඔහුගේ උපරිමයෙන් කටයුතු කර ඇති අතර, ඔහුගේ මෑත වසරවල ශ්රී ලංකාවේ විස්සයි 20 ජයග්රහණය 2014 දී සොයාගෙන ඇත. ඔහුගේ මෑත වසරවල නොගැලපීම නිසා නමුත්පෙරේරා දිගින් දිගටම පැත්තේ ස්ථානයක් අණ කරයි.ඔහු එක්දින තරගවල සහ විස්සයි විස්ස යන දෙකෙහිම හැට් උපක්රම තිබේ.පෙරේරා ශාන්ත ජෝශප් විද්යාලයට සම්බන්ධ වීමට ශිෂ්යත්වයක් භාර ගැනීමට පෙර වත්තල ශාන්ත අන්තෝනි හි පාසල් අධ්යාපනය ආරම්භ කළේය.ඔහු ඇන්ජලෝ මැතිව්ස් සමඟ එකතු වී දියුණු වූ පාසල් ක්රිකට් කක්ෂයේ බොහෝ කැපී පෙනෙන දරාගැනීම් රාශියක් බිහි කරන විට එය tive ලදායී පියවරක් බවට පත්විය.වසර 35 කට වැඩි කාලයක් පැවති සාන්තුවරයන්ගේ සටනේදී සාන්තුවරයන්ගේ සටනේදී ඔහුගේ පාසල (ශාන්ත පීටර්ස් විද්යාලයට එරෙහිව) සටනේදී තම පාසල බිඳ දැමීමට උදව් කිරීමේදී පෙරේරා ප්රධාන කාර්යභාරයක් ඉටු කළේය.ඔහු සිය මංගල ජාතික ඇමතිවරයා 2009 දී ශ්රී ලංකාවේ 2009 දී ශ්රී ලංකාවේ ඉන්දියානු සංචාරයේදී මැතිව්ස් සඳහා හදිසි ආදේශකයක් ලෙස ලබා ගත්තේය.ඔහු චෙන්නායි සුපර් කිංග්ස් විසින් ඩොලර් 50,000 කට මිලදී ගත් බැවින් එය ඉක්පිලිත ගිවිසුමකට තුඩු දුන්නේය.\nඇන්ඩ rew ෆිදෙල් ප්රනාන්දු",
    "Lahiru Thirimanne": "මිනීමරු ආවරණ ඩ්රයිව්ක් සහිත තරුණ දක්ෂතා සහිත තරුණ තිරිමානයක් වන ලහිරු තිරිමාන්න ශ්රී ලංකා ක්රිකට් ප්රභූව විසින් ඉතා ඉහළින් සලකන ලද ජාත්යන්තර භූ දර්ශනයට පැමිණි අතර අරවින්ද ද සිල්වා විශේෂයෙන් ඔහුගේ ශූරයන් අතර වඩාත් කැපී පෙනේ.කීර්තියෙන් ආරම්භකකාරකය, 2010 මුල් භාගයේ සහ ඉදිරි වසර දෙක තුළ ජාතික පැත්තේ ඇති ස්ථාන ජාතික පැත්තේ ඇති ස්ථාන සහ ඉදිරි වසර දෙක තුළ ඔහුගේ විරාමයක් ඇති කළ නමුත් 2012 දී ඔහු මැද පෙළට ගෙන යන තෙක් ඔහු එය කළ යුතු අනුකූලතාව සොයා ගන්නා තෙක් ඔහු අඉහළ මට්ටමේ නිතිපතා.මනින ලද පිතිකරුවෙකු, ඇතැම් විට සීමිත එකක් නම්, තිරිමාන්න එක්දින ක්රිකට් ක්රීඩාවේ ශ්රී ලංකාවේ මධ්යම පෙළේ ඩිසර්ස්, විශේෂයෙන් ඇන්ජලෝ මැතිව්ස් සමඟ අමතක නොවන හවුල්කාරිත්වය නිසා කරදරකාරීව වේ.කෙසේවෙතත්, ඔහුගේ බලකොටුව රාගමා සී.සී.ආරම්භක පිතිකරුවෙකු ලෙස ඔහුගේ පළමු ටෙස්ට් කිහිපය තුළ එම ආකෘතියම එම පෝරමය ප්රතිනිර්මාණය කළ නොහැකි නමුත්, ඔහුගේ හොඳම ඉනිම අංක අංකයෙන් ඉවත් කිරීමට නොහැකි විය.4, ඔහු 2013 දින 36 කට පැය 36 කට පෙර ගුවන් යානයක් පිටත් කර යද්දී සිඩ්නි නුවර පළමු දිනයේ දී 91 දී දීප්තිමත් විය.දින දහයකට පසු ඇඩිලේඩ් හි ශ්රී ලංකාව ජයග්රහණය කරා ගෙන යන එක්දින තරගයකදී ඔහු එක්දින තරගයකදී මංගල ජාත්යන්තර සියයක් ගැහුවාය.ඇන්ඩ rew ප්රනාන්දු",
    "Seekkuge Prasanna": "නිවැරදි ලෙග්ස්නිනර් සහ ප්රමාද වූ අභාවප්රාප්ත වූ පැත්තේ හිටික නෙක්ටිකර්, සෙකුක්ගේ ප්රසන්න සීමිත ඕවර්ලන්ත ජාත්යන්තරයේ ශ්රී ලංකා භ්රමණ විකල්ප කිහිපයකින් එකක් බවට පත්ව ඇත.වාතය හරහා, හොඳ ගොග්ලි සන්තකයේ, ප්රසන්න, තණතීරුව හැරෙනු ඇතැයි අපේක්ෂා කරන විට ප්රසන්න බොහෝ දුරට තෝරාගෙන ඇත.ඔහු දේශීය ක්රිකට් ක්රීඩාවට හිතකර වන අතර එහිදී ඔහු සහ අජන්තා මෙන්ඩිස් පංචගොඩේ භිෂ්-මිත්රශීලී ශ්රී ලංකා හමුදාවේ කණ්ඩායම් හරහා නිතිපතා ක්රියාත්මක වේ.බංග්ලාදේශ ප්රිමියර් ලීග් තරගාවලියේදී සහ ප්රධාන වශයෙන් විස්සයි විස්ස පිපිරීමේදී, ප්රධාන වශයෙන් විස්සයි 20 පිපිරීමේදී ප්රසන්න විදෙස් තරඟවල සහ ප්රාන්ත නෝර්තෙම්ප්ටෙන්ෂයර් සඳහා ප්රසන්න ප්රසන්න මහතා මෑතකදී ආරම්භ කර තිබේ.21 හැවිරිදි ප්රසන්න ශ්රී ලංකා යුද හමුදා කණ්ඩායමට සේවය කළ ප්රසන්න, ලංකා ක්රිකට් සමාජයට එරෙහිව සිය ගෘහස්ථ එක්දින තරගයේදී ඕවර 10 කදී ලකුණු 23 කට කඩුලු 3 ක් දරයි.ඉදිරි වසර පහ තුළ ඔහු ඉදිරි වසර පහ තුළ කැපී පෙනෙන ලැයිස්තුවක් සකස් කළ අතර, තරග 45 කදී කඩුලු 73 ක් දවා ගත් අතර, 2011 දී එංගලන්තය තුළ සංචාරය කළ කණ්ඩායමකගේ කණ්ඩායමක් ශ්රී ලංකාවේදී තෝරා ගන්නා ලදී.එංගලන්ත ලයන්ස් වලට එරෙහිව, ශ්රී ලංකා තේරීම් කමිටුව වහාම සටහන් කර ගත්හ - ඔහු ඕස්ට්රේලියානු ජාතිකයන්ට එරෙහිව අවසන් එක්දින තරග දෙක සඳහා නැවත නිවසට පියාසර කිරීම.ඔහු සිය ජාත්යන්තර මංගල්යයේදී 32 කට ලකුණු 3 ක් ලබා ගත්තේය.\n\nEspncricinfo කාර්ය මණ්ඩලය",
    "Shaminda Eranga": "බ්රිස්ක් වේගවත් මධ්යම පන්දු යවන්නෙක්, ෂමින්ද එරංගගේ එක්දින තරග දෙකටම දර්ශනීය ය: 2011 දී ඕස්ට්රේලියාවට එරෙහිව ඔහුට අවශ්ය වූයේ ගේට්ටුව හරහා පන්දු යැවීම බ්රැඩ් හඩ්ඩින් ය.රිකී පොන්ටිං තම මන්දගාමී බෝල කියවීමට අසමත් වූ විට ඊටත් වඩා අමතක නොවන සේවයක් අනුගමනය කළ අතර, නැවත පැමිණීම ආපසු ඇල්ලීම.පසුව ඔහු එම විපක්ෂයට එරෙහිව ඔහුගේ ටෙස්ට් තරගය ආරම්භ කළ අතර ඔහු ෂේන් වොට්සන් බැහැර කරන විට ඔහුගේ පළමු දරු ප්රසූතියට එරෙහිව වැඩ වර්ජනය කළ දෙවන ශ්රී ලාංකික පන්දු යවන්නා බවට පත්විය.ඔහු ජාත්යන්තර ක්රිකට් පිටියට පැමිණි විගසම ස්නායු ආශ්රිත තුවාල හේතුවෙන් අඩු වූ නමුත් මාස නවයකදී මාස නවයකදී විස්සයි විස්ස තරගාවලියේදී කඩුලු ලබා ගැනීම සඳහා පෙර නොවූ විරූ ලෙස පෙරළියක් සම්පූර්ණ කිරීම සඳහා ය.ඔහු ටෙස්ට් ප්රහාරයේ එතැන් සිට තමා සියදිවි නසාගෙන ඇති අතර, ඔහුගේ අද්දැකීම් නොවී තිබියදීත්, චානක වෙලේගේදර තුවාලයෙන් නොපැමිණි විට, බොහෝ විට පේහාර හිමියන්ට පෙරමුණ ගැනීමට කැඳවනු ලැබේ.හිටපු ශ්රී ලංකා මධ්යම පැසෙකා චම්පාක රාමනායක සහ අනුෂා සමරනායක විසින් 2006 දී සමස්ත දිවයින වේග පන්දු යැවීමේ තරඟයකදී එරංග සොයා ගන්නා ලදී.ඔවුන්ගේ සොයාගැනීම ඔහුගේ චිලාව් මේරියන්ස්වරුන් සඳහා සහ අවසානයේදී එක් ප්රිමියර් ලීග් තරගාවලියට තෝරා ගැනීමට හේතු වූ අතර, එය ශ්රී ලංකා සංවර්ධන සංචිතයේ ස්ථානයකට යොමු විය.ඔහු 2010 දී ශ්රී ලංකාව සඳහා මංගල සංවිධානය විසින් ආරම්භ කරන ලද අතර, 2011 දී එංගලන්තයේ සංචාරයක නිරත වූ හොඳ ප්රසංග අනුගමනය කරමින්, ජාතික පැත්තේ කොටසක් ලෙස නැවත ශ්රී ලංකාවට පැමිණියේය.\nEspncricinfo කාර්ය මණ්ඩලය",
    "Nuwan Pradeep": "වේගවත් පන්දු යවන්නා වන නුවන් ප්රදීප් ක්රිකට් බෝලයක් සමඟ ක්රිකට් බෝලයක් සමඟ සෙල්ලම් කළ නමුත් වසර තුනකටත් අඩු කාලයකදී ඔහු ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ සිටියේය.ඔහු 2007 දී වේග පූර්වක තරඟයක් ජයගත් අතර, මෘදු බෝල ඉසව්වක දක්ෂ බාලදක්ෂයින්ගේ සිත් ඇදගන්නා අතර කෙලින්ම ශ්රී ලංකා ක්රිකට් ඇකඩමියට යවන ලදී.සාම්ප්රදායික නොවන ක්රියාමාර්ගයන් සමඟ ඔහු මේජික් පන්දු යවන්නන්ගේ ශ්රී ලංකා සම්ප්රදායේ ශ්රී ලංකා සම්ප්රදාය අනුගමනය කරයි.ලසිත් මාලිංග වගේම, ඔහුට ස්ලිං ක්රිකට් ක්රීඩාවක් කර ඇති අතර දේශීය ක්රිකට් ක්රීඩාවේ පිතිකරුවන්ට ඔහුගේ වේගයෙන් ජනනය කරමින් දිගු කලක් ජනනය වෙමින් පවතී.2010 දී ප්රදීප් 2010 දී ඕස්ට්රේලියාවට ගෙන ගිය අතර එහිදී ඔහු දෙපැත්තෙන්ම කඩුලු රාශියක් නොතිබුණි.මසකට අඩු කාලයකට පසු, ඉන්දියාවට එරෙහි දෙවන ටෙස්ට් තරගය සඳහා ජාතික සංචිතයට ඇමතුමක් ලැබුණි. මොරිකිෆෝ කාර්ය මණ්ඩල 2010 ජූලි",
    "Kaushal Silva": "එකතු කරන ලද දකුණු පසක ස්ථිර තාක්ෂණයක් සහිත එක්ස්ට්රීම් සිල්වා, කෞෂාල් සිල්වා සිය නිෂ්පාදනයේ පරිමාව තවදුරටත් නොසලකා හරින තෙක් පළමු පන්තියේ ක්රිකට් සියගෝලනයකට පසුව සියගුණුවක පසුව සියගුණුවල ශූරතාවක් සිය සියගෝලසියයෙන් සියගණනක් ජාතික තේරීම් කමිටුව විසින් නොසලකා හැරිය නොහැකි වේ.ඔහුගේ කිට්ටු විමසුම බොහෝ දුරට සිදු වූයේ ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ කඩුලු රකිරුවන්ගේ අභ්යාසයි නිසාය.ඔහු තම පිතිකරණයේ තනිවම සනාථ කළ ස්ථානයක් සඳහා ප්රමාණවත් ලෙස දිවා ආහාරය ලබා දී ඇති නමුත් අනාගතය සඳහා තරුණ පිතිකරුවන්ගේ මනාලයාගේ සූත්රය අත්පොතක් තබා ඇත.සිල්වාගේ දරුණු පළමු පංතියේ ආහාර රුචිය අවසානයේදී විපාක ලැබුණේ තිලකරත්න දිල්ෂාන් විශ්රාම යාම පරීක්ෂණය XI ට විවෘත ස්ථානයක් ලබා දුන් අවස්ථාවේදීය.සිල්වා පළමු පන්තියේ ටොන් 27 ක් වන විට, එම පැත්තේ දීර් and කාලයක් තිස්සේ දීර් down කාලයක් ලබා දී ඇති විට, ඔහු බොහෝ විට දේශීය ක්රිකට් ක්රීඩාවේදී පිතිකරු කළ තත්වයක සිටී.ඔහුගේ උදුන හා අධිෂ් mination ානය 2014 ජනවාරි මාසයේදී එක්සත් අරාබි එමීර් රාජ්යයේ උඩඟු සංචාරයේදී පැහැදිලිව පෙනෙන්නට තිබුණි. එහිදී ඔහු පාකිස්තානයට එරෙහිව වැදගත් ලකුණු දෙකක් සහ 95 ක් රැස් කළේය.ඔහු කණ්ඩායමට ගෙනා ශක්තිය හා උද්යෝගය සමානව දිරිගන්වන සුළුය - සමහර විට ඔහු තේරීම් කරුවන්ගේ දොරට තට්ටු කරන දිගු දුරක් ඔහුව නඩත්තු කළේය.එක්සත් අරාබි එමීර් රාජ්යයේ මහ නගරර ශ්රේණියේ ටෝන් හි මංගල ටෙස්ට් ටොන් එකක් කෙටි කලකට පසු කෙටි ඇණවුමට ස්ථාවරත්වය නිරන්තරයෙන් ගෙන ඒමට හැකි වූ මතයට බලයක් එක් කළේය.සිල්වා බොහෝ දුරට 2011 දී කඩුලු රකිපෙළක් ලෙස ටෙස්ට් තරග තුනක් ක්රීඩා කර ඇති නමුත් එම අවස්ථා ප්රයෝජනයට ගැනීමට නොහැකි විය.ඔහුගේ ක්රිකට් පුහුණුකරු පියතුමා සිය ක්රිකට් ක්රීඩාවට ප්රධාන බලපෑමක් කර ඇති බව කියැවෙන්නේ - ඔහු මතුවීම ඉදිරියේ ඔහු මතුවීමට පෙර සිල්වාගේ ශූරයන් අතර සිටි කුමාර් සංගක්කාර සමඟ බෙදා ගන්නා දෙයක්.2016 අපේ්රල් මාසයේ දී, ශ්රී ලංකාවේ කන්නයේ පෙරමුණට යන පුරුදු ක්රීඩාවක කෙටි පාදයක කෙටියෙන් පිරී ඇති අතර ඔහු හිසට වැදුණු විට ඔහුට මෘදු නිග්රහයක් ඇති විය.දින කිහිපයකට පසු, දින කිහිපයකට පසු පූර්වාරක්ෂක පියවරක් ලෙස ඔහුව කොළඹ රෝහලකට ගුවන් ගත කරන ලදී.\nඇන්ඩ rew ෆිදෙල් ප්රනාන්දු",
    "Kosala Kulasekara": "කොසාලා කුලසේකර 6 '1 1 \"පිතිකරණ තුන් ඉරියව් ක්රීඩකවරයා වන අතර අන්තර් පළාත් තරගාවලියේදී අග්රාමාත්ය තරඟාවලිය සහ රුහුනා සඳහා නිත්ය රංගන ශිල්පියෙකි. ක්රීඩාවට ඔහුගේ ප්රවේශය එක සඳහා වඩාත් සුදුසු වේදිවා කාලයේ සිටි දිවා සහ විස්සයි 20 ආකෘතිය. 2010 දී ඔහු අන්තර් පළාත් විස්ස තරගයේදී බස්නහිරා උතුරට පන්දු 15 කදී ලකුණු 43 ක් රැස් කළ අතර ඔහුගේ නිප්පි පන්දු යැවීමෙන් ලකුණු 26 ක් රැස් කළ අතර ඔහුගේ නිප්පි පන්දු යැවීමෙන් කඩුලු 4 ක් ද ප්රහාරයක් ලබා දුන්නේයජයග්රාහී එකක්.කුලසේකර පළමු වරට පිහිනුම් ක්රීඩකයෙකු ලෙස ආරම්භ වූ අතර දිවරහන් පිහිනුම් ශූරතා හා ක්රිකට් ක්රීඩාවේ තෙවැනි ස්ථානය දිනා ගත්තේ ඔහුගේ දෙවන ආදරය පමණි.මහනුවර විද්යර්තා විද්යාලයේ දී ඔහු සිය ක්රිකට් ක්රීඩාවේදී ඔහුගේ ක්රිකට් ඉගෙන ගත් අතර 17 න් පහළ U-19 න් පහළ මධ්යම පළාතේ නායකයා ලෙස තමා තෝරා ගන්නා ලද පොරොන්දුවක් පෙන්නුම් කළේය.අවසානයේදී 2004 දී යූ -17 ලෝක කුසලානයේදී ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කිරීම සඳහා ඔහු තෝරා ගනු ලැබූ අතර එහිදී ඔහු සියළුම මුළු වටයේම හැකියාව සඳහා මීටර් 40 ක ලෝක කුසලාන තරගාවලියේ සම්මාන දෙකක් දිනා ගත්තේය.එන්.සී.පී.කුලසේකර 2005 දී එංගලන්තයට ක්රිකට් ශිෂ්යත්වයක් දිනා ගත්තේය.ඔහු එංගලන්ත ඇකඩමියට සහ දකුණු අප්රිකාවේ 'ඒ' කණ්ඩායම්වලට එරෙහිව ශ්රී ලංකා ක්රිකට් ඇකඩමියෙහි නායකත්වය දැරීය.",
    "Dinesh Chandimal": "ශ්රී ලංකා ක්රිකට් පිටියේදී සිදුවන තරුණ පිතිකරුවන්ට වඩාත්ම පොරොන්දු වූ තරුණ පිතිකරු අතර දිනේෂ් චන්දිමාල් ද සිටී.කඩුල්ල වටේට ආ ro ාත සහිත තාක්ෂණික වශයෙන් ආ ro ාත සහිත තාක්ෂණික වශයෙන් ස්ට්රෝක්ස් සහිත චන්දිමාල් ද, එනම් ඉනිමක් ගොඩ නැගීමට හා වේගවත් කිරීම සඳහා වූ පරිණත භාවය නිසා ය.සිම්බාබ්වේ හි 2010 නාවික මාලාවේදී ඉන්දියාවට එරෙහිව සිය දෙවන එක්දින තරගයේදී ඔහුගේ ජාත්යන්තර තරගාවලියේදී ලකුණු 111 ක් රැස් කළේය.ඉනිම හතරකට පසුව ඔහු තවත් ශතවර්ෂයක් එංගලන්තයට එරෙහි තවත් ශතකයක් ලබාගත්තේ ය.ඔහු පුරුදු වී නොසිටින තත්වයන් තුළදී චන්දිමාල් තීරණ අංක 4 තව් තව් හිමි කරගත්තේය.එම ශ්රේණියේ එක් තරග දෙකේ එක්දින තරගයේදී ඉනිම 16 කදී ඔහු පනස් ගණන්වල ලකුණු 630 ක් රැස් කළේය.ඔහුගේ ටෙස්ට් තරගය ද ශ්රී ලංකාව ලෙස සියළුම ඉනිමේදී දකුණු අප්රිකාවේ සිය පළමු ටෙස්ට් තරගය ජය ගැනීමටත් ඔහුගේ ටෙස්ට් තරගයේ ඔහු ද ඒ හා සමානව ආකර්ෂණීය විය.ඔහුගේ සීමිත ඕවර ස්වරූපයෙන්, විශේෂයෙන් නිවසේදී, ආකෘති තුනම ශ්රී ලංකා සංචිතයේ රැඳී සිටියද, චන්දිමාල් 2012 අග භාගයේ රැඳී සිටියද චන්දිමාල් මහතා පැත්තෙන් අතහැර දැමීය.ඔහු අලුත් අවුරුදු පරීක්ෂණය සඳහා SCG හි ටෙස්ට් පැත්තට පැමිණ නොදැවී ලකුණු 67 ක් රැස් කළ අතර, වලිගය අසල පන්දුවට පහර දෙන්න.සති හයකට පසු ඔහු ශ්රී ලංකාවේ බාලයා වූ කපිතාන්වරය 23 වන අතර ඔහු ශ්රී ලංකාවේ ඉහළ පෙළේ විස්සයි 20 තරගාවලියේදී ලබා දුන් අතර, ටෙස්ට් සහ එක්දින තරගවලදී ඇන්ජලෝ මැතිව්ස් හි නියෝජ්ය.ඔහු සිය උන්නතාංශය සමග බංග්ලාදේශයට එරෙහිව සිය ගණනක් බංග්ලාදේශයට එරෙහිව සිය ගණනක් සමරනු ලැබීය.වයස් මට්ටමේ ක්රිකට් ක්රීඩාවේදී පන්දු හා අත්වැසුම් සමඟ චන්දිමාල් ජාතික කණ්ඩායමට පැමිණීම පැමිණියේය.ඊට වයස අවුරුදු 19 න් පහළ 19 ක් වන ඉන්දියාවට එරෙහිව ප්රහාරක ශතකයක් සහ එංගලන්ත U-191 ට එරෙහි ත්රිත්ව තරගාවලියේ නොදැවී 112 ක් ඊට ඇතුළත් වූ අතර ඊළඟ වසරේදී මැලේසියාවේ U-19 ලෝක කුසලානය සඳහා වන සංචිතය2008.කොළඹ ආනන්ද විද්යාලය සඳහා ප්රමෝදයක් සම්පූර්ණ කිරීමෙන් ටික කලකට පසු චන්දිමාල් කුමාර් සංගක්කාර විසින් අනතුරට පත්වූ ක්රිකට් සමාජ ශාලාවට එක්වන ලෙස ආරාධනා කරන ලදී.ක්රිස් මාටින්, ඩැරල් ක්ෆි, ඉයන් ඕබ්රිං, යාකොබ් ඔබ්රිරන්, යාකොබ් ඕරාම් සහඩැනියෙල් වෙටෝරි.2010 දී ශ්රී ලංකාවේ ඉන්ටර්ප්රොයිවර්සිවර් තරගාවලියේ ප්රමුඛ පෙළේ ධාවන බලකාය අතරට ඔහු සහභාගී වූ අතර, වැඩි කල් යන්නට මත්තෙන්, ඉන් අනතුරුව ජාත්යන්තර අවස්ථා අනුගමනය කළ අතර චන්දිමාල් ඔවුන්ගෙන් උපරිම ප්රයෝජන ලබා ඇත.\nසාඩි තව්ෆෙයිව් සහ එස්පීඑන්කිරින්ෆෝ කාර්ය මණ්ඩලය",
    "Dimuth Karunaratne": "දිමුත් කරුණරත්න යනු stand න වමේ වම් පිතිකරු වන අතර ශාන්ත ජෝශප් විද්යාලයේ තවත් ආදි ශිෂ්යයෙකි. 19 න් පහළ පැත්තෙන් 19 කිකරුණාරත්න 2008 දී සිංහල ක්රීඩා සමාජය (එස්එස්සී) සඳහා සිය පළමු පන්තියේ ආරම්භ වූ නමුත් නිහ quiet පළමු කන්නයේ, පිතිකරණයේ මැද පිළිවෙළට පන්දුවට පහරදු විය.ඔහු 2009 දී ඉහළ පෙළේ ස්ථානයක් ලබා ගත් අතර ඉන් පසුව වඩාත් නිරන්තරයෙන් ලකුණු ලබා ගැනීමට පටන් ගත්තේය.ඔහුගේ මංගල පළමු පන්තියේ පළමු පන්තියේ, කෝල්ට්ස් ක්රිකට් සමාජයට එරෙහිව, කන්නයේදී ලකුණු 1186 ක ජලගැල්මක් සතයක් ලබා ගත් අතර එය සාමාන්යයෙන් 56.54 කි.ඔහුගේ විශිෂ්ට පෝරමය ඔහුගේ ශ්රී ලංකා ශ්රී ලංකාවේ දකුණු අප්රිකාවට පැමිණීමට එරෙහිව ශ්රී ලංකා කණ්ඩායමක් සඳහා ඇමතුමක් ලබා ගත් අතර, ඔහු යළිත් පුදුමයට පත් වූ අතර, වර්නන් ෆිලන්ඩර් ඇතුළත් ප්රහාරයකට එරෙහිව 184 ක් උපයා ගත්තේය.කරුණාරත්න දෙවන කන්නයේ සිටම ලකුණු රැස් කර නැත, නමුත් හොඳ ප්රහාරවලට එරෙහිව විශාල සියවස් ගණනක් සෑදීම සඳහා කීර්තියක් ඇති කර තිබේ.ඔහු 2011 දී ශ්රී ලංකාව සඳහා එක්දින තරග දෙකක් ක්රීඩා කළ අතර, 4 සහ 60 ක් උපයා ගත් අතර ඔහු ක්රීඩාවක් නොලැබූ නමුත් වර්ෂයේ පසුව දකුණු අප්රිකාවට ටෙස්ට් චාරිකාවට ඇතුළත් විය.ඔහු නැවතත් 2012 ජූලි මාසයේදී නැවතත් 2012 ජූලි මාසයේදී, කණ්ඩායමක් සමඟ, එම සංචාරයේදී නොදැවී ලකුණු 83 ක් සහ 150 ක් සහ 150 ක් පිළිබඳ ලකුණු ගැන පුදුමයට පත් විය.වැඩි කල් යන්නට මත්තෙන්, ගැලී.ඒ.න්ඩබ්ලිව්.ඒ.න්ඩබ්ලිව්.",
    "Kithuruwan Vithanage": "කේන්ද්රීය මැද පෙළ පිතිකරු, කිතුරුවන් විතානගේ මහතා ටෙස්ට් බංග්ලාදේශයට එරෙහිව තරගාවලියට එරෙහිව සිය පරීක්ෂණයෙන් බැස්සේය.ඔහුගේ පළමු ටෙස්ට් තරගයේ වැඩි කාලයක් ගාල්ලේ පැතලි තට්ටුවක ලණු මැන බැලීමට වඩා විතානගේ මඳක් වැඩ කළ නමුත් පන්දු 7 දෙනෙකු සහ හය දෙනෙකුගෙන් යුත් පන්දු 70 කදී සජීවී 59 ක්ඔහු ආයෝජනය කිරීමට වටින තරුණ දක්ෂතා ලෙස සලකුණු කළේය.2010 ලෝක කුසලානය සඳහා වන වයස් මට්ටමේ ක්රිකට් විතානයේ රාජකීය විද්යාලයේ ආදි ශිෂ්යයෙකි.2009 දී ඔහු ඕස්ට්රේලියාවේ වයස අවුරුදු 19 න් පහළ සංචාරයකදීම තුන්වන ඉහළම ලකුණු ලාභියා විය.ඔහු දැනට දෙමළ සංගමය සඳහා රඟපායි. ඩෑන්ඩ් ෆිදෙල් ප්රනාන්දු වෙනුවෙන්",
    "Sachithra Senanayake": "සචිත්රා සේනානායක මහතා 2011-12 දී දකුණු අප්රිකාවේ සිව්වන එක්දින තරගාවලියේදී ශ්රී ලංකාව සඳහා ජාත්යන්තර තරගය බවට පත් කළ ඕෆ්ස්ටයිහිනියෙකි.ඔහුගේ ජාත්යන්තර මංගල්යය කරන විට, සේනානායක මහතා මේ වන විටත් තරග 59 ක කඩුලු 57 ක් දවා ගනිමින් 20.50 ක අපූරු සාමාන්යයෙන් පළමු පන්තියේ කඩුලු 297 ක් ලබාගෙන ඇති අතර ආර්ථිකය 3.90 ක වේගයකින් ලකුණු 107 ක් ලබා ගෙන තිබේ.2010-11 කන්නයේ දී ඔහු ප්රිමියර් ලීග් තරගාවලියේදී කඩුලු 45 ක් ලබා ගනිමින් සිව්වන ඉහළම කඩුලු 6 ක් වූ අතර එය තරග අටක කඩුලු 45 ක් ලබා ගත්තේය.සීමිත ඕවර තරගවල පීඩනය හැසිරවිය හැකි බව ද ඔහු පෙන්වා දී තිබේ: 2011-12 අග්රාමාත්ය සීමිත ඕවර තරගාවලියේදී ශ්රී ලංකාවේ ප්රධාන එක්දින තරගාවලියේදී ඔහු 11.18 ට 16.18 ට 16 ක වැඩිම කඩුලු 16 ක් විය.ජාත්යන්තර ක්රිකට් ක්රීඩාවට සේනානායකගේ පළමු කරුණ නම් සහ අධ්යාපනය ලැබුවේ මධ්යස්ථ කාර්ය සාධනය කිහිපයකට පසුවය. ඔහු නැවත ගෘහස්ථ නැවතුම්පොළට මුදා හරින ලදි.ඔහු 2013 දී කොල්කටා නයිට් රයිඩර්ස් අයිපීඑල් ෆ්රැන්චයිස් විසින් ඩොලර් 650,000 කට මිල දී ගත් විට නැවත ජාත්යන්තර අවධානයට යොමු විය.පළමුවන පන්තියේ තරඟයේදී ද එය ප්රබල ලෙස පෙන්වූ බැවින් දෙසැම්බර් මාසයේදී පාකිස්තානයට එරෙහිව ශ්රී ලංකාව සඳහා ශ්රී ලංකාව සඳහා ටෙස්ට් තරගයක් ද ඇති අතර එක්දින කණ්ඩායමේ දීප්තිය දිනා ගත්තේය.ඔහු 2014 ජුනි මාසයේදී එංගලන්තයට එරෙහි එක්දින තරගාවලියේදී වාසනාවන්ත වී ඇත.මතභේදය ශ්රී ලංකාව වෙනුවෙන් නොසන්සුන් මාලාවකටම කේන්ද්රස්ථානය නොවී ඔහු ශ්රී ලංකාව වෙනුවෙන් නොසන්සුන් මාලාවක ජයග්රහණය නතර නොකළ අතර ඔහුගේ ක්රියාව යටතේ ජොස් බට්ලර්ට එරෙහි මෑන්කොඩි සිද්ධියකට ද ඔහු සම්බන්ධ විය - ඔහුගේ ක්රියාව සොයාගත් විට ඔහු විශාල පහරක් එල්ල වියජූලි මාසයේ නීති විරෝධී ය.සේනානායක සිය ක්රියාමාර්ගය ප්රතිසංස්කරණය කර 2014 දෙසැම්බර් මාසයේදී ජාත්යන්තර ක්රිකට් ක්රීඩාවට පැමිණියේය.Espncricinfo කාර්ය මණ්ඩලය",
    "Dilruwan Perera": "පහසු, චතුර ක්රියාවක් සහිත සම්භාව්ය දිරාපත්කරුවෙකු 2014 දී ටෙස්ට් සංචිතයේ දෙවන දඟ පන්දු යවන ක්රීඩක නැංගුරම් දැරීමට පෙර දිල්රුවන් පෙරේරා ශ්රී ලංකාවේ ස්ථාවර පළමු පන්තියේ ප්රසංගකරුවන් අතර විය. ඔහු සිය පළමු හැඟීම ඇති කළේ වවුලන් සමඟ යටෙස්ට් තරගවලදී: පෙරේරා අජා හිදී පාකිස්තානයට එරෙහිව, පකිස්ථානයට එරෙහිව ලකුණු පහක් ලබා ගත් නමුත් ඔහු ඉක්මනින් පන්දු යවන්නා ලෙස තමාම තහවුරු කළේය.ඔහුගේ දෙවන ඉනිමේ කඩුලු 5 ක දුරක් සති දෙකකට අඩු කාලයකට පසුව ඩකාහි බංග්ලාදේශය පිස දැමීමට උදව් කළේය.පන්දුවෙහි විශාල ටර්නර් එකක් හෝ විචලනයක් ලෙස හසු පන්දුවක් පමණක් තිබෙන්නේ නැත, පෙරේරාගේ ශක්තීන් නිරවද්යතාවයෙන් හා නොපසුබට උත්සාහයකින් බැඳී සිටී.පෙරේරා හි පිළිමයක් වන මුත්තයියා මුචිතරන්හාන්ගේ උපදෙස් පරිදි, සාක්මියාගේ පිළිමයක් වන මුත්තයියා මුතුරතුරගේ උපදෙස් මත ස්ථාන පන්දු යැවීම තීව්ර ලෙස කටයුතු කිරීමෙන් ඔහු එම කුසලතා බලාපොරොත්තු තබා තිබේ.ටෙස්ට් පැත්තේ ඔහුගේ කාලය තුළ පෙරේරා විපක්ෂයෙන් කඩුලු මිරිකීමේ එතකිරීමට සුදුසු යැයි ඔප්පු කර ඇති අතර, රංගන හේරත් යන දෙදෙනා ප්රතිවිරුද්ධ කෙළවරේ සිට පන්දු යැවීමකි.පනාදුර ශ්රී සුමංගල විද්යාලයේ සිය වෘත්තීය ජීවිතය ආරම්භ කිරීමෙන් පසු පෙරේරා වේගවත් ප්රගතියක් ලබා ඇත.19 න් පහළ කණ්ඩායම වයස අවුරුදු 19 න් පහළ කණ්ඩායම සමඟ ඕස්ට්රේලියාව සංචාරය කළ අතර, ඔහු පනාදුර ක්රීඩා සමාජය සඳහා සිය පළමු පන්තියේ ආරම්භය සිදු කිරීමෙන් පසුව 2001 දී එක් කන්නයක් සඳහා එක්විය.2004 දී තරග හතකින් කඩුලු 55 ක් සහිත වයස අවුරුදු 23 කි.එංගලන්තයට හා සිම්බාබ්වේ යන දෙදෙනාම පිතිකරු සහ බෝල යන දෙකෙහිම කණ්ඩායම් සංචාරයක යෙදී සිටි නමුත් ඔහුගේ කාලය පුරාම ශ්රී ලංකාවේ භ්රමණයන් පන්දු යැවීමේ ඇකඩමියේදී ඔහු සමඟ සාර්ථකව කටයුතු කර තිබේ.සීමිත ඕවර් ක්රිකට් ක්රීඩාවේ පෙරේරා, පෙරේරා විසින් අයිසීසී ලෝක විස්සයි 20 තරගාවලිය සඳහා ශ්රී ලංකා සංචිතයට පැමිණියේ දකුණු අප්රිකාවේදීය.ඔහු 2007 දී එංගලන්තයට එරෙහිව එංගලන්තයට එරෙහිව සිය කාර්යබහුල ලෙස ආරම්භ කළේය. ඔහු කොළඹ කෝල්ට්ස් ගෘහස්ථ පා ත්වයේ අනිවාර්ය අංගයක් වන අතර ඔහු දැන් අවුරුදු 10 ක් නියෝජනය කරයි.",
    "Niroshan Dickwella": "ප්රහාරක වම් අත සහ සාම්ප්රදායික කඩුලු රකිනෙඳු-පිතිකරු, නිරෝෂන් ඩික්වෙල්ලා වන නිරෝෂන් ඩික්වෙලා සිය තාරකා පාසල් ක්රිකට් දිවිය තුළට මේ වන විටත් උපකල්පනය කරමින් පළමු පන්තියේ ක්රිකට් ක්රීඩාවට පැමිණියහ.පෙර කන්නයේ දී ලකුණු 1000 කට වඩා සිරවී සිටි සහ ත්රිත්ව විද්යාලය ජාතික ශූරතාවයට ගෙන ගිය අතර ත්රිත්ව විද්යාලය ජාතික ශූරතාවයකට ඉදිරිපත් කර ශ්රී ලංකාවේ පාසල් සිසරණ කටයුතු සම්මානය දිනා ගත්තේය.එතැන් පටන් ඩික්වෙල්ලා ජාතික කණ්ඩායමේ සිට දේශීය ක්රිකට් ක්රීඩාවෙන් දේශීය ක්රිකට් ක්රීඩාවෙන් දේශීය ක්රිකට් ක්රීඩාවෙන් දේශීය ක්රිකට් ක්රීඩාවෙන් දිගු කලක් තිස්සේ ඩික්වෙල්ලා අගවිනිසුරුවරියන් බවට පත්ව ඇත.දේශීය ක්රිකට් ක්රීඩාවේ සියලු ආකෘති හරහා ඩික්වෙල්ලා විශේෂයෙන් සිත් ඇදගන්නා සුළු වූ අතර එය ශ්රී ලංකාවේ කණ්ඩායමේ දක්ෂතාවයකින් යුක්තය.ඔහු සිය ටෙස්ට් තරගය 2014 ජූලි තරම් take ත අතීතයක් ලෙස ආරම්භ කළේය - වයස අවුරුදු 21 - නමුත් දකුණු අප්රිකානු ප්රහාරයකට එරෙහිව එස්එස්සී හි දීප්තියක් ඇති කර නොතිබුණද, ඔහුගේම එස්එස්සී හි දීප්තියක් ඇති කර ගත්හ.ඔහු 2017 දී ජාත්යන්තර ක්රිකට් ක්රීඩාවට තවත් ෆෝරායක් කළේය.",
    "Tharindu Kaushal": "සැලකිය යුතු වාමාංශිකයෙකු වන උස දිරාපත්කරු වන තරින්දු කෞෂාල් 2013 මුල් භාගයේදී ශ්රී ලංකාවේ ගෘහස්ථ පරිපථයේ වඩාත්ම ආකර්ෂණීය තරුණ පන්දු යවන්නා විය හැකිය.ඔහුගේ ඇඟිලි මෙන්ම, පන්දුව මත සැලකිය යුතු වැඩක් කිරීමට - ඔහුගේ ඩොසරාට විශේෂයෙන් තෝරා ගැනීමට අපහසු යැයි කියනු ලැබේ.කෞෂාල්ගේ ගැලවීම පළමු පන්තියේ පළමු සමයේ ගාලේ දේවලේශ් දේවපතිරාජා විද්යාලයේ සිය ක්රිකට් ආරම්භ කර වසර 20 ක දරුවෙකුගේ සිහිනයකි.නොන්ඩ්රල්ක්රිප්ට්ස් ක්ලබ්ස් සඳහා තරඟ හතකින් ඔහු 15.20 ට වඩා කඩුලු 50 ක් නෙළා ගත් අතර එය කඩුලු 6 ක දුරක් එකතු කළේය.එම උත්සාහයන් සඳහා සහ කන්නයක් සඳහා කන්නයක් සඳහා, ගෘහස්ථ ස්ථානයට පැමිණ මාස 14 ක් ඇතුළත ටෙස්ට් බල කණ්ඩායම් දෙකක ඔහු තෝරා ගන්නා ලද නමුත් එක්කෝ මාලාවේ ක්රීඩාවක් නොලැබුණි.අග්රාමාත්ය ලීග් තරගාවලියේදී 23.55 ට කඩුලු 43 ක් ලබා ගත් විට 2014 දී බම්පර් හොල්ස් 2014 දී පැවැත්වූ අතර ශ්රී ලංකාවේ එක් පැත්තක සාර්ථක පසුබෑමක් සිදුවිය.නවසීලන්තයේ බොක්සිං දින ටෙස්ට් පරීක්ෂණය සඳහා රංගන හේරත්ගේ නොමැති බව දුෂ්ට කෞෂාල් එම සංචාරය සඳහා ශ්රී ලංකා සංචිතයේ නම් කරන ලදී.ඔහු එම තරඟයේ දී ඔහුගේ ටෙස්ට් තරගය ආරම්භ කළේය.ඔබ ෆිදෙල් ප්රනාන්දු",
    "Dushmantha Chameera": "උස, සිහින් සහ ලිස්සන සුළු, දුෂ්මන්ත චමීරා 2012 දී එන්.සී.සී. වෙත පැමිණි අතර, අනාගතය සඳහා ඉක්මනින් පන්දු යවන්නෙකු ලෙස සලකුණු කරන ලදී.ඔහුගේ ගුණධර්ම අතර පළමුව වේගයෙන් ජනනය වන අතර එය චලනය කරන තරමක් වටකුරුගේ ක්රියාවකින්.කිලෝමීටර 140 කට අධික පිරිසකගේ නිරතුරුවම පහර දෙන වේගයට පහර දෙන පුහුණුකරුවන්ගේ වයස 23 වන විට ඔහු රටේ වේගවත්ම පිවිදලිය බවට පත්ව ඇතැයි විශ්වාස කරයි.21.18 ට පළමු පන්තියේ ක්රිකට් 32 ක් කියා ගැනීම.චමීර 2014 අවසන් වන විට ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ නවසීලන්තයට නවසීලන්තය දක්වා ස්ථානයක් උපයා ගත් නමුත් සංචාර තරඟයේදී ශක්තිමත් විය.ඔහු එම සංචාරය සඳහාම එක්දින සංචිතයට ප්රමාද වූ අතර ඔහුගේ ජාත්යන්තර තරගය විය",
    "Kusal Perera": "කෙටි බහිස් ගිහින්, බලවත් නළල සහ නිර්දය ලේවැකි-සිත් ඇදගන්නාසුළු බව, වම් අත පිතිකරු කුසල් ජන්ත්ර පෙරේරාගේ පන්දුවට පහර දීම ඔහුගේ වීරයා සනත් ජයසූරියගේ තාක්ෂණයෙන් පමණක් නොවේ, සමහර අවස්ථාවලදී එය හරියටම අනුපිටපතක් ලෙස පෙනේ.ජයසූරිය මෙන් ඔහුට දෙවන දක්ෂතාවයක් ඇත - එය මන්දගාමී වම හා හස්තයට වඩා කදීප්තියක් වුවද, ඔහු කෝල්ට්ස් ක්රිකට් සමාජ ශාලාවට සම්බන්ධ වීමට පෙර, ඔහු ශ්රී ලංකාවේ වයස අවුරුදු 19 න් පසු ජ්යෙෂ් senior සේවකයෙකු ලෙස කටයුතු කළේය.කෝල්ට්ස් හි පෙරේරා ආක්රමණශීලීව හා විශ්වසනීයත්වය පිළිබඳ ආරම්භ කරන ලද වෘත්තියක් හා විශ්වසනීයත්වය යන වෘත්තිය මත පදනම් වූ අතර, කාලයකට පසුව, ශ්රී ලංකාවේ තේරීම්කරුවන්ට ඔහුව තවදුරටත් නොසලකා හැරිය නොහැකි විය.2012 ජනවාරි මාසයේදී ශ්රී ලංකාවේ සීමිත ඕවර සංචිතයේ ඕස්ට්රේලියාවට ශ්රී ලංකාවේ සීමිත ඕස්ට්රේලියාවට සිදුවන ස්ථානයක් උපයා ගන්නා බව කුමාර් සංගක්කාරට තුවාල සිදුවී ඇති අතර, විශේෂයෙන් ගබ්බා හි දී නොදැවී ලකුණු 22 ක කාලයක් ශ්රී ලංකා නිවසට පහත් ලෙස ගෙන ගියේය.එක්දින තරගය ලකුණු කිරීම.කීර්තියෙන් මැද නියෝග පිතිකරුවෙකු වුවද, ඔහු විස්සයි විස්ස දෙකෙහිදී ආරම්භක පිතිකරු වෙත උසස් කරන ලදී. එහිදී ඔහු දැඩි ඉනිමක දිගටම ක්රීඩා කළේයශ්රී ලංකාවට ආපසු පැමිණි පෙරේරා පළමු පන්තියේ ද්විත්ව ටොන් 275 ක් වූ අතර පසුව පන්දු 275 කදී ලකුණු 336 ක් රැස් කළ අතර තේරීම්කරුවන්ට සීමිත ඕවර පැතිවල දීර් run ලදායී ලෙස ඔප්පු කර ඇත.පෙරේරා සිය මංගල එක්දින ශතවර්ෂයේ දී 2014 දී මිර්පූර්හි දී බංග්ලාදේශය පුරා 3-0 සුදු හුනු ගෑමක් සම්පූර්ණ කිරීමට සහාය විය.පසුව ඔහු පන්දු 17 ක අඩ සියවසක් වන අතර, ශ්රී ලංකාවේ පාකිස්තානයට එරෙහිව 2015 ජූලි මාසයේදී පාකිස්තානයට එරෙහිව ජයසූරියගේ වාර්තාවට සමාන විය.මාසයකට පසු පෙරේරා සිය පරීක්ෂණය ඉන්දියාවට එරෙහිව ආරම්භ කරන ලදී.ඔහු නිවුන් පනස් ගණන් ගනිමින්, මංගල දර්ශනය සඳහා අර්ධ ශතක දෙකක් ලබා ගැනීම සඳහා දෙවන ශ්රී ලංකා පිතිකරුවා පමණක් බවට පත්විය.පෙරේරාගේ බර්ගන් වෘත්තිය 2015 දෙසැම්බර් මාසයේදී අන්තර්ජාතික ක්රිකට් ක්රීඩාවෙන් අයිසීසී ආයතනයෙන් ප්රතිපාදනපයක් ඇති වූ විට මාත්රණ පරීක්ෂණයෙන් අසමත් වීමෙන් පසුව.ඔහු ශ්රී ලංකාවේ නවසීලන්තයේ සංචාරයෙන් සිහිපත් කරන ලද අතර පසුව ඉන්දියාවේ, ආසියානු කුසලානය සහ ලෝක විස්සයි 20 හි ද්විපාර්ශ්වික විස්සයි 20 තරගාවලියක් මඟ හැරුණි.ඔහුගේ ආරම්භක නියැදිය රංගනය වැඩි කරන drug ෂධය සඳහා ධනාත්මකව පරීක්ෂා කළ විට ඔහුගේ දුක්ඛිත නියැදිය ධනාත්මක වූ විට අඳුරු විය.පෙරේරාට ශ්රී ලංකා ක්රිකට් ආයතනයෙන් ශ්රී ලංකා ක්රිකට් ආයතනයෙන් දැඩි සහයෝගයක් තිබුණද, වොඩා අනුමත විද්යාගාරයේ සොයාගැනීම් සමඟ සටන් කිරීමේදී ද ඔහුගේම මුදල් සැලකිය යුතු ප්රමාණයක් ද වැය කළේය.ඔහුගේ රාජකාරිය ඉවත් කළ යුතු උද් campaign ෝෂනය නිසා පොලෝග්රැෆි පරීක්ෂණයක්, හිසකෙස් විශ්ලේෂණයක් සහ වෙනම මුත්රා පරීක්ෂණයක් මෙන්ම එක්සත් රාජධානියේ පදනම් වූ ඔහුගේ ප්රධාන නීති Bard සමඟ සැලකිය යුතු සම්බන්ධීකරණයක් ඇතුළත් විය.මේ සියල්ල අවසානයේදී ගෙවා ඇත්තේ 2016 මැයි මාසයේදී ඔහුගේ නම නිෂ්කාශනය වූ විට, මාස 5 කට පසු ඔහුගේ නම නිෂ්කාශනය කරන විට - කටාර් පදනම් කරගත් විද්යාගාරය \"විද්යාත්මක හා තාක්ෂණික හේතූන්\" නිසා \"විද්යාත්මක හා තාක්ෂණික හේතූන් මත\" තිරගත නොවන \"ලෙස සලකනු ලැබීය.ICC.espncricinfo කාර්ය මණ්ඩලය",
    "Milinda Siriwardana": "කාර්යබහුල මධ්යම පෙළේ පිතිකරුවෙකු සහ දක්ෂිණාංශික පිතිකරුවෙකු සහ දක්ෂිණ-හස්තයෙන් දඟ පන්දු යවන්නෙකු වන මිලින්ද සිරිවර්ධන වසර කිහිපයකින් දේශීය ප්රතිලාභ ලබා දීමෙන් පසු 2015 දී ජාතික පැත්තට කඩා වැදුණි.2015 ප්රිමියර් ලීග් තරගාවලියේ කැපී පෙනෙන පෝරමය ඔහුගේ උන්නතාංශය හේතු විය.ඔහු ලකුණු 1144 ක් වූ අතර බඩුරේලියා ක්රිකට් සමාජයේ ලකුණු 1144 ක් ලබා ගනිමින් පළමු පන්තියේ කන්නයේ ඉහළම ලකුණු ඒකකය ද වූ අතර ඔහු බදුරේලියා ක්රිකට් සමාජයේ කඩුලු 20 ක් දවාගෙන තිබේ.පාකිස්තානයේ මධ්ය කාලීන සංචාරයේදී සිරිවර්ධන සිය එක්දින තරගාවලිය හා විස්සයි 20 තරගාවලියේ යෙදී සිටියදී ඔහුගේ පළමු ජාත්යන්තර තරග 25 කදී සිය පළමු ජාත්යන්තර පන්දු 25 කදී අංන්ග්ලෝ මැතිව්ස් සමඟ එක්දින ස්ථාවරයකදී ඔවුන්ගේ පළමු ජාත්යන්තර පනස්දෙනාට පහර දුන්නේය.එම ආකෘතියේ සාර්ථකව එක් ආකෘතියේ සාර්ථකත්වය බටහිර ඉන්දීය කොදෙව් පිලට එරෙහිව ඔහුගේ ටෙස්ට් තරගයට යන මාර්ගයට පිවිසියේය.ඔහු 2005 දී සෙබස්ලියන් ක්රිකට් හා මලල ක්රීඩා සමාජය සඳහා සිය පළමු පන්තියේ පළමු පන්තියේ ආරම්භයක් ගෙන ඇති අතර ඔහුගේ ජාත්යන්තර විවේකයක් ලබා ගැනීමට වසර කිහිපයකට පෙර ශ්රී ලංකාව වෙනුවෙන් ක්රීඩා කර තිබේ.සිරිවර්ධන ජාතික පිළිගැනීමට ආසන්නව 2009 ලෝක විස්තරය සඳහා 30 දෙනෙකුගෙන් යුත් 30 දෙනෙකුගෙන් යුත් තාවකාලික සංචිතයට ඇතුළත් වූ නමුත් ඔහු අවසන් කණ්ඩායමෙන් ඉවත් විය.ශ්රී ලංකා ක්රිකට් අන්තර් පළාත් තරගාවලියේදී ඔහු කඩුලු 5 ක් දවාගත් තරගයක් වන එස්එල්සී අන්තර් පළාත් තරගාවලියේදී රුහුනාට එරෙහිව ඔහුගේ මංගල පළමු පන්තියේ ටොන් 135 ක් වන අතර ඔහුගේ මංගල පළමු පන්තියේ ටොන් 135 ක් වන අතර එය කඩුලු 5 ක් දවා ගත්තේය.",
    "Kusal Mendis": "සංයුක්ත තාක්ෂණයක්, ආක්රමණශීලී ආවේගයක් සහ යකඩ අධිෂ් and ානයක් සහිත ආශීර්වාදයක්, කුසල් මෙන්ඩිස් වයස් කාණ්ඩ පද්ධතිය හරහා වේගයෙන් ඉහළ ගොස් ඇති අතර ඉක්මනින් ලෝකයේ වඩාත්ම පොරොන්දු වූ තරුණ මංකිස ජාතිකයෙකු බවට පත්විය.ඔහු ටෙස්ට් තරගාවලියක් ලැබීමට පෙර පළමු පන්තියේ ඉනිම 16 ක් පමණක් ක්රීඩා කර ඇති අතර ඔහු මංගල ටෙස්ට් ටොන් එකක් සෑදීමට පෙර පළමු පංතියේ එක් ශතකයක් පමණක් වැදී ඇත.එම සියය - ඕස්ට්රේලියාවට එරෙහිව 176 - ඕස්ට්රේලියාවට එරෙහිව 176 තරඟ පෙරළීම, ශ්රේණි වශයෙන් නිර්වචනය කරන ලද තට්ටු කිරීම, එමඟින් වෙනත් පිතිකරුවෙකු ක්රීඩාවේ 55 කට වැඩි පිරිසක් ශ්රී ලාංකික ඉනිමක් වූ අතර එය මෙතෙක් පැවති විශාලතම ඉනිමකි.එතැන් පටන් මෙන්ඩිස් ආකර්ෂණීය ඉනිමක් ද තබා ඇති අතර, ටෙස්ට් පළමු සිව් දෙනා තුළට කාවැදී ඇත.ශ්රී ලංකාවේ පාසල් ක්රිකට් ක්රමයේ ඉහළ වශයෙන් ශ්රේණිගත කළ උපාධිධාරියෙකු වන මෙන්ඩිස්ගේ පන්දුවට පහර දීම ජාතික තේරීම් කමිටුවන්ගේ රේඩාර් හි සිටීමට බොහෝ කලකට පෙර ඔහුට විශාල මුදලක් උපයා තිබුණි.කකිරීම සහ දකුණු පසක පිතිකරු ගලා බසින පරිදි මෙන්ඩිස් 2013 වසරේදී පාසල් සිසුර් ක්රිකට් ක්රීඩකයාට 2013 දී සම්මානය දිනා ගත්තේය.ඔහු ඊළඟ වසරේදී තරුණ ලෝක කුසලාන තරගාවලියේ 19 න් පහළ නායකයා විය.මෙන්ඩිස් 2015 ප්රිමියර් ලීග් තරගාවලියේදී බ්ලූම්ෆීල්ඩ් ක්රිකට් සමාජ ශාලාව සඳහා සිය පළමු පන්තියේ වෘත්තීය ජීවිතය ආරම්භ කළේය. ඔහු ලකුණු 459 ක් ලබා ගනිමින් 2006.60 පමණ වියයෞවනයන් සමඟ.හයිද්රාබාද්හි මෙයින්-යූඑන්-ඩව්ලාල තෙදින තරගාවලියේදී මෙන්ඩිස් 'විශිෂ්ට ප්රතිලාභ ජාතික කණ්ඩායමට නායකත්වය දුන්නේය.2015 ඔක්තෝම්බර් මාසයේදී බටහිර ඉන්දීය කොදෙව් පිලට ක්රීඩා කරන ලෙස ඔහු සංචිතයට නම් කරන ලද අතර එමගින් එම තරඟයේ දෙවන තරඟයේදී සිය මංගල දර්ශනය විය. එන්ඩෙල් ප්රනාන්දු",
    "Udara Jayasundera": "උදාරා ජයසුන්දර මහතා නවසීලන්තයේ පැවති 2010 න් පහළ ලෝක කුසලානය සඳහා තෝරාගත් වාමාංශික පිතිකරුවෙකි.ඔහු 2009 නොවැම්බරයේ ත්රිත්ව තරගාවලියේදී බංග්ලාදේශ U-191 ට එරෙහිව ලකුණු 82 ක් රැස් කළේය. ඔහුගේ පිළිමය බ්රයන් ලාරා ය.ඔහුට එය වෘත්තීය ක්රිකට් ක්රීඩකයෙකු ලෙස කළ නොහැකි නම් ව්යාපාරිකයෙකු වීමේ අභිලාෂයන් ද සිටී.ක්රික්ෆෝ කාර්ය මණ්ඩලය 2010 ජනවාරි",
    "Dasun Shanaka": "පුපුරන සුලු මැද පෙළ පිතිකරුවෙකු සහ ස්ථාවර දකුණු අත් පසුපස පන්දු යවන්නා වන දසුන් ෂානාකා ශ්රී ලංකාවේ විස්සයි 20 පාර්ශ්වය තුළ සිංහල ක්රීඩා සමාජයේ හොඳ රංගනයන් අතරින් ශ්රී ලංකාවේ විස්සයි 20 පාර්ශ්වය දක්වා වැඩ කළේය.නෙගම්බෝ හි උපත හා අධ්යාපනය ලැබූ ෂානක, 2015 අගෝස්තු මාසයේදී පාකිස්තානයට එරෙහිව සිය ජාත්යන්තර තරගය පාකිස්තානයට එරෙහිව ය.සරසන්ස් ක්රීඩා සමාජයට එරෙහිව AIA අග්රාමාත්ය විස්සයි 20 තරගයේ අංක 4 හි පිතිකරණය වන ෂානාකා පන්දු 46 කදී ලකුණු 123 ක් වටිනා ඉනිමකින් හයේ පහර 16 ක් වාර්තා කළේය.එය පසුගිය සතියේ ඔහුගේ විශාලතම විස්සයි විස්ස ලකුණු පවා නොවීය.ඔහු සතියකට ගාලු ක්රිකට් සමාජයට එරෙහිව පන්දු 48 කදී පන්දු 48 කදී ලකුණු 131 ක් රැස් කළේය.නමුත් ශානක මුලින්ම ජාත්යන්තර වේදිකාව මත සිය ලකුණ බවට පත් වූ පන්දුව සමඟ විය.ඔහු ඉන්දියාවට එරෙහිව පූනේ ග්රෙන්ටෙන්ප් එකකට ලකුණු 16 කට කඩුලු 3 කට දැවී ගියේය.ඔහු ශ්රී ලංකාවේ 2016 ලෝක විස්සයි විස්ස ව්යාපාරයේ දීප්තිමත් කැමනස් වාදනය කළ අතර අපේ්රල් මාසයේ දී ඔහු ශ්රී ලංකාවේ එංගලන්ත සංචාරය සඳහා - පළමු වරට ඔහුගේ පළමු පන්තියේ වාර්තාවට වඩා ඔහුගේ හැකියාවන් මත යප්රනාන්දු",
    "Dhananjaya de Silva": "දිවයිනේ දකුණු පසින් තාක්ෂණිකව නිවැරදි ඉහළ පෙළේ පිතිකරුවෙකු වන ධනන්ජය ද සිල්වා මහතා 2015 දී කෙටියෙන් ජාතික තේරීම් කමිටු ඇස කෙටියෙන් අල්ලා ගත් අතර පසුව, වඩාත් දැඩි ජාතික රාජකාරියක් සඳහා ඔහුව සලකුණු කළ කම්පල් සහිත ගෘහස්ථ සමයක් ලබා ගත්තේය.පාකිස්තානයට එරෙහි ශ්රී ලංකාවේ මධ්ය කාලීන විස්සයි විස්සයි 20 ගණන්වල දී ද සිල්වා තෝරාගෙන ඇති නමුත් ඔහු විස්සයි 20 පිතිකරුවෙකු වූ අතර එය පන්දු 47 කදී ඉනිම 27 කදී පරාජය කළේය.කෙසේවෙතත්, ඊළඟ දෙය නම්, දැඩි පිපීමකි.ද සිල්වා ප්රථම වරට සුපිරි විස්සයි 20 පළාත් සභා තරඟාවලියේදී ලකුණු 233 ක් රැස් කරමින් ඉනිම හයක වැඩ වර්ජන අනුපාතයකින් ලකුණු 234 ක් රැස් කළේය.මාස 55 කට පසු ඔහු වසර 55 ක් තුළ වසර 55 ක් තුළ දෙමළ සංගමයේ පළමු ජයග්රාහී පළමු පන්තියේ ව්යාපාරයේ තාරකාව වූ අතර එය ලකුණු 86.20 ක් වූ අතර එය ඔහුගේ කණ්ඩායම සිය කණ්ඩායමේ මාතෘකාව දිනා ගත් තරගයේදී තීරණාත්මක සිව්සිනයි.ඇදහිය නොහැකි තරම් ය.එම සංඛ්යා ශ්රී ලංකාවේ ටෙස්ට් සංචිතය සඳහා ඔහුගේ පළමු ඇමතුම ලබා ගැනීමට උපකාරී විය. එංගලන්ත සංචාරය සඳහා මැයි සහ 2016 ජුනි මාසයේදී. 2016 මැයි",
    "Lakshan Sandakan": "කොළඹ නගරයක් වන ලක්ෂන් සැන්ඩකන්ගේ බලකොටුවල මඳක්, වම් සඳකඩ පහරකි.මාරුවීමේ ප්රවේශයක් හා ඉක්මන් ක්රියාවක් ක්රියා විරහිත කිරීම, සඳකන්ට පන්දුව දෙයාකාරයම හැරවීමේ හැකියාව ඇත, එය පෑඩ් එකට යොමු කරන්න.කන්දනාහි ඩි මැසෙනෝඩ් විද්යාලයෙන් උපාධිය ලබා ගැනීම, සඳකන් 2012 දී සරසන් ක්රීඩා සමාජය සඳහා 2012 දී සිය පළමු පන්තියේ වෘත්තිය ආරම්භ කළේය.ඊළඟ සමය වන විට කොළඹ ක්රිකට් සමාජ ශාලාවට ගොස් කඩුලු thick න සහ නිරාහාරව සිටීමට පටන් ගත්තේය.ඔහු 2013-14 පළමු පන්තියේ කන්නයේ කඩුල්ලේ කඩුලු 6 ක් වූ ලැයිස්තුවේ ඉහළින්ම සිටින අතර, හිස්කබල් 54 ක් වූ අතර 19.14 සාමාන්යයෙන් 19.14 කි.එම උත්සාහයන් සඳහා සඳකන් ශ්රී ලංකාවේ එක්දින තරගාවලියේ ස්ථානයක් උපයා ගත්තේ ඔහු කිසි විටෙකත් ක්රීඩාවක් කිරීමට ක්රීඩා නොකළ නමුත් 2014 අග භාගයේදී එංගලන්තය ක්රීඩා කිරීම සඳහා ස්ථානයක් උපයා ගත් බවයි.ඊළඟ කන්නයේ දී සඳකන් නැවතත් සිත් ඇදගන්නාසුළු වූ අතර කඩුලු 45 ක් දවා ගත්හ.ඔහු 2015-16 ප්රිමියර් ලීග් තරගාවලියේදී දෙවන වරටත් කඩුලු 2 ක් ලබා ගත් විට, ජාතික තේරීම් කමිටු සාමාජිකයින් එංගලන්තයට කණ්ඩායම් සංචිතයේ ස්ථානයක් ඔහුට ලබා දුන්නේය.සඳකන් විසින් එම සංචාරයට ඩර්බිෂයර්ට එරෙහි තරඟයක් වන ඩර්බිෂයර්ට එරෙහි තරඟයක් එම සංචාරයට එරෙහිව ලකුණු 40 කට කඩුලු 5 ක් ලබා ගත් අතර, පෙරටුගාමී ශ්රී ලංකා ක්රීඩකයින් කිහිප දෙනෙකුට තුවාල සිදු වූ වහාම ජාතික සංචිතයට දෙවන ඇමතුමක් ලබා දෙන ලදී.මේ වතාවේ ඔහුට ජාත්යන්තර මට්ටමින් ක්රීඩා කිරීමට සිදුවිය.",
    "Vishwa Fernando": "මොරටුවා හි වමතින් කඩිමුඩියේ විෂවා ප්රනාන්දු ජාතික රාජකාරිය සඳහා වෙන් කර ඇත.2012 දී සිය පළමු පන්තියේ ආරම්භයක් ලබා ගැනීමෙන් ප්රනාන්දු සිය මංගල කන්නයේ කඩුලු 26 ක් ලබා දෙමින් මුල් විභවය පෙන්නුම් කළේය.ද ප්රනාන්දුගේ පන්දු යැවීම සැමවිටම ඔහුගේ සංඛ්යාලේඛනවලට වඩා හොඳ යැයි සිතමින් සිටියේය.ජාතික සංචිතයට ඔහුගේ පළමු කරුණ පදනම් වී ඇත්තේ තේරීම් කමිටුවකගේ හච් එකකට වඩා සුළු ප්රමාණයක් වන අතර ශ්රී ලංකාවේ දේශීය ක්රිකට් ක්රීඩාවේ කෙටි සැපයුමේ දී රුධිර වමේ වම් අත කික්කම් කිරීමට ඇති ආශාවකි.ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ ප්රනාන්දු 2014 දී ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ 2014 දී නම් කරන ලදී.කෙසේ වෙතත්, ඔහු ජාත්යන්තර තරඟයක් කර නැත, එංගලන්තයට එරෙහිව එංගලන්තයට එරෙහිව නිහතමානී මාලාවක් ක්රීඩා කිරීමට ආපසු නිවසට පැමිණියේය.අගෝස්තු මාසයේදී ඉන්දියාවට එරෙහි තරගාවලිය සඳහා ශ්රී ලංකාවේ ටෙස්ට් සංචිතයේ නම් කරන ලද ඔහු 2015 දී තවත් විවේකයක් ලැබෙනු ඇත.මේ වතාවේ ඔහුගේ තේරීම කඩුලු ලබා ගත්හ.ප්රනාන්දු 2014-15 ප්රනාදියර් ලීග් තරගාවලියේ වඩාත්ම විනිවිද යාමේ ඉක්මන් විය.",
    "Asela Gunaratne": "කඩුල්ලේ බලවත් වෙඩි තැබීමේ චතුරශ්රයක් සහිත පිතිකරණ තුන් ඉරියව්වක් වන අසේලා ගුණරත්න 2016 දී ඉහළ ගෞරවයක් සඳහා සලකා බැලීමට පෙර ශ්රී ලංකා යුද ක්රීඩා සමාජය සඳහා ආකර්ෂණීය කාල කිහිපයක් එක් කළේය. එය වහාම ඇසට හසු වන ක්රීඩකයෙකු නොවේ.මැද පෙළේ පිතිකරණයේදී ගුණරත්න 2012 සහ 2016 අතර අග්රාමාත්ය ලීග් තරගාවලි හතරෙන් 50 කට වඩා වැඩි පිරිසකට සාමාන්යය විය.ඔහු පැත්තකින් තෝරාගත් විට, පාළුවක් වන විට, එහෙත්, සිම්බාබ්වේට විරුද්ධව සිය පළමු ජාත්යන්තර ඉනිමේ, ඔහුගේ පළමු ජාත්යන්තර ඉනිමේ පනස් එකකට පහර දුන් අතර, ටෙස්ට් තරගවලදී වහාම effective ලදායී විය.එම සංචාරයෙන් එංගුලෝ මැතිව්ස් විසින් පාලනය කරන ලද ගුණරත්න එක්දින සංචිතයේ ද එක්දින තරගාවලියේදී ස්ථානයක් උපයා ඇති අතර, ශ්රී ලංකාව ත්රිත්ව කුසලානය දිනාගත් බැවින් කඩුලු 8 ක් දවා ගනිමින් ඔහුගේ ඩිබරල්-අවුල් සහගත මධ්යම පන්දු යැවීම සමඟ බලපෑමක් ඇති කළේයසිම්බාබ්වේ හි, 2016 නොවැම්බරයේදී ශ්රී ලංකාවට ගීලොන්ග් 46 කදී ලකුණු 84 ක් රැස් කිරීම මගින් ඕස්ට්රේලියාවේ විස්සයි 20 මාලාවක් 2017 පෙබරවාරි මාසයේදී ලබා ගැනීමට උපකාරී විය.174 ලුහුබැඳීම.මහනුවර වන මහනුවර ශ්රී රාහුල විද්යාලයේ උපාධිධාරියෙකු වන ගුණරත්න මහතා ශ්රී ලංකා හමුදාවේ බෝම්බ හෙලියෙකු ලෙස ද කටයුතු කර තිබේ.",
    "Lahiru Kumara": "මහනුවර සිට ශක්තිමත්, දකුණු පන්දු පන්දු යවන්නෙකු වන ලහිරු කුමාර 2016 ඔක්තෝම්බර් මාසයේදී ටෙස්ට් සංචිතයේ තෝරා ගැනීමට පෙර පළමු පන්තියේ ක්රිකට් ක්රීඩාවේ දින අටක් පමණක් ක්රීඩා කර තිබුණි. ඔහු බොහෝ දුරට සිටියේයඔහුගේ පොරොන්දුව මත තෝරාගෙන ඇත.ශ්රී ලංකාවේ ක්රමයේ වේගවත්ම පන්දු යවන්නන්ගෙන් එකක් නම් කුමාර තියුණු බවුන්සරයක් ඇති අතර පන්දුව පැද්දීම සහ මැහුම් කිරීමේ හැකියාව - සියල්ල කඩිමුඩියේ තීව්රතාවයට ගැලපේ.ඔහු පෙබරවාරි 19 වන දින පැවති ලෝක කුසලාන තරගාවලියේදී ක්රීඩා කර ඇති නමුත් එය එංගලන්තයේ සංචාරයක යෙදී සිටියේ ඔහු ඉහළ ගෞරවයක් දැක්වීම සඳහා තමන්ව මතභේදයට ලක් කළේය.ඔහු තරුණ පරීක්ෂණවලින් 18.30 කදී ලකුණු 18.30 කදී කඩුලු 3 ක් දවා ගත් අතර, ඊසානද ස්පන්දනයේ විශේෂයෙන් effective ලදායී වූ අතර එහිදී ඔහු දෙවන ඉනිම 82 කට 72 කට ලකුණු 72 කට දැවී ගියේය.වයස අවුරුදු 19 න් පහළ අවුරුදු හයකින් ඔවුන්ගේ පළමු නිවස පරාජයට.දුෂ්මන්ත චමෙරා, නුවන් ප්රදීප් සහ ධම්මිකා ප්රදීද් සහ ධම්මිකා ප්රදීද් සහ ධම්මිකා ප්රදීෆ් සඳහා තුවාල ද ලෙෆ්ට් පසුව ටෙස්ට් කණ්ඩායමේ කුමාර වෙනුවෙන් ස්ථානයක් දිනා ගත්හ.සිම්බාබ්වේ සිය මූලික රංගනය නිහතමානී වුවද, පළමු ඉනිමේදී ලකුණු 122 කට දැවී ගිය දෙවන-ලාංඡනය ළිඳක් ලබා ගැනීම සඳහා කුමාරා දෙවන-ලාබිලුඩ් ශ්රී ලංකා පන්දු යවන්නා බවට පත්විය.",
    "Danushka Gunathilaka": "සදහාෂ්කා ක්රීඩා සමාජයේ කොටසක් වන දනුෂ්කා ගුණතිලකගේ අර්ධ වශයෙන් සුසුෂ්කා ගුණතිලකගේ පඩිපෙළක් වන දනුෂ්කා ගුණතිලකගේ පඩිපෙළ බොහෝ දුරට විභවතාවයන් මත නවීකරණය කරන ලද අතර එය 2015 මැද භාගයේ නවසීලන්තයේ සංචාරය සඳහා ශ්රී ලංකාවේ කණ්ඩායමකට ගෙන ගියේය.ඉනිම හතරකින් ස්මාර්ට් පනස්කිරි දෙකකට පහර දෙමින් ඔහු ඉනිම හතරකින් ස්මාර්ට් පනස්කිරි දෙකකට පහර දෙමින් ඔහු එම සංචාරයේදී පුදුමයට පත් විය.එම රංගනයන් නිසා ඔහු නොවැම්බර් මාසයේදී බටහිර ඉන්දීය කොදෙව් පිලට එරෙහි නිවාස මාලාව සඳහා ජාතික ඇමතුමක් ලබා ගත්තේය.ගුණතිලක පසුව නවසීලන්තයට දෙවන සංචාරයක් ලබා ගත්තේය - මෙවර ජ්යෙෂ් Senior කණ්ඩායම සමඟ දෙවන සංචාරයක් - සහ ඔහුගේ පළමු එක්දින තරග තුනෙන් නිහතමානීව ආපසු පැමිණියද, තරගයෙන් යුත් සම්මානයක් දිනා ගැනීමට නෙල්සන්හිදී 65 ක් පැමිණ සිටියේය.ගුණතිලක මුලින් එංගලන්තයේ 2017 ශූරයන් කුසලානය සඳහා ශ්රී ලංකා සංචිතයේ කොටසක් නොවූවත්, චමරා කපුගෙදර ආබාධයකට ස්තූතිවන්ත වෙමින් තිබේ.ඔහු ලකුණු 72 ක ඉලක්කයක් ලබා ගනිමින් පන්දු 72 කදී ලකුණු 76 ක් රැස් කළේය.සිම්බාබ්වේට එරෙහි එක්දින තරගාවලියේදී පනස් ගණන් තුනක් සහ සමේ ශීර්ෂයක් පවත්වාගෙන යාමෙන් ඉනිම සිදු වූ අතර, පරීක්ෂණ පැත්තට ඇමතුමක් ලබා ගන්න.ටෙස්ට් තරගය බලාපොරොත්තු සුන්වීමකි, ගුණතිලක ඉනිම දෙකෙහිම පහරවල් ලිහිල් කිරීමට පෙර 16 සහ 2 ලකුණු කිරීම.කුමාර් සංගක්කාරට අගය කරන ගුණතිලක, විශේෂයෙන් කඩුල්ලේ ශක්තිමත් චතුරශ්රය, ගුණතිලක, අර්ධකාලීනව නිවාඩු නිකේතනයකි.ඔහු 2009 තරුණ ලෝක කුසලාන තරඟයේදී ශ්රී ලංකාවේ වයස අවුරුදු 19 න් පහළ කණ්ඩායමේ සිටි අතර ඔන්ඩෙට් ෆිදෙල් ප්රනාන්දු",
    "Malinda Pushpakumara": "භයානක වෙනස්කම් සහිත කැනී වම්පස වම්පස දඟ පන්දු යවන්නෙකු වන මාලින්ද පුෂ්පකුමාර මෑත වසරවල මෑත වසරවල වඩාත් ගෘහස්ථ කඩුලු සමග ශ්රී ලංකාවේ වඩාත්ම දක්ෂ ගෘහස්ථ කඩුලු සමනය වී තිබේ.දිවයිනේ පළමු පන්තියේ පීලි දණ්ඩවලට දැඩි ලෙස ගොඩගැසී ඇති නමුත් පවා ඔහු නැගී එන පුෂ්පකුමාරගේ අඛණ්ඩතාවයි.ඔහු 2012-13 සහ 2014-15 තරඟාවලි වල ප්රිමියර් ලීග් තරගාවලියේ ඉහළ කඩුල්ලේ ඉහළම කඩුල්ල විය.නමුත් 2016-17 ජනප්රිය තරගාවලිය වූයේ ඔහුගේ හොඳම තරඟාවලියයි: සාමාන්යයෙන් 13.79 ක් වූ අතර පුෂ්පකුමාරා හිස්කබල් 77 ක් ලබා ගත්හ - ඔහුගේ ළඟම තරඟකරුට වඩා 20 ක්.එමඟින් ඔහු අවසානයේ ශ්රී ලංකා ටෙස්ට් සංචිතයකට බලහත්කාරයෙන් 29 දෙනෙකුගෙන් යුත් සහ පළමු පන්තියේ කඩුලු 558 ක් සමඟ ඔහුගේ නමට දවාගනිමින් සිටියේය.ඔහු ඉහළ මට්ටම සඳහා තෝරා ගැනීම ප්රමාද වීම නිසා රංගන හේරත්ගේ පැමිණීම මෙම කණ්ඩායමේ රැඳී සිටීම සමඟ ද තිබිය යුතුය - තේරීම් කරන්නේ වමතින් දඟ පන්දු යවන්නාට පමණක් විශ්වාස කරන තේරීම් කිරීම අවශ්ය වේ.කොළඹ ලම්බිනි විද්යාලයේ සිය වෘත්තීය ජීවිතය ආරම්භ කිරීමෙන් 2005 දී පුෂ්පකුමාර 2005 දී ශ්රී ලංකාවේ වයස අවුරුදු 19 න් පහළ රෝගිය සඳහා වන අතර එංගලන්ත හා බංග්ලාදේශය ඇතුළත් ත්රිකෝණාකාර තරඟාවලියක් සඳහා ද ක්රීඩා කර තිබේ.පසුව, පළමු පන්තියේ මට්ටමින් වයසින් පසුව, දකුණු අප්රිකාවේ, නවසීලන්තය ඒ හා බටහිර ඉන්දීය කොදෙව්ස් ඒඩවුන්ඩෙල් ප්රනාන්දු",
    "Lahiru Gamage": "",
    "Sadeera Samarawickrama": "දීර් est තම ආකෘතියෙන්, සදීරා සමරාවික්රාම යනු මැද කැබැල්ලක වාදනය කරන කඩුලු රකින්නාගේ පිතිකරුවෙකි.සීමිත ඕවර් ක්රිකට් ක්රීඩාවේදී, ඔහු පුරුද්දක් ලෙස ඔහුගේ කණ්ඩායම් වේගයෙන් ආරම්භක පිතිකරුවෙකු ලෙස ආරම්භ කර තිබේ.කෙසේ වෙතත්, ඔහුගේ මිදි වතු වල පාසල් හැරගිය අය ස්වල්ප දෙනෙක් ජ්යෙෂ් level මට්ටමින් මෙතරම් සාර්ථකව මාරුවීමක් ලබා දී තිබේ.ජාතික තේරීම් කමිටුව විසින් අවධානයට ලක්ව තිබේ.කොළඹ තර්ස්ටන් විද්යාලයේ සිය ක්රිකට් ආරම්භ කර, සමරාවික්රාමයේ ශාන්ත ජෝසෙප් වෙත සාම්ප්රදායික ජෝසෙප් වෙත ගොස්, ශාන්ත ජෝසප්ගේ ලොකුම සවිකිරීමේදී මතක තබා ගත හැකි 126 ට පවා සමෘද්ධිමත් විය.එම කාර්ය සාධනය නිසා ඔහු වයස අවුරුදු 19 න් පහළ සංචිතයට ඔරොත්තු දුන් අතර, ඔහු නැවතත් 2014 තරුණ ලෝක කුසලාන තරගාවලියේදී ලකුණු 44.17 ක් රැස් කළේය.කුසල් මෙන්ඩිස් - එම U-19 පැත්තේ ඔහුගේ කණ්ඩායමේ සහකරු හෝ සහකාරිය ජාතික පැත්තෙන් වේගවත් වූ අතර, සමරාවික්රමට පළමු පන්තියේ රංගනයන් හරහා තම ස්ථානය උපයා ගත යුතුය.කෝල්ට්ස් ක්රිකට් සමාජය සමඟ ඔහුගේ පළමු කන්නය නිහතමානී වූ නමුත් ඔහුගේ දෙවැක්ෂය හොඳ වූ අතර ඔහුගේ තුන්වන කැපී පෙනෙන අයෙකි.සමරාවික්රම 2016-17 කන්නයේ දී ලකුණු 101.76 ක් ලෙස ලකුණු 1016 ක් ලබා ගනිමින් ලකුණු 1016 ක වේගයකින් යුක්ත වේ.2017 පෙබරවාරි මාසයේදී ශ්රී ලංකාව සඳහා වූ මංගල දර්ශනය වන ඔහු ශක්තිමත් එංගලන්ත සිංහ ප්රහාරයකට එරෙහිව පන්දු 223 කදී ලකුණු 185 ක් රැස් කළේය.එම ලකුණු වල පිටුපසින් සමරාවික්රාමයේ පාකිස්තානයට එරෙහි පරීක්ෂණ සඳහා සමරාවික්රාමයේ මේ වසරේ සැප්තැම්බර් මාසයේ සැප්තැම්බර් මාසයේ දී මංගල ශ්රී ලංකා ඇමතුමක් උපයා ගත්තේය",
    "Roshen Silva": "ශ්රී ලංකාවේ බොහෝ ස්ථාවර ගෘහස්ථ පිතිකරුවෙකු වන දුර්ලභ වන්නේ ප්රිමියර් ලීග් තරගාවලියේදී රොෂෙන් සිල්වා 50 ට ආසන්න හෝ ඊට වැඩි හෝ ඊට වැඩි නොගැලපෙන වර්ෂයයි.ඔහුගේ අභියෝගය වී ඇත්තේ කැපී පෙනේ.බොහෝ විට ඕනෑම පළමු පන්තියේ සමයක හොඳම පිතිකරුවෙකු වුවද, සිල්වා කලාතුරකින් ඉහළ ලකුණු ලාභියා හෝ ගෘහස්ථ කැබහන් අතර වඩාත් ස්වාභාවිකවම විදහා දක්වයි.නමුත් අවසානයේදී තමා උපචිත ලකුණු ගොඩවල් ජාතික තේරීම්කරුවන්ගේ උනන්දුව පික් කිරීමට පටන් ගත්තේය.සිල්වා වෙනුවෙන්, 2016 වසර ඉදිරි ගමනකි.ශ්රී ලංකාව සඳහා නවසීලන්තයේ නවසීලන්තයේ නවසීලන්ත සංචාරයකදී සිල්වා 2016 ප්රිමියර් ලීග් තරගාවලියේදී ලකුණු 678 ක් රැස් කළේය.ඔහු එය අනුගමනය කරන විට ශ්රී ලංකාව එංගලන්තයේ ශ්රී ලංකාව වෙනුවෙන් 62.80 කදී ලකුණු 314 ක් රැස් කළ විට ඔහු ටෙස්ට් සංචිතයට කැඳවනු ලැබීය.සිල්වා සිය ශ්රේණි එකක් වී තිබුනේ නම්, ශ්රී ලංකාව පමණයි ශ්රී ලංකාව 3-0 - පිතිකරු පිළිවෙලට වෙනස්කම් කිරීමට අවශ්ය නොවීය.සිල්වා නැවතත් ශ්රී ලංකා සංචිතයේ තෝරා ගනු ලැබීය - මේ වතාවේ සැප්තැම්බර් මාසයේ සැප්තැම්බර් මාසවල සහ 2017 ඔක්තෝම්බර් මාසයේදී ඇඳුමේ යෙදුණු කාලයකදී.සිල්වා ශාන්ත ජෝශප් විද්යාලයේ උපාධිධාරියෙකු වන සිල්වා ශ්රී ලංකාවේ වයස අවුරුදු 19 ක් පමණ වේ. සහ්රෙස් ප්රනාන්දු",
    "Akila Dananjaya": "2012 ලෝක විස්සයි විස්ස තරගාවලියට මූලික සංචිතයේ දී තවත් වාරිකයක් වන අකිලා දන්නන්ජය විසින් 2012 ලෝක විස්සයි විස්ස තරගාවලියට මූලික සංචිතයේ තෝරාගත් විට මතභේදයට තුඩු දුන්හ.කකුලක්, ගෝග්රි, කැරම් බෝල්, ඩෝසෝ, ඩොෂ්රි සහ කඩුල්ලේ පාලනයක් ලබා දීම සඳහා ශ්රී ලංකා පුහුණු සැසිවාරයකු ලෙස මහේලා ජයවර්ධනගේ පුදුමයට පත්වූයේ, ජාතික සංචිතයට වේගයෙන් සොයා ගන්නා ලෙස ජයවර්ධන ඉල්ලා සිටියේය..ශ්රී ලංකා ප්රිමියර් ලීග් තරගාවලියේ ජයවර්ධනගේ වයඹ එක්සත් ඡන්දය සඳහා ඩැනන්ජය නාට්ය වන අතර ලෝක විස්සයි 20 තරගාවලියේදී අවසන් 15 දක්වා තරගාවලියේ දී පැවැත්විණි.ඔහු එම ලෝක විස්සයි විස්ස ප්රචාරක ව්යාපාරයට සැලකිය යුතු දායකත්වයක් ලබා දුන් අතර අවසන් තරඟයේදී ක්රීඩා කළ නමුත් ජයවර්ධන නායකත්වයෙන් බැස ගිය පසු තේරීම් කමිටු වෙත අනුග්රහය දැක්වීය.එතැන් සිට දනංජය ශ්රී ලංකා කණ්ඩායමේ කණ්ඩායමක් තුළ වරින් වර තෝරාගෙන ඇති නමුත්, ඔහුගේ මුල් මාසවල අවධානයට ලක්වූවන්ට අවධානයට ලක් නොවීය.2017 ජුනි මාසයේදී සිම්බාබ්වේට එරෙහිව එක්දින තරග සඳහා ශ්රී ලංකා සංචිතයකදී ඔහු නැවත නැවතත් ලබා ගන්නා ලදී.ඇන්ඩ rew ෆිදෙල් ප්රනාන්දු, 2017 ජූනි",
    "Kasun Rajitha": "2015 ට පෙර පාහේ නොදැනුවත්වම, එම වර්ෂයේ අගෝස්තු මාසයේදී සංචාරක ඉන්දියානුවන්ට එරෙහිව දකුණත මහල කසුන් රාජිතාගේ විභවය පළමුවෙන් පෙනී සිටියේය.දෙවන ඉනිමේදී කොහාලිගේ කඩුල්ල කිකිළියේ ද ෂිකර් ධන්, විරාර් ධන්, විරාත් කොහ්ලි සහ රෝහිත් ෂර්මා ලකුණු 68 කට ලකුණු 5 ක් ලබා ගත්තේය.තියුණු වේගයකින් සැලකිය යුතු මැහුම් චලනයන් සාක්ෂාත් කර ගැනීම, සහ ඉහළ නිකුතුවකින් රජිත පහත සඳහන් ගෘහස්ථ සමයේ විනිවිද යාමේ විස්සයි 20 පන්දු යවන්නෙකු බව ඔප්පු විය.ඔහු සුපර් විස්සයි 20 පළාත් තරගාවලියේ දෙවන ඉහළම කඩුලු ලබා ගන්නා අතර තරග හයකින් හිස්කබල් 10 ක් ඇත.එම කාර්ය සාධනය ඔහුට ජාත්යන්තර විස්සයි 20 තරගයක් ලබා දුන් අතර එහිදී ඔහු පළමු ඕවරයේදී කඩුලු 2 ක් දවාගත්තේය.",
    "Mahela Udawatte": "2003 දී ශ්රී ලංකාවේ වයස අවුරුදු 19 න් පහළ කණ්ඩායමක් ලෙස ආනන්ද විද්යාලය, ආනන්ද විද්යාලය සඳහා ඉහළ පෙළේ පිතිකරුවෙකු ලෙස ලකුණු ලබා ගන්න. ඔහු පාසලෙන් පසු චිලාව් මේරියන්ස් එස්.සී. පන්දුවට පහර දීම සඳහා උසස් කරන ලද - ඔහු 2004-05 යූ -2 23 තරගාවලියේ තරග 5 කට පන්දුවට පහර දුන් අතර, ඔහු 2004-05 U-23 තරගාවලියේ තරග 5 කින් ලකුණු ලබා ගත් අතර සංවර්ධන සංචිතයේ ස්ථානයක් ලබා දුන්නේය. 2005-06 දී එස්එස්සී හි එස්එස්සී හි ප්රමුඛයා වූ ඔහුගේ සමාජ ශාලාව සඳහා 2007 දී එංගලන්තයේ සංචාරය සඳහා ඔහු එංගලන්තයේ සංචාරය සඳහා වූ කණ්ඩායමක් සඳහා වූ ඔහු එය 172 න් 67 ක් එල්ල කරමින් දිල්හාර ප්රනාන්දු සහ නුවන් සොයිසා ඇතුළු පිරිසකට ලකුණු 67 ක් රැස් කළේය. ඉක්මන් පන්දු යවන්නන් රැගෙන යාමට කැමති ප්රබල හා පහර දෙන පිතිකරුවෙකුට ශ්රී ලංකා එක්දින පැත්තෙන් අනාගත අපේක්ෂාවක් ලෙස පෙනේ, සමහර විට සනත් ජයසූරිය වෙනුවට ආදේශකයක් ලෙස විය හැකිය. ශ්රී ලංකාවේ ප්රවීණයන් විසින්, උඩවට්ටේ මහේලා ජයවර්ධන ඇතුළු බටහිර ඉන්දීය කොදෙව්ට් සංචාරය සඳහා ජාතික සංචිතයට ඇමතුමක් ලබා ගත්හ. 2008 ජූලි 2008",
    "Chamika Karunaratne": "",
    "Lasith Embuldeniya": "",
    "Oshada Fernando": "",
    "Wanindu Hasaranga de Silva": "තැලීම් පහළ මැද පෙළ පිතිකරුවෙකු වන අතර ආක්රමණශීලී කකුලක් සහිත පන්දු යවන්නා ශක්තිමත් රිච් රිච්මන්ඩ් විද්යාලයේ ඇඳුමකින් උපාධිය ලබා ඇති අතර එය ශ්රී ලංකාවේ 2015 හා 19 න් පහළ කණ්ඩායම් වෘත්තියේ දී හොඳ ආරම්භයක් ලබා ඇති අතර ඔහුගේ ගෘහස්ථ ක්රිකට් දිවිය සඳහා හොඳ ආරම්භයක් ලබා දී තිබේ.19 න් පහළ මට්ටමින් 19 වන මට්ටමින් බොහෝ දුරට පුදුමයට පත් වූ ඔහුගේ පන්දු යැවීමයි - 2016 තරුණ ලෝක කුසලාන අර්ධ අවසන් පූර්ව වටයේදී එංගලන්ත පිතිකරු ජ්යෙෂ් senior ක්රිකට් ක්රීඩාවේ පළමු with තු තුලදී ඔහු හසුරාගා හි ශක්තිමත් ඇඳුමයි.පෝර්ට්ස් අධිකාරියේ ක්රිකට් සමාජය සමඟ පළමු පන්තියේ තරඟ කිරීම සඳහා හසරංග ප්රථම වරට 87 ක් ලබා ගත් අතර, කොළඹ ක්රිකට් සමාජයට මාරු වී ලකුණු 586 ක් රැස් කළ අතර 2017 අගමැති ලීග් තරගාවලියේදී ලකුණු 536 ක් රැස් කළේය.මෙම පළමු පන්තියේ ලකුණු සාර්ථක වූ විට ගෘහස්ථ තරඟාවලි පිළිබඳ හොඳ පන්දු යැවීමේ ස්වරූපයක් ලබා ගත් විට, හසරංග ජාතික තේරීම් කමිටුගේ උනන්දුව දැක්වීය.ඔහු 2017 ජුනි මාසයේදී සිම්බාබ්වේට එරෙහිව පළමු එක්දින තරඟ දෙක සඳහා ශ්රී ලංකාවේ සංචිතයේ තෝරා ගන්නා ලදී.එය පසුව එය ආරම්භ වූයේ කුමක් ද;ඔහුගේ ජාත්යන්තර වෘත්තියේ 14, 15 සහ 16 යන පන්දු යැවීමත් සමඟ සිම්බාබ්වේගේ වලිගය අතුගා දැමූ විට තොප්පි ට්රේට් එකක් කඩා වැටී ඔහු එක්දින ඉතිහාසයේ තුන්වන විනිවිදකය බවට පත්විය.",
    "Minod Bhanuka": "",
    "Asitha Fernando": "",
    "Ramesh Mendis": "",
    "Pathum Nissanka": "",
    "Praveen Jayawickrama": ""
}