{
    "name":"සනත් ටෙරාන් ජයසූරිය",
    "born":"30/06/1969",
    "batting":"වමත්",
    "bowling":"සෙමෙන් වම් අත ඕතඩොක්ස්",
    "description":"දේශබන්දු සනත් ටෙරාන් ජයසූරිය යනු හිටපු ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙක් සහ ශ්‍රී ලංකා ජාතික කණ්ඩායමේ හිටපු නායකයෙකි. ඔහුගේ යුගයේ සිටි විශිෂ්ඨතම ප්‍රහාරක පිතිකරුවෙකු ලෙස සැලකෙන ජයසූරිය, එක්දින ක්‍රිකට් පිටියේදී සිය බලවත් පහර සහ තරඟ ජයග්රාහී තුන් ඉරියව් දස්කම් වලින් ප්රසිද්ධය. 1990 දශකයේ මැද භාගයේදී රොමේෂ් කළුවිතාරණ සමඟ එක්දින ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාවේ විප්ලවීය වෙනසක් සිදු කළ ජයසූරියට ගෞරවය හිමි වන අතර එමඟින් සියලු ජාතීන්ගේ නවීන දින දැඩි පිතිකරණ උපායමාර්ගය ආරම්භ විය. ජයසූරිය තුන් ඉරියව් ක්‍රීඩකයෙක් වූ අතර දශක හතරක් පුරාවට ජාත්‍යන්තර ක්‍රිකට් දිවියක් ගත කළේය. එක්දින ජාත්‍යන්තර ක්‍රිකට් තරග වලදී ලකුණු 10,000 ඉක්මවා සහ කඩුලු 300 කට වඩා ලබා ගත් එකම ක්‍රීඩකයා ඔහුය. ඔහු තරඟයේ වීරයා 48 ක් සහ මාලාවේ 11 ක ක්‍රීඩකයා ලෙස ද සම්මාන දිනා ගත් අතර එම නිසා සීමිත ඕවර ක්‍රිකට් ඉතිහාසයේ හොඳම තුන් ඉරියව් ක්‍රීඩකයෙකු ලෙස ඔහු සැලකේ.",
    "career":"සනත් ජයසූරිය උපත ලැබුවේ දකුණු ලංකාවේ මාතර නගරයේ ඩන්ස්ටන් සහ බ්‍රීඩා ජයසූරියගේ පවුලටය. ඔහුට වැඩිමහල් සහෝදරයෙකු වන චන්දන ජයසූරිය සිටී. ඔහු අධ්‍යාපනය ලැබුවේ මාතර ශාන්ත සර්වේශස් විද්‍යාලයෙන් වන අතර එහිදී ඔහුගේ ක්‍රිකට් හැකියාවන් පෝෂණය කළේ ඔහුගේ විදුහල්පති ජීඑල් ගලප්පති සහ ක්‍රිකට් පුහුණුකරු ලයනල් වගසිංහ විසිනි. ඔහු මාතර ශාන්ත සර්වේශස් විද්‍යාලයේ සිටියදී ක්‍රිකට් ක්‍රීඩාවෙන් දස්කම් දැක්වූ අතර වාර්ෂික ශාන්ත තෝමස් - ශාන්ත විද්‍යාලයේ ක්‍රිකට් කණ්ඩායමේ නායකයා විය. 1988 දී සර්වේශස් ක්‍රිකට් හමුව එම වසරේම ඔබ්සර්වර් පාසල් ක්‍රිකට් සම්මාන ප්‍රදානෝත්සවය.  ජයසූරිය 1988 දී ඕස්ට්‍රේලියාවේදී පැවති 19 වැනි වයස 19 න් පහළ ක්‍රිකට් ලෝක කුසලාන ක්‍රිකට් තරගාවලිය සඳහා ශ්‍රී ලංකාව නියෝජනය කළ අතර පසුව මාස කිහිපයකට පසු පාකිස්තානයේ සංචාරයකට ශ්‍රී ලංකා ‘බී’ කණ්ඩායම සමඟ තේරී පත් වූ අතර එහිදී ඔහු නොදැවී ද්විත්ව ශතක දෙකක් වාර්තා කළේය. . ටික කලකට පසු 1989-90 දී ඕස්ට්‍රේලියාවේ සංචාරය සඳහා ඔහුව ජාතික පැත්තට ගෙන යන ලදී.  ඔහු 1989 බොක්සිං දිනයේදී මෙල්බර්න් හිදී ඕස්ට්‍රේලියාවට එරෙහිව ඔස්ට්‍රේලියාවට එරෙහිව පළමු එක්දින ජාත්‍යන්තර තරඟය ක්‍රීඩා කළ අතර 1991 පෙබරවාරියේදී නවසීලන්තයට එරෙහිව හැමිල්ටන්හිදී සිය මංගල ටෙස්ට් තරගය ආරම්භ කළේය.",
    "stats":{
        "test":{
            "matches":110,
            "runs":6973,
            "wickets":98,
            "top_score":340,
            "best_bowling":"5/34"
        }
    }
}






